[Survived] BlockStatement
helpers/array/_byAccessor.ts:31:81
  * a string/key-array path is resolved via `parsePropertyPath` + `walkPropertyPath`.
  * @ignore
  */
-export function toByAccessorFn<T>(accessor: ByAccessor<T>): (item: T) => number {
-  if (typeof accessor === 'function') return accessor;
-  const keys = typeof accessor === 'string' ? parsePropertyPath(accessor) : accessor;
-  return (item: T) => walkPropertyPath(item, keys) as number;
-}
+export function toByAccessorFn<T>(accessor: ByAccessor<T>): (item: T) => number {}
 

[Survived] ConditionalExpression
helpers/array/_byAccessor.ts:32:7
  * @ignore
  */
 export function toByAccessorFn<T>(accessor: ByAccessor<T>): (item: T) => number {
-  if (typeof accessor === 'function') return accessor;
+  if (true) return accessor;
   const keys = typeof accessor === 'string' ? parsePropertyPath(accessor) : accessor;
   return (item: T) => walkPropertyPath(item, keys) as number;

[Survived] ConditionalExpression
helpers/array/_byAccessor.ts:32:7
  * @ignore
  */
 export function toByAccessorFn<T>(accessor: ByAccessor<T>): (item: T) => number {
-  if (typeof accessor === 'function') return accessor;
+  if (false) return accessor;
   const keys = typeof accessor === 'string' ? parsePropertyPath(accessor) : accessor;
   return (item: T) => walkPropertyPath(item, keys) as number;

[Survived] EqualityOperator
helpers/array/_byAccessor.ts:33:16
  */
 export function toByAccessorFn<T>(accessor: ByAccessor<T>): (item: T) => number {
   if (typeof accessor === 'function') return accessor;
-  const keys = typeof accessor === 'string' ? parsePropertyPath(accessor) : accessor;
+  const keys = typeof accessor !== 'string' ? parsePropertyPath(accessor) : accessor;
   return (item: T) => walkPropertyPath(item, keys) as number;
 }

[Survived] ConditionalExpression
helpers/array/_byAccessor.ts:33:16
  */
 export function toByAccessorFn<T>(accessor: ByAccessor<T>): (item: T) => number {
   if (typeof accessor === 'function') return accessor;
-  const keys = typeof accessor === 'string' ? parsePropertyPath(accessor) : accessor;
+  const keys = true ? parsePropertyPath(accessor) : accessor;
   return (item: T) => walkPropertyPath(item, keys) as number;
 }

[Survived] ArrowFunction
helpers/array/_byAccessor.ts:34:10
 export function toByAccessorFn<T>(accessor: ByAccessor<T>): (item: T) => number {
   if (typeof accessor === 'function') return accessor;
   const keys = typeof accessor === 'string' ? parsePropertyPath(accessor) : accessor;
-  return (item: T) => walkPropertyPath(item, keys) as number;
+  return () => undefined;
 }
 
