[Killed] StringLiteral
helpers/string/unescapeHtml.ts:12:13
   '&amp;': '&',
   '&lt;': '<',
   '&gt;': '>',
-  '&quot;': '"',
+  '&quot;': "",
   '&#39;': "'",
 };
killedBy: injectWordBreaks Pass 5 — leading punct at end with no right neighbour stays alone
statusReason: Property failed after 10 tests
{ seed: -396408648, path: "9:1:0", endOnFailure: true }
Counterexample: ["\""]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BlockStatement
helpers/string/unescapeHtml.ts:36:51
  * // => true
  * @since 3.0.0
  */
-export function unescapeHtml(str: string): string {
-  return str.replace(HTML_UNESCAPE_REGEX, (entity) => HTML_UNESCAPES[entity] as string);
-}
+export function unescapeHtml(str: string): string {}
 

[Survived] ArrowFunction
helpers/string/unescapeHtml.ts:37:43
  * @since 3.0.0
  */
 export function unescapeHtml(str: string): string {
-  return str.replace(HTML_UNESCAPE_REGEX, (entity) => HTML_UNESCAPES[entity] as string);
+  return str.replace(HTML_UNESCAPE_REGEX, () => undefined);
 }
 
