[Survived] BlockStatement
helpers/number/correctFloat.ts:38:77
  * correctFloat(1.23456789, 6) // => 1.23457
  * @since 2.0.2
  */
-export function correctFloat(value: number, precision: number = 14): number {
-  if (!Number.isFinite(value)) {
-    throw new RangeError(`correctFloat: value must be a finite number, got ${value}`);
-  }
-  if (!Number.isInteger(precision) || precision < 1 || precision > 100) {
-    throw new RangeError(`correctFloat: precision must be an integer between 1 and 100, got ${precision}`);
-  }
-  const result = parseFloat(value.toPrecision(precision));
-  // toPrecision(-0) produces "0.000…" (no minus sign per spec) — restore the sign bit.
-  return Object.is(value, -0) ? -0 : result;
-}
+export function correctFloat(value: number, precision: number = 14): number {}
 

[Survived] BooleanLiteral
helpers/number/correctFloat.ts:39:7
  * @since 2.0.2
  */
 export function correctFloat(value: number, precision: number = 14): number {
-  if (!Number.isFinite(value)) {
+  if (Number.isFinite(value)) {
     throw new RangeError(`correctFloat: value must be a finite number, got ${value}`);
   }

[Survived] ConditionalExpression
helpers/number/correctFloat.ts:39:7
  * @since 2.0.2
  */
 export function correctFloat(value: number, precision: number = 14): number {
-  if (!Number.isFinite(value)) {
+  if (true) {
     throw new RangeError(`correctFloat: value must be a finite number, got ${value}`);
   }

[Survived] EqualityOperator
helpers/number/correctFloat.ts:42:56
   if (!Number.isFinite(value)) {
     throw new RangeError(`correctFloat: value must be a finite number, got ${value}`);
   }
-  if (!Number.isInteger(precision) || precision < 1 || precision > 100) {
+  if (!Number.isInteger(precision) || precision < 1 || precision <= 100) {
     throw new RangeError(`correctFloat: precision must be an integer between 1 and 100, got ${precision}`);
   }

[Survived] ConditionalExpression
helpers/number/correctFloat.ts:42:56
   if (!Number.isFinite(value)) {
     throw new RangeError(`correctFloat: value must be a finite number, got ${value}`);
   }
-  if (!Number.isInteger(precision) || precision < 1 || precision > 100) {
+  if (!Number.isInteger(precision) || precision < 1 || false) {
     throw new RangeError(`correctFloat: precision must be an integer between 1 and 100, got ${precision}`);
   }

[Survived] StringLiteral
helpers/number/correctFloat.ts:43:26
     throw new RangeError(`correctFloat: value must be a finite number, got ${value}`);
   }
   if (!Number.isInteger(precision) || precision < 1 || precision > 100) {
-    throw new RangeError(`correctFloat: precision must be an integer between 1 and 100, got ${precision}`);
+    throw new RangeError(``);
   }
   const result = parseFloat(value.toPrecision(precision));

[Survived] UnaryOperator
helpers/number/correctFloat.ts:47:33
   }
   const result = parseFloat(value.toPrecision(precision));
   // toPrecision(-0) produces "0.000…" (no minus sign per spec) — restore the sign bit.
-  return Object.is(value, -0) ? -0 : result;
+  return Object.is(value, -0) ? +0 : result;
 }
 

[Survived] UnaryOperator
helpers/number/correctFloat.ts:47:27
   }
   const result = parseFloat(value.toPrecision(precision));
   // toPrecision(-0) produces "0.000…" (no minus sign per spec) — restore the sign bit.
-  return Object.is(value, -0) ? -0 : result;
+  return Object.is(value, +0) ? -0 : result;
 }
 
