[Survived] BlockStatement
helpers/array/chunk.ts:15:87
  * @returns Array of chunks
  * @since 1.9.0
  */
-export function chunk<T>(array: readonly T[] | null | undefined, size: number): T[][] {
-  if (array == null || size <= 0) return [];
-  const result: T[][] = [];
-  for (let i = 0; i < array.length; i += size) {
-    result.push(array.slice(i, i + size));
-  }
-  return result;
-}
+export function chunk<T>(array: readonly T[] | null | undefined, size: number): T[][] {}
 

[Survived] LogicalOperator
helpers/array/chunk.ts:16:7
  * @since 1.9.0
  */
 export function chunk<T>(array: readonly T[] | null | undefined, size: number): T[][] {
-  if (array == null || size <= 0) return [];
+  if (array == null && size <= 0) return [];
   const result: T[][] = [];
   for (let i = 0; i < array.length; i += size) {

[Survived] EqualityOperator
helpers/array/chunk.ts:16:7
  * @since 1.9.0
  */
 export function chunk<T>(array: readonly T[] | null | undefined, size: number): T[][] {
-  if (array == null || size <= 0) return [];
+  if (array != null || size <= 0) return [];
   const result: T[][] = [];
   for (let i = 0; i < array.length; i += size) {

[Killed] EqualityOperator
helpers/array/chunk.ts:18:19
 export function chunk<T>(array: readonly T[] | null | undefined, size: number): T[][] {
   if (array == null || size <= 0) return [];
   const result: T[][] = [];
-  for (let i = 0; i < array.length; i += size) {
+  for (let i = 0; i <= array.length; i += size) {
     result.push(array.slice(i, i + size));
   }
killedBy: parallel — property-based results are in the same order as the input
statusReason: expected [ [] ] to deeply equal []
