[Survived] BooleanLiteral
helpers/array/createSortByBooleanFn.ts:29:24
  */
 export function createSortByBooleanFn<T extends Record<string, unknown>>(
   property: keyof T,
-  trueFirst: boolean = true,
+  trueFirst: boolean = false,
 ): SortFn<T> {
   const sign = trueFirst ? -1 : 1;

[Survived] BlockStatement
helpers/array/createSortByBooleanFn.ts:30:14
 export function createSortByBooleanFn<T extends Record<string, unknown>>(
   property: keyof T,
   trueFirst: boolean = true,
-): SortFn<T> {
-  const sign = trueFirst ? -1 : 1;
-  return (a: T, b: T) => {
-    const aVal = Boolean(a[property]);
-    const bVal = Boolean(b[property]);
-    if (aVal === bVal) return 0;
-    return aVal ? sign : -sign;
-  };
-}
+): SortFn<T> {}
 

[Survived] UnaryOperator
helpers/array/createSortByBooleanFn.ts:31:28
   property: keyof T,
   trueFirst: boolean = true,
 ): SortFn<T> {
-  const sign = trueFirst ? -1 : 1;
+  const sign = trueFirst ? +1 : 1;
   return (a: T, b: T) => {
     const aVal = Boolean(a[property]);

[Survived] BlockStatement
helpers/array/createSortByBooleanFn.ts:32:26
   trueFirst: boolean = true,
 ): SortFn<T> {
   const sign = trueFirst ? -1 : 1;
-  return (a: T, b: T) => {
-    const aVal = Boolean(a[property]);
-    const bVal = Boolean(b[property]);
-    if (aVal === bVal) return 0;
-    return aVal ? sign : -sign;
-  };
+  return (a: T, b: T) => {};
 }
 

[Survived] ConditionalExpression
helpers/array/createSortByBooleanFn.ts:35:9
   return (a: T, b: T) => {
     const aVal = Boolean(a[property]);
     const bVal = Boolean(b[property]);
-    if (aVal === bVal) return 0;
+    if (false) return 0;
     return aVal ? sign : -sign;
   };

[Survived] EqualityOperator
helpers/array/createSortByBooleanFn.ts:35:9
   return (a: T, b: T) => {
     const aVal = Boolean(a[property]);
     const bVal = Boolean(b[property]);
-    if (aVal === bVal) return 0;
+    if (aVal !== bVal) return 0;
     return aVal ? sign : -sign;
   };

[Survived] UnaryOperator
helpers/array/createSortByBooleanFn.ts:36:26
     const aVal = Boolean(a[property]);
     const bVal = Boolean(b[property]);
     if (aVal === bVal) return 0;
-    return aVal ? sign : -sign;
+    return aVal ? sign : +sign;
   };
 }
