[Survived] BlockStatement
helpers/array/isNonEmpty.ts:19:102
  * isNonEmpty(undefined) // => false
  * @since 2.0.3
  */
-export function isNonEmpty<T>(value: readonly T[] | null | undefined): value is readonly [T, ...T[]] {
-  return value != null && value.length > 0;
-}
+export function isNonEmpty<T>(value: readonly T[] | null | undefined): value is readonly [T, ...T[]] {}
 

[Survived] ConditionalExpression
helpers/array/isNonEmpty.ts:20:10
  * @since 2.0.3
  */
 export function isNonEmpty<T>(value: readonly T[] | null | undefined): value is readonly [T, ...T[]] {
-  return value != null && value.length > 0;
+  return false;
 }
 

[Survived] ConditionalExpression
helpers/array/isNonEmpty.ts:20:10
  * @since 2.0.3
  */
 export function isNonEmpty<T>(value: readonly T[] | null | undefined): value is readonly [T, ...T[]] {
-  return value != null && value.length > 0;
+  return true;
 }
 
