[Survived] BlockStatement
helpers/array/mean.ts:23:56
  * mean([])            // => NaN
  * @since 2.0.0
  */
-export function mean(array: readonly number[]): number {
-  if (array.length === 0) return NaN;
-  return sum(array) / array.length;
-}
+export function mean(array: readonly number[]): number {}
 

[Survived] ConditionalExpression
helpers/array/mean.ts:24:7
  * @since 2.0.0
  */
 export function mean(array: readonly number[]): number {
-  if (array.length === 0) return NaN;
+  if (false) return NaN;
   return sum(array) / array.length;
 }

[Survived] ArithmeticOperator
helpers/array/mean.ts:25:10
  */
 export function mean(array: readonly number[]): number {
   if (array.length === 0) return NaN;
-  return sum(array) / array.length;
+  return sum(array) * array.length;
 }
 
