[Survived] BlockStatement
helpers/array/replaceOrAppend.ts:28:8
   array: readonly T[] | null | undefined,
   item: T,
   predicate: (existing: T) => boolean,
-): T[] {
-  const list = array ?? [];
-  const index = list.findIndex(predicate);
-
-  if (index === -1) return [...list, item];
-  return [...list.slice(0, index), item, ...list.slice(index + 1)];
-}
+): T[] {}
 

[Survived] LogicalOperator
helpers/array/replaceOrAppend.ts:29:16
   item: T,
   predicate: (existing: T) => boolean,
 ): T[] {
-  const list = array ?? [];
+  const list = array && [];
   const index = list.findIndex(predicate);
 

[Survived] ConditionalExpression
helpers/array/replaceOrAppend.ts:32:7
   const list = array ?? [];
   const index = list.findIndex(predicate);
 
-  if (index === -1) return [...list, item];
+  if (false) return [...list, item];
   return [...list.slice(0, index), item, ...list.slice(index + 1)];
 }

[Survived] EqualityOperator
helpers/array/replaceOrAppend.ts:32:7
   const list = array ?? [];
   const index = list.findIndex(predicate);
 
-  if (index === -1) return [...list, item];
+  if (index !== -1) return [...list, item];
   return [...list.slice(0, index), item, ...list.slice(index + 1)];
 }

[Survived] MethodExpression
helpers/array/replaceOrAppend.ts:33:45
   const index = list.findIndex(predicate);
 
   if (index === -1) return [...list, item];
-  return [...list.slice(0, index), item, ...list.slice(index + 1)];
+  return [...list.slice(0, index), item, ...list];
 }
 

[Survived] ArithmeticOperator
helpers/array/replaceOrAppend.ts:33:56
   const index = list.findIndex(predicate);
 
   if (index === -1) return [...list, item];
-  return [...list.slice(0, index), item, ...list.slice(index + 1)];
+  return [...list.slice(0, index), item, ...list.slice(index - 1)];
 }
 
