[Killed] ArrowFunction
helpers/array/sort.ts:40:48
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortStringAscFn: SortFn<string> = (a: string, b: string) => getStringCollator().compare(a, b);
+export const sortStringAscFn: SortFn<string> = () => undefined;
 
 /**
killedBy: tryit — contract works with JSON.parse success
statusReason: expected [ 'banana', 'apple', 'cherry' ] to deeply equal [ 'apple', 'banana', 'cherry' ]

[Killed] ArrowFunction
helpers/array/sort.ts:49:49
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortStringDescFn: SortFn<string> = (a: string, b: string) => getStringCollator().compare(b, a);
+export const sortStringDescFn: SortFn<string> = () => undefined;
 
 /**
killedBy: tryit — contract works with JSON.parse failure
statusReason: expected [ 'banana', 'apple', 'cherry' ] to deeply equal [ 'cherry', 'banana', 'apple' ]

[Killed] ArrowFunction
helpers/array/sort.ts:58:59
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortStringAscInsensitiveFn: SortFn<string> = (a: string, b: string) =>
-  getStringCollatorInsensitive().compare(a, b);
+export const sortStringAscInsensitiveFn: SortFn<string> = () => undefined;
 
killedBy: ensureDate — property-based valid Date inputs always return a Date
statusReason: expected [ 'Banana', 'apple', 'Cherry' ] to deeply equal [ 'apple', 'Banana', 'Cherry' ]
