[Survived] BlockStatement
helpers/array/sumBy.ts:23:99
  * // => 30
  * @since 3.0.3
  */
-export function sumBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
-  if (array == null) return 0;
-  const fn = toByAccessorFn(accessor);
-  return array.reduce((acc, item) => acc + fn(item), 0);
-}
+export function sumBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {}
 

[Survived] ConditionalExpression
helpers/array/sumBy.ts:24:7
  * @since 3.0.3
  */
 export function sumBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
-  if (array == null) return 0;
+  if (false) return 0;
   const fn = toByAccessorFn(accessor);
   return array.reduce((acc, item) => acc + fn(item), 0);

[Survived] EqualityOperator
helpers/array/sumBy.ts:24:7
  * @since 3.0.3
  */
 export function sumBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
-  if (array == null) return 0;
+  if (array != null) return 0;
   const fn = toByAccessorFn(accessor);
   return array.reduce((acc, item) => acc + fn(item), 0);

[Survived] ArrowFunction
helpers/array/sumBy.ts:26:23
 export function sumBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
   if (array == null) return 0;
   const fn = toByAccessorFn(accessor);
-  return array.reduce((acc, item) => acc + fn(item), 0);
+  return array.reduce(() => undefined, 0);
 }
 

[Survived] ArithmeticOperator
helpers/array/sumBy.ts:26:38
 export function sumBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
   if (array == null) return 0;
   const fn = toByAccessorFn(accessor);
-  return array.reduce((acc, item) => acc + fn(item), 0);
+  return array.reduce((acc, item) => acc - fn(item), 0);
 }
 
