[Survived] BlockStatement
helpers/array/uniqueBy.ts:37:131
  * // => [{ id: 1, v: 'c' }, { id: 2, v: 'b' }]
  * @since 3.0.8
  */
-export function uniqueBy<T, K>(array: readonly T[] | null | undefined, keyFn: (item: T) => K, options: UniqueByOptions = {}): T[] {
-  if (array == null) return [];
-  const { keep = 'first' } = options;
-  const byKey = new Map<K, T>();
-  for (const item of array) {
-    const key = keyFn(item);
-    if (keep === 'last' || !byKey.has(key)) byKey.set(key, item);
-  }
-  return Array.from(byKey.values());
-}
+export function uniqueBy<T, K>(array: readonly T[] | null | undefined, keyFn: (item: T) => K, options: UniqueByOptions = {}): T[] {}
 

[Survived] ConditionalExpression
helpers/array/uniqueBy.ts:38:7
  * @since 3.0.8
  */
 export function uniqueBy<T, K>(array: readonly T[] | null | undefined, keyFn: (item: T) => K, options: UniqueByOptions = {}): T[] {
-  if (array == null) return [];
+  if (false) return [];
   const { keep = 'first' } = options;
   const byKey = new Map<K, T>();

[Survived] ConditionalExpression
helpers/array/uniqueBy.ts:38:7
  * @since 3.0.8
  */
 export function uniqueBy<T, K>(array: readonly T[] | null | undefined, keyFn: (item: T) => K, options: UniqueByOptions = {}): T[] {
-  if (array == null) return [];
+  if (true) return [];
   const { keep = 'first' } = options;
   const byKey = new Map<K, T>();

[Survived] BlockStatement
helpers/array/uniqueBy.ts:41:29
   if (array == null) return [];
   const { keep = 'first' } = options;
   const byKey = new Map<K, T>();
-  for (const item of array) {
-    const key = keyFn(item);
-    if (keep === 'last' || !byKey.has(key)) byKey.set(key, item);
-  }
+  for (const item of array) {}
   return Array.from(byKey.values());
 }

[Survived] ConditionalExpression
helpers/array/uniqueBy.ts:43:9
   const byKey = new Map<K, T>();
   for (const item of array) {
     const key = keyFn(item);
-    if (keep === 'last' || !byKey.has(key)) byKey.set(key, item);
+    if (false) byKey.set(key, item);
   }
   return Array.from(byKey.values());

[Survived] ConditionalExpression
helpers/array/uniqueBy.ts:43:9
   const byKey = new Map<K, T>();
   for (const item of array) {
     const key = keyFn(item);
-    if (keep === 'last' || !byKey.has(key)) byKey.set(key, item);
+    if (false || !byKey.has(key)) byKey.set(key, item);
   }
   return Array.from(byKey.values());
