[Survived] BlockStatement
helpers/color/rgbToHex.ts:10:39
 import { clamp } from '../number/clamp';
 import type { RgbColor } from './hexToRgb';
 
-function toHexByte(n: number): string {
-  return Math.round(clamp(n, 0, 255)).toString(16).padStart(2, '0');
-}
+function toHexByte(n: number): string {}
 
 /**

[Survived] BlockStatement
helpers/color/rgbToHex.ts:28:64
  * rgbToHex({ r: 0, g: 255, b: 0, a: 0.5 }) // => '#00ff0080'
  * @since 3.0.0
  */
-export function rgbToHex({ r, g, b, a = 1 }: RgbColor): string {
-  const alpha = clamp(a, 0, 1);
-  const base = `#${toHexByte(r)}${toHexByte(g)}${toHexByte(b)}`;
-  return alpha >= 1 ? base : `${base}${toHexByte(alpha * 255)}`;
-}
+export function rgbToHex({ r, g, b, a = 1 }: RgbColor): string {}
 

[Survived] EqualityOperator
helpers/color/rgbToHex.ts:31:10
 export function rgbToHex({ r, g, b, a = 1 }: RgbColor): string {
   const alpha = clamp(a, 0, 1);
   const base = `#${toHexByte(r)}${toHexByte(g)}${toHexByte(b)}`;
-  return alpha >= 1 ? base : `${base}${toHexByte(alpha * 255)}`;
+  return alpha > 1 ? base : `${base}${toHexByte(alpha * 255)}`;
 }
 

[Survived] ConditionalExpression
helpers/color/rgbToHex.ts:31:10
 export function rgbToHex({ r, g, b, a = 1 }: RgbColor): string {
   const alpha = clamp(a, 0, 1);
   const base = `#${toHexByte(r)}${toHexByte(g)}${toHexByte(b)}`;
-  return alpha >= 1 ? base : `${base}${toHexByte(alpha * 255)}`;
+  return true ? base : `${base}${toHexByte(alpha * 255)}`;
 }
 
