[Killed] Regex
helpers/date/parseDuration.ts:7:23
  * SPDX-License-Identifier: LGPL-3.0-or-later
  */
 
-const DURATION_PART = /(\d+(?:\.\d+)?)\s*(h|m|s)/gi;
+const DURATION_PART = /(\d+(?:\.\d+))\s*(h|m|s)/gi;
 
 const UNIT_MS: Record<string, number> = {
killedBy: walkPropertyPath returns undefined when the root value is null or undefined
statusReason: Property failed after 1 tests
{ seed: -268342836, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BlockStatement
helpers/date/parseDuration.ts:33:59
  * parseDuration('garbage')    // => null
  * @since 3.0.0
  */
-export function parseDuration(str: string): number | null {
-  const trimmed = str.trim();
-  if (trimmed === '') return null;
-
-  const negative = trimmed.startsWith('-');
-  const unsigned = negative ? trimmed.slice(1) : trimmed;
-
-  let totalMs = 0;
-  let matched = false;
-  let match: RegExpExecArray | null;
-  DURATION_PART.lastIndex = 0;
-  while ((match = DURATION_PART.exec(unsigned)) !== null) {
-    matched = true;
-    const value = Number.parseFloat(match[1]!);
-    const unit = match[2]!.toLowerCase();
-    totalMs += value * UNIT_MS[unit]!;
-  }
-
-  if (!matched) return null;
-  return negative ? -totalMs : totalMs;
-}
+export function parseDuration(str: string): number | null {}
 

[Survived] MethodExpression
helpers/date/parseDuration.ts:34:19
  * @since 3.0.0
  */
 export function parseDuration(str: string): number | null {
-  const trimmed = str.trim();
+  const trimmed = str;
   if (trimmed === '') return null;
 

[Survived] ConditionalExpression
helpers/date/parseDuration.ts:35:7
  */
 export function parseDuration(str: string): number | null {
   const trimmed = str.trim();
-  if (trimmed === '') return null;
+  if (true) return null;
 
   const negative = trimmed.startsWith('-');

[Survived] EqualityOperator
helpers/date/parseDuration.ts:35:7
  */
 export function parseDuration(str: string): number | null {
   const trimmed = str.trim();
-  if (trimmed === '') return null;
+  if (trimmed !== '') return null;
 
   const negative = trimmed.startsWith('-');

[Survived] MethodExpression
helpers/date/parseDuration.ts:37:20
   const trimmed = str.trim();
   if (trimmed === '') return null;
 
-  const negative = trimmed.startsWith('-');
+  const negative = trimmed.endsWith('-');
   const unsigned = negative ? trimmed.slice(1) : trimmed;
 

[Survived] MethodExpression
helpers/date/parseDuration.ts:38:31
   if (trimmed === '') return null;
 
   const negative = trimmed.startsWith('-');
-  const unsigned = negative ? trimmed.slice(1) : trimmed;
+  const unsigned = negative ? trimmed : trimmed;
 
   let totalMs = 0;

[Survived] BooleanLiteral
helpers/date/parseDuration.ts:41:17
   const unsigned = negative ? trimmed.slice(1) : trimmed;
 
   let totalMs = 0;
-  let matched = false;
+  let matched = true;
   let match: RegExpExecArray | null;
   DURATION_PART.lastIndex = 0;

[Survived] ConditionalExpression
helpers/date/parseDuration.ts:44:10
   let matched = false;
   let match: RegExpExecArray | null;
   DURATION_PART.lastIndex = 0;
-  while ((match = DURATION_PART.exec(unsigned)) !== null) {
+  while (false) {
     matched = true;
     const value = Number.parseFloat(match[1]!);

[Survived] BlockStatement
helpers/date/parseDuration.ts:44:59
   let matched = false;
   let match: RegExpExecArray | null;
   DURATION_PART.lastIndex = 0;
-  while ((match = DURATION_PART.exec(unsigned)) !== null) {
-    matched = true;
-    const value = Number.parseFloat(match[1]!);
-    const unit = match[2]!.toLowerCase();
-    totalMs += value * UNIT_MS[unit]!;
-  }
+  while ((match = DURATION_PART.exec(unsigned)) !== null) {}
 
   if (!matched) return null;

[Survived] BooleanLiteral
helpers/date/parseDuration.ts:45:15
   let match: RegExpExecArray | null;
   DURATION_PART.lastIndex = 0;
   while ((match = DURATION_PART.exec(unsigned)) !== null) {
-    matched = true;
+    matched = false;
     const value = Number.parseFloat(match[1]!);
     const unit = match[2]!.toLowerCase();

[Survived] MethodExpression
helpers/date/parseDuration.ts:47:18
   while ((match = DURATION_PART.exec(unsigned)) !== null) {
     matched = true;
     const value = Number.parseFloat(match[1]!);
-    const unit = match[2]!.toLowerCase();
+    const unit = match[2]!.toUpperCase();
     totalMs += value * UNIT_MS[unit]!;
   }

[Survived] AssignmentOperator
helpers/date/parseDuration.ts:48:5
     matched = true;
     const value = Number.parseFloat(match[1]!);
     const unit = match[2]!.toLowerCase();
-    totalMs += value * UNIT_MS[unit]!;
+    totalMs -= value * UNIT_MS[unit]!;
   }
 

[Survived] ArithmeticOperator
helpers/date/parseDuration.ts:48:16
     matched = true;
     const value = Number.parseFloat(match[1]!);
     const unit = match[2]!.toLowerCase();
-    totalMs += value * UNIT_MS[unit]!;
+    totalMs += value / UNIT_MS[unit]!;
   }
 

[Survived] BooleanLiteral
helpers/date/parseDuration.ts:51:7
     totalMs += value * UNIT_MS[unit]!;
   }
 
-  if (!matched) return null;
+  if (matched) return null;
   return negative ? -totalMs : totalMs;
 }

[Survived] ConditionalExpression
helpers/date/parseDuration.ts:51:7
     totalMs += value * UNIT_MS[unit]!;
   }
 
-  if (!matched) return null;
+  if (true) return null;
   return negative ? -totalMs : totalMs;
 }

[Survived] UnaryOperator
helpers/date/parseDuration.ts:52:21
   }
 
   if (!matched) return null;
-  return negative ? -totalMs : totalMs;
+  return negative ? +totalMs : totalMs;
 }
 
