[Survived] OptionalChaining
helpers/function/memoize.ts:34:19
  * @since 1.9.0
  */
 export function memoize<A extends unknown[], R>(func: (...args: A) => R, options?: MemoizeOptions): (...args: A) => R {
-  const maxSize = options?.maxSize;
+  const maxSize = options.maxSize;
   const cache = new Map<string, R>();
 

[Survived] BlockStatement
helpers/function/memoize.ts:37:29
   const maxSize = options?.maxSize;
   const cache = new Map<string, R>();
 
-  return (...args: A): R => {
-    // Wrap each argument as [value] so undefined (→ []) and null (→ [null]) produce
-    // distinct JSON keys. A string sentinel would collide if that string were passed as arg.
-    const key = JSON.stringify(args.map(a => (a === undefined ? [] : [a])));
-
-    if (cache.has(key)) {
-      return cache.get(key)!;
-    }
-
-    const result = func(...args);
-
-    if (maxSize !== undefined && cache.size >= maxSize) {
-      const first = cache.keys().next();
-      // first.done only when the cache is empty, which happens iff maxSize === 0.
-      // Nothing was evicted, so skip the insert too — otherwise we'd hold 1 entry
-      // despite a stated limit of 0.
-      if (!first.done) cache.delete(first.value);
-      else return result;
-    }
-
-    cache.set(key, result);
-    return result;
-  };
+  return (...args: A): R => {};
 }
 

[Survived] ConditionalExpression
helpers/function/memoize.ts:40:47
   return (...args: A): R => {
     // Wrap each argument as [value] so undefined (→ []) and null (→ [null]) produce
     // distinct JSON keys. A string sentinel would collide if that string were passed as arg.
-    const key = JSON.stringify(args.map(a => (a === undefined ? [] : [a])));
+    const key = JSON.stringify(args.map(a => (true ? [] : [a])));
 
     if (cache.has(key)) {

[Survived] ArrowFunction
helpers/function/memoize.ts:40:41
   return (...args: A): R => {
     // Wrap each argument as [value] so undefined (→ []) and null (→ [null]) produce
     // distinct JSON keys. A string sentinel would collide if that string were passed as arg.
-    const key = JSON.stringify(args.map(a => (a === undefined ? [] : [a])));
+    const key = JSON.stringify(args.map(() => undefined));
 
     if (cache.has(key)) {

[Killed] ConditionalExpression
helpers/function/memoize.ts:42:9
     // distinct JSON keys. A string sentinel would collide if that string were passed as arg.
     const key = JSON.stringify(args.map(a => (a === undefined ? [] : [a])));
 
-    if (cache.has(key)) {
+    if (false) {
       return cache.get(key)!;
     }
killedBy: addYears should handle zero
statusReason: Property failed after 1 tests
{ seed: -1643030212, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] EqualityOperator
helpers/function/memoize.ts:48:34
 
     const result = func(...args);
 
-    if (maxSize !== undefined && cache.size >= maxSize) {
+    if (maxSize !== undefined && cache.size < maxSize) {
       const first = cache.keys().next();
       // first.done only when the cache is empty, which happens iff maxSize === 0.

[Survived] LogicalOperator
helpers/function/memoize.ts:48:9
 
     const result = func(...args);
 
-    if (maxSize !== undefined && cache.size >= maxSize) {
+    if (maxSize !== undefined || cache.size >= maxSize) {
       const first = cache.keys().next();
       // first.done only when the cache is empty, which happens iff maxSize === 0.

[Survived] BooleanLiteral
helpers/function/memoize.ts:53:11
       // first.done only when the cache is empty, which happens iff maxSize === 0.
       // Nothing was evicted, so skip the insert too — otherwise we'd hold 1 entry
       // despite a stated limit of 0.
-      if (!first.done) cache.delete(first.value);
+      if (first.done) cache.delete(first.value);
       else return result;
     }

[Survived] ConditionalExpression
helpers/function/memoize.ts:53:11
       // first.done only when the cache is empty, which happens iff maxSize === 0.
       // Nothing was evicted, so skip the insert too — otherwise we'd hold 1 entry
       // despite a stated limit of 0.
-      if (!first.done) cache.delete(first.value);
+      if (true) cache.delete(first.value);
       else return result;
     }

[Survived] CallExpression
helpers/function/memoize.ts:57:5
       else return result;
     }
 
-    cache.set(key, result);
+    ;
     return result;
   };
