[Survived] BlockStatement
helpers/function/unary.ts:28:45
  */
 export function unary<F extends (...args: never[]) => unknown>(
   fn: F,
-): (arg: Parameters<F>[0]) => ReturnType<F> {
-  return (arg: Parameters<F>[0]): ReturnType<F> =>
-    (fn as (arg: Parameters<F>[0]) => ReturnType<F>)(arg);
-}
+): (arg: Parameters<F>[0]) => ReturnType<F> {}
 

[Survived] ArrowFunction
helpers/function/unary.ts:29:10
 export function unary<F extends (...args: never[]) => unknown>(
   fn: F,
 ): (arg: Parameters<F>[0]) => ReturnType<F> {
-  return (arg: Parameters<F>[0]): ReturnType<F> =>
-    (fn as (arg: Parameters<F>[0]) => ReturnType<F>)(arg);
+  return () => undefined;
 }
 
