[Survived] EqualityOperator
helpers/guard/isAsyncFunction.ts:22:10
  * @since 2.0.0
  */
 export function isAsyncFunction(value: unknown): value is (...args: unknown[]) => Promise<unknown> {
-  return typeof value === 'function' && value.constructor.name === 'AsyncFunction';
+  return typeof value !== 'function' && value.constructor.name === 'AsyncFunction';
 }
 

[Survived] EqualityOperator
helpers/guard/isAsyncFunction.ts:22:41
  * @since 2.0.0
  */
 export function isAsyncFunction(value: unknown): value is (...args: unknown[]) => Promise<unknown> {
-  return typeof value === 'function' && value.constructor.name === 'AsyncFunction';
+  return typeof value === 'function' && value.constructor.name !== 'AsyncFunction';
 }
 
