[Survived] ConditionalExpression
helpers/guard/isBigInt.ts:18:10
  * @since 2.0.0
  */
 export function isBigInt(value: unknown): value is bigint {
-  return typeof value === 'bigint';
+  return false;
 }
 
