[Killed] Regex
helpers/guard/isCssColor.ts:10:26
 import { HEX_COLOR_DIGITS } from '../_shared/_hexColorGrammar.js';
 
 const HEX_COLOR = /* @__PURE__ */ new RegExp(`^#(?:${HEX_COLOR_DIGITS})$`, 'i');
-const FUNCTIONAL_COLOR = /^(?:rgb|rgba|hsl|hsla)\(\s*[\d.%,\s/-]+\s*\)$/i;
+const FUNCTIONAL_COLOR = /^(?:rgb|rgba|hsl|hsla)\(\s*[\d.%,\s/-]+\s\)$/i;
 const NAMED_COLOR = /^[a-z]+$/i;
 
killedBy: object/equalsDeep returns false for incompatible types at root
statusReason: expected false to be true // Object.is equality

[Killed] Regex
helpers/guard/isCssColor.ts:10:26
 import { HEX_COLOR_DIGITS } from '../_shared/_hexColorGrammar.js';
 
 const HEX_COLOR = /* @__PURE__ */ new RegExp(`^#(?:${HEX_COLOR_DIGITS})$`, 'i');
-const FUNCTIONAL_COLOR = /^(?:rgb|rgba|hsl|hsla)\(\s*[\d.%,\s/-]+\s*\)$/i;
+const FUNCTIONAL_COLOR = /^(?:rgb|rgba|hsl|hsla)\(\s*[^\d.%,\s/-]+\s*\)$/i;
 const NAMED_COLOR = /^[a-z]+$/i;
 
killedBy: object/equalsDeep returns false for incompatible types at root
statusReason: expected false to be true // Object.is equality

[Killed] Regex
helpers/guard/isCssColor.ts:11:21
 
 const HEX_COLOR = /* @__PURE__ */ new RegExp(`^#(?:${HEX_COLOR_DIGITS})$`, 'i');
 const FUNCTIONAL_COLOR = /^(?:rgb|rgba|hsl|hsla)\(\s*[\d.%,\s/-]+\s*\)$/i;
-const NAMED_COLOR = /^[a-z]+$/i;
+const NAMED_COLOR = /^[^a-z]+$/i;
 
 /**
killedBy: parallel should work with limit of 1 (sequential)
statusReason: expected true to be false // Object.is equality

[Survived] BlockStatement
helpers/guard/isCssColor.ts:35:61
  * isCssColor(42)                    // => false (not a string)
  * @since 3.0.0
  */
-export function isCssColor(value: unknown): value is string {
-  if (typeof value !== 'string') return false;
-  const color = value.trim();
-  if (color.length === 0) return false;
-  return HEX_COLOR.test(color) || FUNCTIONAL_COLOR.test(color) || NAMED_COLOR.test(color);
-}
+export function isCssColor(value: unknown): value is string {}
 

[Survived] ConditionalExpression
helpers/guard/isCssColor.ts:36:7
  * @since 3.0.0
  */
 export function isCssColor(value: unknown): value is string {
-  if (typeof value !== 'string') return false;
+  if (false) return false;
   const color = value.trim();
   if (color.length === 0) return false;

[Survived] BooleanLiteral
helpers/guard/isCssColor.ts:36:41
  * @since 3.0.0
  */
 export function isCssColor(value: unknown): value is string {
-  if (typeof value !== 'string') return false;
+  if (typeof value !== 'string') return true;
   const color = value.trim();
   if (color.length === 0) return false;

[Survived] MethodExpression
helpers/guard/isCssColor.ts:37:17
  */
 export function isCssColor(value: unknown): value is string {
   if (typeof value !== 'string') return false;
-  const color = value.trim();
+  const color = value;
   if (color.length === 0) return false;
   return HEX_COLOR.test(color) || FUNCTIONAL_COLOR.test(color) || NAMED_COLOR.test(color);

[Survived] BooleanLiteral
helpers/guard/isCssColor.ts:38:34
 export function isCssColor(value: unknown): value is string {
   if (typeof value !== 'string') return false;
   const color = value.trim();
-  if (color.length === 0) return false;
+  if (color.length === 0) return true;
   return HEX_COLOR.test(color) || FUNCTIONAL_COLOR.test(color) || NAMED_COLOR.test(color);
 }

[Survived] ConditionalExpression
helpers/guard/isCssColor.ts:38:7
 export function isCssColor(value: unknown): value is string {
   if (typeof value !== 'string') return false;
   const color = value.trim();
-  if (color.length === 0) return false;
+  if (true) return false;
   return HEX_COLOR.test(color) || FUNCTIONAL_COLOR.test(color) || NAMED_COLOR.test(color);
 }

[Survived] LogicalOperator
helpers/guard/isCssColor.ts:39:10
   if (typeof value !== 'string') return false;
   const color = value.trim();
   if (color.length === 0) return false;
-  return HEX_COLOR.test(color) || FUNCTIONAL_COLOR.test(color) || NAMED_COLOR.test(color);
+  return (HEX_COLOR.test(color) || FUNCTIONAL_COLOR.test(color)) && NAMED_COLOR.test(color);
 }
 

[Survived] ConditionalExpression
helpers/guard/isCssColor.ts:39:10
   if (typeof value !== 'string') return false;
   const color = value.trim();
   if (color.length === 0) return false;
-  return HEX_COLOR.test(color) || FUNCTIONAL_COLOR.test(color) || NAMED_COLOR.test(color);
+  return true;
 }
 
