[Survived] BlockStatement
helpers/guard/isGeneratorFunction.ts:23:81
  * @see {@link isGenerator}
  * @since 2.0.3
  */
-export function isGeneratorFunction(value: unknown): value is GeneratorFunction {
-  return Object.prototype.toString.call(value) === '[object GeneratorFunction]';
-}
+export function isGeneratorFunction(value: unknown): value is GeneratorFunction {}
 

[Survived] EqualityOperator
helpers/guard/isGeneratorFunction.ts:24:10
  * @since 2.0.3
  */
 export function isGeneratorFunction(value: unknown): value is GeneratorFunction {
-  return Object.prototype.toString.call(value) === '[object GeneratorFunction]';
+  return Object.prototype.toString.call(value) !== '[object GeneratorFunction]';
 }
 

[Survived] ConditionalExpression
helpers/guard/isGeneratorFunction.ts:24:10
  * @since 2.0.3
  */
 export function isGeneratorFunction(value: unknown): value is GeneratorFunction {
-  return Object.prototype.toString.call(value) === '[object GeneratorFunction]';
+  return true;
 }
 
