[Survived] BlockStatement
helpers/guard/isJSONObject.ts:21:80
  * isJSONObject([])                  // => false
  * @since 3.0.3
  */
-export function isJSONObject(value: unknown): value is Record<string, unknown> {
-  return isPlainObject(value) && Object.values(value).every(isJSONValue);
-}
+export function isJSONObject(value: unknown): value is Record<string, unknown> {}
 

[Survived] ConditionalExpression
helpers/guard/isJSONObject.ts:22:10
  * @since 3.0.3
  */
 export function isJSONObject(value: unknown): value is Record<string, unknown> {
-  return isPlainObject(value) && Object.values(value).every(isJSONValue);
+  return true;
 }
 

[Survived] ConditionalExpression
helpers/guard/isJSONObject.ts:22:10
  * @since 3.0.3
  */
 export function isJSONObject(value: unknown): value is Record<string, unknown> {
-  return isPlainObject(value) && Object.values(value).every(isJSONValue);
+  return false;
 }
 
