[Survived] BlockStatement
helpers/guard/isNode.ts:20:35
  * isNode() // => true in Node.js, false in a real browser
  * @since 3.0.3
  */
-export function isNode(): boolean {
-  return typeof process !== 'undefined' && typeof process.versions?.node === 'string';
-}
+export function isNode(): boolean {}
 

[Survived] ConditionalExpression
helpers/guard/isNode.ts:21:10
  * @since 3.0.3
  */
 export function isNode(): boolean {
-  return typeof process !== 'undefined' && typeof process.versions?.node === 'string';
+  return false;
 }
 

[Survived] ConditionalExpression
helpers/guard/isNode.ts:21:10
  * @since 3.0.3
  */
 export function isNode(): boolean {
-  return typeof process !== 'undefined' && typeof process.versions?.node === 'string';
+  return true;
 }
 
