[Survived] EqualityOperator
helpers/guard/isPlainObject.ts:24:7
  * @since 2.0.0
  */
 export function isPlainObject(value: unknown): value is Record<string, unknown> {
-  if (value === null || typeof value !== 'object') return false;
+  if (value !== null || typeof value !== 'object') return false;
   const proto = Object.getPrototypeOf(value);
   return proto === Object.prototype || proto === null;

[Survived] LogicalOperator
helpers/guard/isPlainObject.ts:24:7
  * @since 2.0.0
  */
 export function isPlainObject(value: unknown): value is Record<string, unknown> {
-  if (value === null || typeof value !== 'object') return false;
+  if (value === null && typeof value !== 'object') return false;
   const proto = Object.getPrototypeOf(value);
   return proto === Object.prototype || proto === null;

[Survived] ConditionalExpression
helpers/guard/isPlainObject.ts:26:10
 export function isPlainObject(value: unknown): value is Record<string, unknown> {
   if (value === null || typeof value !== 'object') return false;
   const proto = Object.getPrototypeOf(value);
-  return proto === Object.prototype || proto === null;
+  return true;
 }
 

[Survived] EqualityOperator
helpers/guard/isPlainObject.ts:26:40
 export function isPlainObject(value: unknown): value is Record<string, unknown> {
   if (value === null || typeof value !== 'object') return false;
   const proto = Object.getPrototypeOf(value);
-  return proto === Object.prototype || proto === null;
+  return proto === Object.prototype || proto !== null;
 }
 
