[Survived] BlockStatement
helpers/guard/isPropertyKey.ts:21:69
  * isPropertyKey(true)          // => false
  * @since 2.0.3
  */
-export function isPropertyKey(value: unknown): value is PropertyKey {
-  const t = typeof value;
-  return t === 'string' || t === 'number' || t === 'symbol';
-}
+export function isPropertyKey(value: unknown): value is PropertyKey {}
 

[Survived] EqualityOperator
helpers/guard/isPropertyKey.ts:23:28
  */
 export function isPropertyKey(value: unknown): value is PropertyKey {
   const t = typeof value;
-  return t === 'string' || t === 'number' || t === 'symbol';
+  return t === 'string' || t !== 'number' || t === 'symbol';
 }
 

[Survived] EqualityOperator
helpers/guard/isPropertyKey.ts:23:10
  */
 export function isPropertyKey(value: unknown): value is PropertyKey {
   const t = typeof value;
-  return t === 'string' || t === 'number' || t === 'symbol';
+  return t !== 'string' || t === 'number' || t === 'symbol';
 }
 
