[Survived] ConditionalExpression
helpers/guard/isString.ts:17:10
  * @since 1.9.0
  */
 export function isString(value: unknown): value is string {
-  return typeof value === 'string';
+  return true;
 }
 
