[Survived] ConditionalExpression
helpers/guard/isTimestamp.ts:43:7
  * @since 2.0.0
  */
 export function isTimestamp(value: unknown): value is number {
-  if (typeof value !== 'number' || !Number.isFinite(value)) return false;
+  if (true) return false;
 
   const abs = Math.abs(value);

[Survived] EqualityOperator
helpers/guard/isTimestamp.ts:43:7
  * @since 2.0.0
  */
 export function isTimestamp(value: unknown): value is number {
-  if (typeof value !== 'number' || !Number.isFinite(value)) return false;
+  if (typeof value === 'number' || !Number.isFinite(value)) return false;
 
   const abs = Math.abs(value);

[Survived] EqualityOperator
helpers/guard/isTimestamp.ts:48:7
   const abs = Math.abs(value);
 
   // If it looks like seconds (small enough), convert to ms for validation
-  if (abs <= MAX_UNIX_SECONDS) {
+  if (abs < MAX_UNIX_SECONDS) {
     return abs * 1000 <= MAX_TIMESTAMP_MS;
   }

[Survived] ConditionalExpression
helpers/guard/isTimestamp.ts:49:12
 
   // If it looks like seconds (small enough), convert to ms for validation
   if (abs <= MAX_UNIX_SECONDS) {
-    return abs * 1000 <= MAX_TIMESTAMP_MS;
+    return true;
   }
 

[Survived] ConditionalExpression
helpers/guard/isTimestamp.ts:53:10
   }
 
   // Otherwise treat as milliseconds
-  return abs <= MAX_TIMESTAMP_MS;
+  return false;
 }
 
