[Survived] BlockStatement
helpers/guard/isWeakMap.ts:16:78
  * isWeakMap(new Map())      // => false
  * @since 3.0.0
  */
-export function isWeakMap(value: unknown): value is WeakMap<object, unknown> {
-  return value instanceof WeakMap;
-}
+export function isWeakMap(value: unknown): value is WeakMap<object, unknown> {}
 
