[Killed] StringLiteral
helpers/license/_unknownFamily.ts:17:31
  * encapsulate this concept; a consumer never needs the sentinel's actual value.
  * @ignore
  */
-export const UNKNOWN_FAMILY = 'unknown';
+export const UNKNOWN_FAMILY = "";
 
killedBy: object/equalsDeep returns true for identical flat objects
statusReason: expected Set{ '', 'mit' } to deeply equal Set{ 'unknown', 'mit' }
