[Survived] BlockStatement
helpers/map/countBy.ts:20:19
 export function countBy<K, V, R>(
   map: ReadonlyMap<K, V>,
   fn: (value: V, key: K) => R,
-): Map<R, number> {
-  const counts = new Map<R, number>();
-  for (const [key, value] of map) {
-    const group = fn(value, key);
-    counts.set(group, (counts.get(group) ?? 0) + 1);
-  }
-  return counts;
-}
+): Map<R, number> {}
 

[Survived] BlockStatement
helpers/map/countBy.ts:22:35
   fn: (value: V, key: K) => R,
 ): Map<R, number> {
   const counts = new Map<R, number>();
-  for (const [key, value] of map) {
-    const group = fn(value, key);
-    counts.set(group, (counts.get(group) ?? 0) + 1);
-  }
+  for (const [key, value] of map) {}
   return counts;
 }

[Survived] LogicalOperator
helpers/map/countBy.ts:24:24
   const counts = new Map<R, number>();
   for (const [key, value] of map) {
     const group = fn(value, key);
-    counts.set(group, (counts.get(group) ?? 0) + 1);
+    counts.set(group, (counts.get(group) && 0) + 1);
   }
   return counts;

[Survived] ArithmeticOperator
helpers/map/countBy.ts:24:23
   const counts = new Map<R, number>();
   for (const [key, value] of map) {
     const group = fn(value, key);
-    counts.set(group, (counts.get(group) ?? 0) + 1);
+    counts.set(group, (counts.get(group) ?? 0) - 1);
   }
   return counts;
