[Survived] BlockStatement
helpers/map/findValue.ts:20:18
 export function findValue<K, V>(
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
-): V | undefined {
-  for (const [key, value] of map) {
-    if (predicate(value, key)) return value;
-  }
-  return undefined;
-}
+): V | undefined {}
 

[Survived] BlockStatement
helpers/map/findValue.ts:21:35
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
 ): V | undefined {
-  for (const [key, value] of map) {
-    if (predicate(value, key)) return value;
-  }
+  for (const [key, value] of map) {}
   return undefined;
 }

[Survived] ConditionalExpression
helpers/map/findValue.ts:22:9
   predicate: (value: V, key: K) => boolean,
 ): V | undefined {
   for (const [key, value] of map) {
-    if (predicate(value, key)) return value;
+    if (true) return value;
   }
   return undefined;

[Survived] ConditionalExpression
helpers/map/findValue.ts:22:9
   predicate: (value: V, key: K) => boolean,
 ): V | undefined {
   for (const [key, value] of map) {
-    if (predicate(value, key)) return value;
+    if (false) return value;
   }
   return undefined;
