[Survived] BlockStatement
helpers/map/reduce.ts:22:6
   map: ReadonlyMap<K, V>,
   fn: (accumulator: R, value: V, key: K) => R,
   initial: R,
-): R {
-  let accumulator = initial;
-  for (const [key, value] of map) {
-    accumulator = fn(accumulator, value, key);
-  }
-  return accumulator;
-}
+): R {}
 

[Survived] BlockStatement
helpers/map/reduce.ts:24:35
   initial: R,
 ): R {
   let accumulator = initial;
-  for (const [key, value] of map) {
-    accumulator = fn(accumulator, value, key);
-  }
+  for (const [key, value] of map) {}
   return accumulator;
 }
