[Survived] StringLiteral
helpers/node/_stripJsonComments.ts:22:16
  * @ignore
  */
 export function stripJsonComments(input: string): string {
-  let output = '';
+  let output = "Stryker was here!";
   let inString = false;
   // A comma seen outside a string is held back instead of emitted immediately:

[Survived] BooleanLiteral
helpers/node/_stripJsonComments.ts:23:18
  */
 export function stripJsonComments(input: string): string {
   let output = '';
-  let inString = false;
+  let inString = true;
   // A comma seen outside a string is held back instead of emitted immediately:
   // if the next significant token turns out to be `}`/`]`, it was a trailing

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:29:35
   // comma and gets dropped; otherwise it (and any whitespace/comments held
   // alongside it) is flushed once a real token confirms it wasn't trailing.
   let pendingComma = '';
-  const flushPendingComma = () => {
-    if (pendingComma) {
-      output += pendingComma;
-      pendingComma = '';
-    }
-  };
+  const flushPendingComma = () => {};
 
   let i = 0;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:30:9
   // alongside it) is flushed once a real token confirms it wasn't trailing.
   let pendingComma = '';
   const flushPendingComma = () => {
-    if (pendingComma) {
+    if (false) {
       output += pendingComma;
       pendingComma = '';

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:30:23
   // alongside it) is flushed once a real token confirms it wasn't trailing.
   let pendingComma = '';
   const flushPendingComma = () => {
-    if (pendingComma) {
-      output += pendingComma;
-      pendingComma = '';
-    }
+    if (pendingComma) {}
   };
 

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:31:7
   let pendingComma = '';
   const flushPendingComma = () => {
     if (pendingComma) {
-      output += pendingComma;
+      output -= pendingComma;
       pendingComma = '';
     }

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:37:10
   };
 
   let i = 0;
-  while (i < input.length) {
+  while (false) {
     const char = input[i];
 

[Survived] EqualityOperator
helpers/node/_stripJsonComments.ts:37:10
   };
 
   let i = 0;
-  while (i < input.length) {
+  while (i <= input.length) {
     const char = input[i];
 

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:40:19
   while (i < input.length) {
     const char = input[i];
 
-    if (inString) {
-      output += char;
-      if (char === '\\') {
-        // Copy the escaped character as-is (whatever it is) so an escaped
-        // quote (`\"`) doesn't get mistaken for the string's end.
-        i++;
-        if (i < input.length) output += input[i];
-      } else if (char === '"') {
-        inString = false;
-      }
-      i++;
-      continue;
-    }
+    if (inString) {}
 
     if (char === '"') {

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:40:9
   while (i < input.length) {
     const char = input[i];
 
-    if (inString) {
+    if (true) {
       output += char;
       if (char === '\\') {

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:41:7
     const char = input[i];
 
     if (inString) {
-      output += char;
+      output -= char;
       if (char === '\\') {
         // Copy the escaped character as-is (whatever it is) so an escaped

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:42:11
 
     if (inString) {
       output += char;
-      if (char === '\\') {
+      if (true) {
         // Copy the escaped character as-is (whatever it is) so an escaped
         // quote (`\"`) doesn't get mistaken for the string's end.

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:42:26
 
     if (inString) {
       output += char;
-      if (char === '\\') {
-        // Copy the escaped character as-is (whatever it is) so an escaped
-        // quote (`\"`) doesn't get mistaken for the string's end.
-        i++;
-        if (i < input.length) output += input[i];
-      } else if (char === '"') {
+      if (char === '\\') {} else if (char === '"') {
         inString = false;
       }

[Survived] UpdateOperator
helpers/node/_stripJsonComments.ts:45:9
       if (char === '\\') {
         // Copy the escaped character as-is (whatever it is) so an escaped
         // quote (`\"`) doesn't get mistaken for the string's end.
-        i++;
+        i--;
         if (i < input.length) output += input[i];
       } else if (char === '"') {

[Survived] EqualityOperator
helpers/node/_stripJsonComments.ts:46:13
         // Copy the escaped character as-is (whatever it is) so an escaped
         // quote (`\"`) doesn't get mistaken for the string's end.
         i++;
-        if (i < input.length) output += input[i];
+        if (i >= input.length) output += input[i];
       } else if (char === '"') {
         inString = false;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:46:13
         // Copy the escaped character as-is (whatever it is) so an escaped
         // quote (`\"`) doesn't get mistaken for the string's end.
         i++;
-        if (i < input.length) output += input[i];
+        if (false) output += input[i];
       } else if (char === '"') {
         inString = false;

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:47:32
         // quote (`\"`) doesn't get mistaken for the string's end.
         i++;
         if (i < input.length) output += input[i];
-      } else if (char === '"') {
-        inString = false;
-      }
+      } else if (char === '"') {}
       i++;
       continue;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:47:18
         // quote (`\"`) doesn't get mistaken for the string's end.
         i++;
         if (i < input.length) output += input[i];
-      } else if (char === '"') {
+      } else if (false) {
         inString = false;
       }

[Survived] BooleanLiteral
helpers/node/_stripJsonComments.ts:48:20
         i++;
         if (i < input.length) output += input[i];
       } else if (char === '"') {
-        inString = false;
+        inString = true;
       }
       i++;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:54:9
       continue;
     }
 
-    if (char === '"') {
+    if (false) {
       flushPendingComma();
       inString = true;

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:54:23
       continue;
     }
 
-    if (char === '"') {
-      flushPendingComma();
-      inString = true;
-      output += char;
-      i++;
-      continue;
-    }
+    if (char === '"') {}
 
     if (char === '/' && input[i + 1] === '/') {

[Survived] CallExpression
helpers/node/_stripJsonComments.ts:55:7
     }
 
     if (char === '"') {
-      flushPendingComma();
+      ;
       inString = true;
       output += char;

[Survived] BooleanLiteral
helpers/node/_stripJsonComments.ts:56:18
 
     if (char === '"') {
       flushPendingComma();
-      inString = true;
+      inString = false;
       output += char;
       i++;

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:57:7
     if (char === '"') {
       flushPendingComma();
       inString = true;
-      output += char;
+      output -= char;
       i++;
       continue;

[Survived] UpdateOperator
helpers/node/_stripJsonComments.ts:58:7
       flushPendingComma();
       inString = true;
       output += char;
-      i++;
+      i--;
       continue;
     }

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:62:9
       continue;
     }
 
-    if (char === '/' && input[i + 1] === '/') {
+    if (true) {
       i += 2;
       // Stop at any line-ending character, not just \n — a bare \r (classic

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:62:9
       continue;
     }
 
-    if (char === '/' && input[i + 1] === '/') {
+    if (true && input[i + 1] === '/') {
       i += 2;
       // Stop at any line-ending character, not just \n — a bare \r (classic

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:63:7
     }
 
     if (char === '/' && input[i + 1] === '/') {
-      i += 2;
+      i -= 2;
       // Stop at any line-ending character, not just \n — a bare \r (classic
       // Mac line endings, or a lone \r before a later \n) also ends the line,

[Survived] LogicalOperator
helpers/node/_stripJsonComments.ts:67:14
       // Stop at any line-ending character, not just \n — a bare \r (classic
       // Mac line endings, or a lone \r before a later \n) also ends the line,
       // otherwise everything up to the next \n (or EOF) gets silently eaten.
-      while (i < input.length && input[i] !== '\n' && input[i] !== '\r') i++;
+      while (i < input.length || input[i] !== '\n' && input[i] !== '\r') i++;
       continue;
     }

[Survived] LogicalOperator
helpers/node/_stripJsonComments.ts:67:14
       // Stop at any line-ending character, not just \n — a bare \r (classic
       // Mac line endings, or a lone \r before a later \n) also ends the line,
       // otherwise everything up to the next \n (or EOF) gets silently eaten.
-      while (i < input.length && input[i] !== '\n' && input[i] !== '\r') i++;
+      while (i < input.length && input[i] !== '\n' || input[i] !== '\r') i++;
       continue;
     }

[Survived] EqualityOperator
helpers/node/_stripJsonComments.ts:71:9
       continue;
     }
 
-    if (char === '/' && input[i + 1] === '*') {
+    if (char !== '/' && input[i + 1] === '*') {
       i += 2;
       while (i < input.length && !(input[i] === '*' && input[i + 1] === '/')) i++;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:71:25
       continue;
     }
 
-    if (char === '/' && input[i + 1] === '*') {
+    if (char === '/' && true) {
       i += 2;
       while (i < input.length && !(input[i] === '*' && input[i + 1] === '/')) i++;

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:72:7
     }
 
     if (char === '/' && input[i + 1] === '*') {
-      i += 2;
+      i -= 2;
       while (i < input.length && !(input[i] === '*' && input[i + 1] === '/')) i++;
       i += 2;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:73:14
 
     if (char === '/' && input[i + 1] === '*') {
       i += 2;
-      while (i < input.length && !(input[i] === '*' && input[i + 1] === '/')) i++;
+      while (false) i++;
       i += 2;
       continue;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:73:36
 
     if (char === '/' && input[i + 1] === '*') {
       i += 2;
-      while (i < input.length && !(input[i] === '*' && input[i + 1] === '/')) i++;
+      while (i < input.length && !(false)) i++;
       i += 2;
       continue;

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:74:7
     if (char === '/' && input[i + 1] === '*') {
       i += 2;
       while (i < input.length && !(input[i] === '*' && input[i + 1] === '/')) i++;
-      i += 2;
+      i -= 2;
       continue;
     }

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:78:9
       continue;
     }
 
-    if (char === ',') {
+    if (false) {
       flushPendingComma();
       pendingComma = char;

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:78:23
       continue;
     }
 
-    if (char === ',') {
-      flushPendingComma();
-      pendingComma = char;
-      i++;
-      continue;
-    }
+    if (char === ',') {}
 
     if (char === '}' || char === ']') {

[Survived] CallExpression
helpers/node/_stripJsonComments.ts:79:7
     }
 
     if (char === ',') {
-      flushPendingComma();
+      ;
       pendingComma = char;
       i++;

[Survived] UpdateOperator
helpers/node/_stripJsonComments.ts:81:7
     if (char === ',') {
       flushPendingComma();
       pendingComma = char;
-      i++;
+      i--;
       continue;
     }

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:85:9
       continue;
     }
 
-    if (char === '}' || char === ']') {
+    if (false) {
       pendingComma = ''; // drop — it was trailing
       output += char;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:85:9
       continue;
     }
 
-    if (char === '}' || char === ']') {
+    if (false || char === ']') {
       pendingComma = ''; // drop — it was trailing
       output += char;

[Survived] StringLiteral
helpers/node/_stripJsonComments.ts:86:22
     }
 
     if (char === '}' || char === ']') {
-      pendingComma = ''; // drop — it was trailing
+      pendingComma = "Stryker was here!"; // drop — it was trailing
       output += char;
       i++;

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:87:7
 
     if (char === '}' || char === ']') {
       pendingComma = ''; // drop — it was trailing
-      output += char;
+      output -= char;
       i++;
       continue;

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:92:9
       continue;
     }
 
-    if (char === ' ' || char === '\t' || char === '\n' || char === '\r') {
+    if (false) {
       // Whitespace doesn't resolve a pending comma either way — buffer it
       // alongside so it's dropped too if the comma turns out to be trailing.

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:92:9
       continue;
     }
 
-    if (char === ' ' || char === '\t' || char === '\n' || char === '\r') {
+    if (false || char === '\r') {
       // Whitespace doesn't resolve a pending comma either way — buffer it
       // alongside so it's dropped too if the comma turns out to be trailing.

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:95:25
     if (char === ' ' || char === '\t' || char === '\n' || char === '\r') {
       // Whitespace doesn't resolve a pending comma either way — buffer it
       // alongside so it's dropped too if the comma turns out to be trailing.
-      if (pendingComma) {
-        pendingComma += char;
-      } else {
+      if (pendingComma) {} else {
         output += char;
       }

[Survived] ConditionalExpression
helpers/node/_stripJsonComments.ts:95:11
     if (char === ' ' || char === '\t' || char === '\n' || char === '\r') {
       // Whitespace doesn't resolve a pending comma either way — buffer it
       // alongside so it's dropped too if the comma turns out to be trailing.
-      if (pendingComma) {
+      if (true) {
         pendingComma += char;
       } else {

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:96:9
       // Whitespace doesn't resolve a pending comma either way — buffer it
       // alongside so it's dropped too if the comma turns out to be trailing.
       if (pendingComma) {
-        pendingComma += char;
+        pendingComma -= char;
       } else {
         output += char;

[Survived] BlockStatement
helpers/node/_stripJsonComments.ts:97:14
       // alongside so it's dropped too if the comma turns out to be trailing.
       if (pendingComma) {
         pendingComma += char;
-      } else {
-        output += char;
-      }
+      } else {}
       i++;
       continue;

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:98:9
       if (pendingComma) {
         pendingComma += char;
       } else {
-        output += char;
+        output -= char;
       }
       i++;

[Survived] CallExpression
helpers/node/_stripJsonComments.ts:104:5
       continue;
     }
 
-    flushPendingComma();
+    ;
     output += char;
     i++;

[Survived] AssignmentOperator
helpers/node/_stripJsonComments.ts:105:5
     }
 
     flushPendingComma();
-    output += char;
+    output -= char;
     i++;
   }
