[Survived] BlockStatement
helpers/node/safeReadJsonFile.ts:36:79
  */
 export function safeReadJsonFile<T>(filePath: string): T | null;
 export function safeReadJsonFile<T>(filePath: string, fallback: T): T;
-export function safeReadJsonFile<T>(filePath: string, fallback?: T): T | null {
-  try {
-    const content = readFileSync(filePath, 'utf-8');
-    try {
-      return JSON.parse(content) as T;
-    } catch {
-      // Not strict JSON — retry tolerating JSONC comments/trailing commas
-      // before giving up.
-      return JSON.parse(stripJsonComments(content)) as T;
-    }
-  } catch {
-    // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
-    // (→ undefined as T) to keep runtime behaviour aligned with the overloads.
-    return arguments.length < 2 ? null : (fallback as T);
-  }
-}
+export function safeReadJsonFile<T>(filePath: string, fallback?: T): T | null {}
 

[Survived] BlockStatement
helpers/node/safeReadJsonFile.ts:37:7
 export function safeReadJsonFile<T>(filePath: string): T | null;
 export function safeReadJsonFile<T>(filePath: string, fallback: T): T;
 export function safeReadJsonFile<T>(filePath: string, fallback?: T): T | null {
-  try {
-    const content = readFileSync(filePath, 'utf-8');
-    try {
-      return JSON.parse(content) as T;
-    } catch {
-      // Not strict JSON — retry tolerating JSONC comments/trailing commas
-      // before giving up.
-      return JSON.parse(stripJsonComments(content)) as T;
-    }
-  } catch {
+  try {} catch {
     // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
     // (→ undefined as T) to keep runtime behaviour aligned with the overloads.

[Survived] BlockStatement
helpers/node/safeReadJsonFile.ts:39:9
 export function safeReadJsonFile<T>(filePath: string, fallback?: T): T | null {
   try {
     const content = readFileSync(filePath, 'utf-8');
-    try {
-      return JSON.parse(content) as T;
-    } catch {
+    try {} catch {
       // Not strict JSON — retry tolerating JSONC comments/trailing commas
       // before giving up.

[Survived] BlockStatement
helpers/node/safeReadJsonFile.ts:41:13
     const content = readFileSync(filePath, 'utf-8');
     try {
       return JSON.parse(content) as T;
-    } catch {
-      // Not strict JSON — retry tolerating JSONC comments/trailing commas
-      // before giving up.
-      return JSON.parse(stripJsonComments(content)) as T;
-    }
+    } catch {}
   } catch {
     // Distinguish "no fallback provided" (→ null) from "fallback is undefined"

[Survived] BlockStatement
helpers/node/safeReadJsonFile.ts:46:11
       // before giving up.
       return JSON.parse(stripJsonComments(content)) as T;
     }
-  } catch {
-    // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
-    // (→ undefined as T) to keep runtime behaviour aligned with the overloads.
-    return arguments.length < 2 ? null : (fallback as T);
-  }
+  } catch {}
 }
 

[Survived] ConditionalExpression
helpers/node/safeReadJsonFile.ts:49:12
   } catch {
     // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
     // (→ undefined as T) to keep runtime behaviour aligned with the overloads.
-    return arguments.length < 2 ? null : (fallback as T);
+    return false ? null : (fallback as T);
   }
 }
