[Killed] Regex
helpers/number/extractNumber.ts:35:22
 // (?<![\p{L}\p{N}_]) prevents matching a leading-dot decimal immediately after a word
 // character (e.g. the '.5' in 'text.5' is a property separator, not a decimal point).
 // No `g` flag — cloned per call via `new RegExp(…, 'gu')` so each invocation has its own lastIndex.
-const NUMBER_TOKEN = /(-)?(\d+(?:\.\d+)?|(?<![\p{L}\p{N}_])\.\d+)([eE][+-]?\d+)?/u;
+const NUMBER_TOKEN = /(-)?(\d+(?:\.\d+)?|(?<![\p{L}\p{N}_])\.\d+)([eE][+-]?\D+)?/u;
 const WORD_CHAR = /[\p{L}\p{N}_]/u;
 
killedBy: compare — contract different days → false for precision=days
statusReason: expected NaN to be 0.05 // Object.is equality

[Killed] Regex
helpers/number/extractNumber.ts:35:22
 // (?<![\p{L}\p{N}_]) prevents matching a leading-dot decimal immediately after a word
 // character (e.g. the '.5' in 'text.5' is a property separator, not a decimal point).
 // No `g` flag — cloned per call via `new RegExp(…, 'gu')` so each invocation has its own lastIndex.
-const NUMBER_TOKEN = /(-)?(\d+(?:\.\d+)?|(?<![\p{L}\p{N}_])\.\d+)([eE][+-]?\d+)?/u;
+const NUMBER_TOKEN = /(-)?(\d+(?:\.\d+)?|(?<![\p{L}\p{N}_])\.\d+)([eE][+-]?\d+)/u;
 const WORD_CHAR = /[\p{L}\p{N}_]/u;
 
killedBy: compare — contract invalid date vs valid date → false
statusReason: expected undefined to be 16.5 // Object.is equality

[Survived] BlockStatement
helpers/number/extractNumber.ts:38:56
 const NUMBER_TOKEN = /(-)?(\d+(?:\.\d+)?|(?<![\p{L}\p{N}_])\.\d+)([eE][+-]?\d+)?/u;
 const WORD_CHAR = /[\p{L}\p{N}_]/u;
 
-function isWordChar(char: string | undefined): boolean {
-  return char !== undefined && WORD_CHAR.test(char);
-}
+function isWordChar(char: string | undefined): boolean {}
 
 /**

[Survived] EqualityOperator
helpers/number/extractNumber.ts:39:10
 const WORD_CHAR = /[\p{L}\p{N}_]/u;
 
 function isWordChar(char: string | undefined): boolean {
-  return char !== undefined && WORD_CHAR.test(char);
+  return char === undefined && WORD_CHAR.test(char);
 }
 

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:39:10
 const WORD_CHAR = /[\p{L}\p{N}_]/u;
 
 function isWordChar(char: string | undefined): boolean {
-  return char !== undefined && WORD_CHAR.test(char);
+  return false;
 }
 

[Survived] StringLiteral
helpers/number/extractNumber.ts:71:18
  * @since 2.0.4
  */
 export function extractNumber(value: unknown, options: ExtractNumberOptions = {}): number | undefined {
-  const { sign = 'auto', exponent = 'auto' } = options;
+  const { sign = "", exponent = 'auto' } = options;
 
   if (typeof value === 'number') {

[Survived] StringLiteral
helpers/number/extractNumber.ts:71:37
  * @since 2.0.4
  */
 export function extractNumber(value: unknown, options: ExtractNumberOptions = {}): number | undefined {
-  const { sign = 'auto', exponent = 'auto' } = options;
+  const { sign = 'auto', exponent = "" } = options;
 
   if (typeof value === 'number') {

[Survived] BlockStatement
helpers/number/extractNumber.ts:73:34
 export function extractNumber(value: unknown, options: ExtractNumberOptions = {}): number | undefined {
   const { sign = 'auto', exponent = 'auto' } = options;
 
-  if (typeof value === 'number') {
-    return Number.isNaN(value) ? undefined : value;
-  }
+  if (typeof value === 'number') {}
 
   if (typeof value !== 'string') {

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:73:7
 export function extractNumber(value: unknown, options: ExtractNumberOptions = {}): number | undefined {
   const { sign = 'auto', exponent = 'auto' } = options;
 
-  if (typeof value === 'number') {
+  if (false) {
     return Number.isNaN(value) ? undefined : value;
   }

[Survived] BlockStatement
helpers/number/extractNumber.ts:77:34
     return Number.isNaN(value) ? undefined : value;
   }
 
-  if (typeof value !== 'string') {
-    return undefined;
-  }
+  if (typeof value !== 'string') {}
 
   const re = new RegExp(NUMBER_TOKEN.source, 'gu');

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:77:7
     return Number.isNaN(value) ? undefined : value;
   }
 
-  if (typeof value !== 'string') {
+  if (false) {
     return undefined;
   }

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:84:10
   const re = new RegExp(NUMBER_TOKEN.source, 'gu');
   let match: RegExpExecArray | null;
 
-  while ((match = re.exec(value)) !== null) {
+  while (false) {
     const [full, signChar, mantissa, exponentPart] = match;
     const start = match.index;

[Survived] EqualityOperator
helpers/number/extractNumber.ts:84:10
   const re = new RegExp(NUMBER_TOKEN.source, 'gu');
   let match: RegExpExecArray | null;
 
-  while ((match = re.exec(value)) !== null) {
+  while ((match = re.exec(value)) === null) {
     const [full, signChar, mantissa, exponentPart] = match;
     const start = match.index;

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:88:9
     const [full, signChar, mantissa, exponentPart] = match;
     const start = match.index;
 
-    if (signChar) {
+    if (false) {
       const before = value[start - 1];
       const keepSign = sign === 'strict' ? true : sign === 'ignore' ? false : !isWordChar(before);

[Survived] BlockStatement
helpers/number/extractNumber.ts:88:19
     const [full, signChar, mantissa, exponentPart] = match;
     const start = match.index;
 
-    if (signChar) {
-      const before = value[start - 1];
-      const keepSign = sign === 'strict' ? true : sign === 'ignore' ? false : !isWordChar(before);
-
-      if (!keepSign) {
-        // Re-scan from right after the '-' so the digits are matched as a fresh, unsigned number.
-        re.lastIndex = start + 1;
-        continue;
-      }
-    }
+    if (signChar) {}
 
     const keepExponent = exponentPart

[Survived] ArithmeticOperator
helpers/number/extractNumber.ts:89:28
     const start = match.index;
 
     if (signChar) {
-      const before = value[start - 1];
+      const before = value[start + 1];
       const keepSign = sign === 'strict' ? true : sign === 'ignore' ? false : !isWordChar(before);
 

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:90:51
 
     if (signChar) {
       const before = value[start - 1];
-      const keepSign = sign === 'strict' ? true : sign === 'ignore' ? false : !isWordChar(before);
+      const keepSign = sign === 'strict' ? true : false ? false : !isWordChar(before);
 
       if (!keepSign) {

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:90:24
 
     if (signChar) {
       const before = value[start - 1];
-      const keepSign = sign === 'strict' ? true : sign === 'ignore' ? false : !isWordChar(before);
+      const keepSign = true ? true : sign === 'ignore' ? false : !isWordChar(before);
 
       if (!keepSign) {

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:92:11
       const before = value[start - 1];
       const keepSign = sign === 'strict' ? true : sign === 'ignore' ? false : !isWordChar(before);
 
-      if (!keepSign) {
+      if (false) {
         // Re-scan from right after the '-' so the digits are matched as a fresh, unsigned number.
         re.lastIndex = start + 1;

[Survived] BooleanLiteral
helpers/number/extractNumber.ts:92:11
       const before = value[start - 1];
       const keepSign = sign === 'strict' ? true : sign === 'ignore' ? false : !isWordChar(before);
 
-      if (!keepSign) {
+      if (keepSign) {
         // Re-scan from right after the '-' so the digits are matched as a fresh, unsigned number.
         re.lastIndex = start + 1;

[Survived] ArithmeticOperator
helpers/number/extractNumber.ts:94:24
 
       if (!keepSign) {
         // Re-scan from right after the '-' so the digits are matched as a fresh, unsigned number.
-        re.lastIndex = start + 1;
+        re.lastIndex = start - 1;
         continue;
       }

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:100:9
     }
 
     const keepExponent = exponentPart
-      ? exponent === 'strict'
+      ? true
         ? true
         : exponent === 'ignore'

[Survived] EqualityOperator
helpers/number/extractNumber.ts:100:9
     }
 
     const keepExponent = exponentPart
-      ? exponent === 'strict'
+      ? exponent !== 'strict'
         ? true
         : exponent === 'ignore'

[Survived] BooleanLiteral
helpers/number/extractNumber.ts:101:11
 
     const keepExponent = exponentPart
       ? exponent === 'strict'
-        ? true
+        ? false
         : exponent === 'ignore'
           ? false

[Survived] EqualityOperator
helpers/number/extractNumber.ts:102:11
     const keepExponent = exponentPart
       ? exponent === 'strict'
         ? true
-        : exponent === 'ignore'
+        : exponent !== 'ignore'
           ? false
           : !isWordChar(value[start + full.length])

[Survived] ConditionalExpression
helpers/number/extractNumber.ts:102:11
     const keepExponent = exponentPart
       ? exponent === 'strict'
         ? true
-        : exponent === 'ignore'
+        : true
           ? false
           : !isWordChar(value[start + full.length])

[Survived] BooleanLiteral
helpers/number/extractNumber.ts:103:13
       ? exponent === 'strict'
         ? true
         : exponent === 'ignore'
-          ? false
+          ? true
           : !isWordChar(value[start + full.length])
       : false;

[Survived] BooleanLiteral
helpers/number/extractNumber.ts:104:13
         ? true
         : exponent === 'ignore'
           ? false
-          : !isWordChar(value[start + full.length])
+          : isWordChar(value[start + full.length])
       : false;
 

[Survived] ArithmeticOperator
helpers/number/extractNumber.ts:104:31
         ? true
         : exponent === 'ignore'
           ? false
-          : !isWordChar(value[start + full.length])
+          : !isWordChar(value[start - full.length])
       : false;
 

[Survived] BooleanLiteral
helpers/number/extractNumber.ts:105:9
         : exponent === 'ignore'
           ? false
           : !isWordChar(value[start + full.length])
-      : false;
+      : true;
 
     const numericText = (signChar ?? '') + mantissa + (keepExponent ? exponentPart : '');

[Survived] LogicalOperator
helpers/number/extractNumber.ts:107:26
           : !isWordChar(value[start + full.length])
       : false;
 
-    const numericText = (signChar ?? '') + mantissa + (keepExponent ? exponentPart : '');
+    const numericText = (signChar && '') + mantissa + (keepExponent ? exponentPart : '');
     return Number(numericText);
   }

[Survived] ArithmeticOperator
helpers/number/extractNumber.ts:107:25
           : !isWordChar(value[start + full.length])
       : false;
 
-    const numericText = (signChar ?? '') + mantissa + (keepExponent ? exponentPart : '');
+    const numericText = (signChar ?? '') + mantissa - (keepExponent ? exponentPart : '');
     return Number(numericText);
   }
