[Survived] BlockStatement
helpers/number/isEven.ts:23:57
  * isEven('2')  // => false
  * @since 2.0.3
  */
-export function isEven(value: unknown): value is number {
-  return typeof value === 'number' && Number.isInteger(value) && value % 2 === 0;
-}
+export function isEven(value: unknown): value is number {}
 

[Survived] LogicalOperator
helpers/number/isEven.ts:24:10
  * @since 2.0.3
  */
 export function isEven(value: unknown): value is number {
-  return typeof value === 'number' && Number.isInteger(value) && value % 2 === 0;
+  return typeof value === 'number' || Number.isInteger(value) && value % 2 === 0;
 }
 

[Survived] EqualityOperator
helpers/number/isEven.ts:24:66
  * @since 2.0.3
  */
 export function isEven(value: unknown): value is number {
-  return typeof value === 'number' && Number.isInteger(value) && value % 2 === 0;
+  return typeof value === 'number' && Number.isInteger(value) && value % 2 !== 0;
 }
 
