[Survived] BlockStatement
helpers/object/camelCaseKeys.ts:24:47
  * // => { userName: 'Alice', homeAddress: { zipCode: '12345' } }
  * @since 3.0.3
  */
-export function camelCaseKeys<T>(value: T): T {
-  return mapDeep(value, undefined, camelCase);
-}
+export function camelCaseKeys<T>(value: T): T {}
 
