[Survived] BlockStatement
helpers/object/get.ts:51:107
   path: P,
   defaultValue?: DeepGet<T, ParsePath<P>>,
 ): DeepGet<T, ParsePath<P>> | undefined;
-export function get(obj: unknown, path: string | readonly PropertyKey[], defaultValue?: unknown): unknown {
-  if (obj == null) return defaultValue;
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
-  const result = walkPropertyPath(obj, keys);
-  return result !== undefined ? result : defaultValue;
-}
+export function get(obj: unknown, path: string | readonly PropertyKey[], defaultValue?: unknown): unknown {}
 

[Survived] ConditionalExpression
helpers/object/get.ts:52:7
   defaultValue?: DeepGet<T, ParsePath<P>>,
 ): DeepGet<T, ParsePath<P>> | undefined;
 export function get(obj: unknown, path: string | readonly PropertyKey[], defaultValue?: unknown): unknown {
-  if (obj == null) return defaultValue;
+  if (false) return defaultValue;
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
   const result = walkPropertyPath(obj, keys);

[Survived] ConditionalExpression
helpers/object/get.ts:52:7
   defaultValue?: DeepGet<T, ParsePath<P>>,
 ): DeepGet<T, ParsePath<P>> | undefined;
 export function get(obj: unknown, path: string | readonly PropertyKey[], defaultValue?: unknown): unknown {
-  if (obj == null) return defaultValue;
+  if (true) return defaultValue;
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
   const result = walkPropertyPath(obj, keys);

[Survived] ConditionalExpression
helpers/object/get.ts:53:40
 ): DeepGet<T, ParsePath<P>> | undefined;
 export function get(obj: unknown, path: string | readonly PropertyKey[], defaultValue?: unknown): unknown {
   if (obj == null) return defaultValue;
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
+  const keys: readonly PropertyKey[] = false ? parsePropertyPath(path) : path;
   const result = walkPropertyPath(obj, keys);
   return result !== undefined ? result : defaultValue;

[Survived] ConditionalExpression
helpers/object/get.ts:53:40
 ): DeepGet<T, ParsePath<P>> | undefined;
 export function get(obj: unknown, path: string | readonly PropertyKey[], defaultValue?: unknown): unknown {
   if (obj == null) return defaultValue;
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
+  const keys: readonly PropertyKey[] = true ? parsePropertyPath(path) : path;
   const result = walkPropertyPath(obj, keys);
   return result !== undefined ? result : defaultValue;

[Survived] ConditionalExpression
helpers/object/get.ts:55:10
   if (obj == null) return defaultValue;
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
   const result = walkPropertyPath(obj, keys);
-  return result !== undefined ? result : defaultValue;
+  return false ? result : defaultValue;
 }
 

[Survived] ConditionalExpression
helpers/object/get.ts:55:10
   if (obj == null) return defaultValue;
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
   const result = walkPropertyPath(obj, keys);
-  return result !== undefined ? result : defaultValue;
+  return true ? result : defaultValue;
 }
 
