[Survived] BlockStatement
helpers/object/isNonEmpty.ts:24:123
  * isNonEmpty(undefined)   // => false
  * @since 2.0.3
  */
-export function isNonEmpty(value: Record<PropertyKey, unknown> | null | undefined): value is Record<PropertyKey, unknown> {
-  return value != null && Object.keys(value).length > 0;
-}
+export function isNonEmpty(value: Record<PropertyKey, unknown> | null | undefined): value is Record<PropertyKey, unknown> {}
 

[Survived] ConditionalExpression
helpers/object/isNonEmpty.ts:25:10
  * @since 2.0.3
  */
 export function isNonEmpty(value: Record<PropertyKey, unknown> | null | undefined): value is Record<PropertyKey, unknown> {
-  return value != null && Object.keys(value).length > 0;
+  return false;
 }
 

[Survived] EqualityOperator
helpers/object/isNonEmpty.ts:25:27
  * @since 2.0.3
  */
 export function isNonEmpty(value: Record<PropertyKey, unknown> | null | undefined): value is Record<PropertyKey, unknown> {
-  return value != null && Object.keys(value).length > 0;
+  return value != null && Object.keys(value).length >= 0;
 }
 
