[Survived] BlockStatement
helpers/object/mergeDeep.ts:16:9
   result: Record<PropertyKey, unknown>,
   source: Record<PropertyKey, unknown>,
   key: PropertyKey,
-): void {
-  const resultValue = result[key];
-  const sourceValue = source[key];
-  if (isPlainObject(resultValue) && isPlainObject(sourceValue)) {
-    result[key] = mergeDeep(
-      resultValue as Record<PropertyKey, unknown>,
-      sourceValue as Record<PropertyKey, unknown>,
-    );
-  } else if (sourceValue !== undefined) {
-    result[key] = (isPlainObject(sourceValue) || Array.isArray(sourceValue))
-      ? cloneDeep(sourceValue)
-      : sourceValue;
-  }
-}
+): void {}
 
 function applySource(

[Survived] ConditionalExpression
helpers/object/mergeDeep.ts:19:7
 ): void {
   const resultValue = result[key];
   const sourceValue = source[key];
-  if (isPlainObject(resultValue) && isPlainObject(sourceValue)) {
+  if (true) {
     result[key] = mergeDeep(
       resultValue as Record<PropertyKey, unknown>,

[Survived] BlockStatement
helpers/object/mergeDeep.ts:19:65
 ): void {
   const resultValue = result[key];
   const sourceValue = source[key];
-  if (isPlainObject(resultValue) && isPlainObject(sourceValue)) {
-    result[key] = mergeDeep(
-      resultValue as Record<PropertyKey, unknown>,
-      sourceValue as Record<PropertyKey, unknown>,
-    );
-  } else if (sourceValue !== undefined) {
+  if (isPlainObject(resultValue) && isPlainObject(sourceValue)) {} else if (sourceValue !== undefined) {
     result[key] = (isPlainObject(sourceValue) || Array.isArray(sourceValue))
       ? cloneDeep(sourceValue)

[Survived] ConditionalExpression
helpers/object/mergeDeep.ts:24:14
       resultValue as Record<PropertyKey, unknown>,
       sourceValue as Record<PropertyKey, unknown>,
     );
-  } else if (sourceValue !== undefined) {
+  } else if (false) {
     result[key] = (isPlainObject(sourceValue) || Array.isArray(sourceValue))
       ? cloneDeep(sourceValue)

[Survived] EqualityOperator
helpers/object/mergeDeep.ts:24:14
       resultValue as Record<PropertyKey, unknown>,
       sourceValue as Record<PropertyKey, unknown>,
     );
-  } else if (sourceValue !== undefined) {
+  } else if (sourceValue === undefined) {
     result[key] = (isPlainObject(sourceValue) || Array.isArray(sourceValue))
       ? cloneDeep(sourceValue)

[Survived] ConditionalExpression
helpers/object/mergeDeep.ts:25:20
       sourceValue as Record<PropertyKey, unknown>,
     );
   } else if (sourceValue !== undefined) {
-    result[key] = (isPlainObject(sourceValue) || Array.isArray(sourceValue))
+    result[key] = (true)
       ? cloneDeep(sourceValue)
       : sourceValue;

[Survived] LogicalOperator
helpers/object/mergeDeep.ts:25:20
       sourceValue as Record<PropertyKey, unknown>,
     );
   } else if (sourceValue !== undefined) {
-    result[key] = (isPlainObject(sourceValue) || Array.isArray(sourceValue))
+    result[key] = (isPlainObject(sourceValue) && Array.isArray(sourceValue))
       ? cloneDeep(sourceValue)
       : sourceValue;

[Survived] BlockStatement
helpers/object/mergeDeep.ts:34:9
 function applySource(
   result: Record<PropertyKey, unknown>,
   source: Record<PropertyKey, unknown>,
-): void {
-  for (const key in source) {
-    if (!Object.hasOwn(source, key) || UNSAFE_KEYS.has(key)) continue;
-    applyKey(result, source, key);
-  }
-  for (const sym of Object.getOwnPropertySymbols(source)) {
-    if (!Object.prototype.propertyIsEnumerable.call(source, sym)) continue;
-    applyKey(result, source, sym);
-  }
-}
+): void {}
 
 /**

[Survived] BlockStatement
helpers/object/mergeDeep.ts:35:29
   result: Record<PropertyKey, unknown>,
   source: Record<PropertyKey, unknown>,
 ): void {
-  for (const key in source) {
-    if (!Object.hasOwn(source, key) || UNSAFE_KEYS.has(key)) continue;
-    applyKey(result, source, key);
-  }
+  for (const key in source) {}
   for (const sym of Object.getOwnPropertySymbols(source)) {
     if (!Object.prototype.propertyIsEnumerable.call(source, sym)) continue;

[Survived] CallExpression
helpers/object/mergeDeep.ts:37:5
 ): void {
   for (const key in source) {
     if (!Object.hasOwn(source, key) || UNSAFE_KEYS.has(key)) continue;
-    applyKey(result, source, key);
+    ;
   }
   for (const sym of Object.getOwnPropertySymbols(source)) {

[Survived] BlockStatement
helpers/object/mergeDeep.ts:39:59
     if (!Object.hasOwn(source, key) || UNSAFE_KEYS.has(key)) continue;
     applyKey(result, source, key);
   }
-  for (const sym of Object.getOwnPropertySymbols(source)) {
-    if (!Object.prototype.propertyIsEnumerable.call(source, sym)) continue;
-    applyKey(result, source, sym);
-  }
+  for (const sym of Object.getOwnPropertySymbols(source)) {}
 }
 

[Survived] ConditionalExpression
helpers/object/mergeDeep.ts:40:9
     applyKey(result, source, key);
   }
   for (const sym of Object.getOwnPropertySymbols(source)) {
-    if (!Object.prototype.propertyIsEnumerable.call(source, sym)) continue;
+    if (true) continue;
     applyKey(result, source, sym);
   }

[Survived] ConditionalExpression
helpers/object/mergeDeep.ts:40:9
     applyKey(result, source, key);
   }
   for (const sym of Object.getOwnPropertySymbols(source)) {
-    if (!Object.prototype.propertyIsEnumerable.call(source, sym)) continue;
+    if (false) continue;
     applyKey(result, source, sym);
   }

[Survived] CallExpression
helpers/object/mergeDeep.ts:41:5
   }
   for (const sym of Object.getOwnPropertySymbols(source)) {
     if (!Object.prototype.propertyIsEnumerable.call(source, sym)) continue;
-    applyKey(result, source, sym);
+    ;
   }
 }

[Survived] BlockStatement
helpers/object/mergeDeep.ts:100:57
  * @since 1.9.0
  */
 export function mergeDeep<T extends [object, ...object[]]>(...sources: [...T]): MergeResult<T>;
-export function mergeDeep(...sources: object[]): object {
-  const result: Record<PropertyKey, unknown> = {};
-  for (const source of sources) {
-    if (source !== null && source !== undefined) {
-      applySource(result, source as Record<PropertyKey, unknown>);
-    }
-  }
-  return result;
-}
+export function mergeDeep(...sources: object[]): object {}
 

[Survived] BlockStatement
helpers/object/mergeDeep.ts:102:33
 export function mergeDeep<T extends [object, ...object[]]>(...sources: [...T]): MergeResult<T>;
 export function mergeDeep(...sources: object[]): object {
   const result: Record<PropertyKey, unknown> = {};
-  for (const source of sources) {
-    if (source !== null && source !== undefined) {
-      applySource(result, source as Record<PropertyKey, unknown>);
-    }
-  }
+  for (const source of sources) {}
   return result;
 }

[Survived] EqualityOperator
helpers/object/mergeDeep.ts:103:28
 export function mergeDeep(...sources: object[]): object {
   const result: Record<PropertyKey, unknown> = {};
   for (const source of sources) {
-    if (source !== null && source !== undefined) {
+    if (source !== null && source === undefined) {
       applySource(result, source as Record<PropertyKey, unknown>);
     }

[Survived] BlockStatement
helpers/object/mergeDeep.ts:103:50
 export function mergeDeep(...sources: object[]): object {
   const result: Record<PropertyKey, unknown> = {};
   for (const source of sources) {
-    if (source !== null && source !== undefined) {
-      applySource(result, source as Record<PropertyKey, unknown>);
-    }
+    if (source !== null && source !== undefined) {}
   }
   return result;

[Survived] CallExpression
helpers/object/mergeDeep.ts:104:7
   const result: Record<PropertyKey, unknown> = {};
   for (const source of sources) {
     if (source !== null && source !== undefined) {
-      applySource(result, source as Record<PropertyKey, unknown>);
+      ;
     }
   }
