[Survived] BlockStatement
helpers/object/pascalCaseKeys.ts:24:48
  * // => { UserName: 'Alice', HomeAddress: { ZipCode: '12345' } }
  * @since 3.0.3
  */
-export function pascalCaseKeys<T>(value: T): T {
-  return mapDeep(value, undefined, pascalCase);
-}
+export function pascalCaseKeys<T>(value: T): T {}
 
