[Survived] BlockStatement
helpers/promise/createMutex.ts:55:38
  * }
  * @since 3.0.4
  */
-export function createMutex(): Mutex {
-  const semaphore = createSemaphore(1);
-  return {
-    acquire: semaphore.acquire,
-    run: semaphore.run,
-    isLocked: () => semaphore.availablePermits() === 0,
-  };
-}
+export function createMutex(): Mutex {}
 

[Survived] ConditionalExpression
helpers/promise/createMutex.ts:60:21
   return {
     acquire: semaphore.acquire,
     run: semaphore.run,
-    isLocked: () => semaphore.availablePermits() === 0,
+    isLocked: () => true,
   };
 }

[Survived] ConditionalExpression
helpers/promise/createMutex.ts:60:21
   return {
     acquire: semaphore.acquire,
     run: semaphore.run,
-    isLocked: () => semaphore.availablePermits() === 0,
+    isLocked: () => false,
   };
 }
