[Killed] BlockStatement
helpers/promise/falsyPromiseOrThrow.ts:13:79
  * @returns A function that returns the data if falsy, or throws
  * @since 1.0.0
  */
-export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
-  return (data: T) => {
-    if (data) {
-      throw new Error(error); // eslint-disable-line functional/no-throw-statement
-    }
-    return data;
-  };
-}
+export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {}
 
killedBy: cleanPath security edge cases should handle path traversal sequences
statusReason: Property failed after 1 tests
{ seed: 385426829, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/falsyPromiseOrThrow.ts:14:23
  * @since 1.0.0
  */
 export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
-  return (data: T) => {
-    if (data) {
-      throw new Error(error); // eslint-disable-line functional/no-throw-statement
-    }
-    return data;
-  };
+  return (data: T) => {};
 }
 
killedBy: isError — contract new SyntaxError() → true
statusReason: expected undefined to be 'My custom error message' // Object.is equality

[Killed] ConditionalExpression
helpers/promise/falsyPromiseOrThrow.ts:15:9
  */
 export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
   return (data: T) => {
-    if (data) {
+    if (true) {
       throw new Error(error); // eslint-disable-line functional/no-throw-statement
     }
killedBy: cleanPath security edge cases should handle path traversal sequences
statusReason: Property failed after 1 tests
{ seed: -1615031438, path: "0", endOnFailure: true }
Counterexample: [0]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/falsyPromiseOrThrow.ts:15:15
  */
 export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
   return (data: T) => {
-    if (data) {
-      throw new Error(error); // eslint-disable-line functional/no-throw-statement
-    }
+    if (data) {}
     return data;
   };
killedBy: isError — contract new SyntaxError() → true
statusReason: expected 'some string' to be 'My custom error message' // Object.is equality

[Killed] CallExpression
helpers/promise/falsyPromiseOrThrow.ts:16:7
 export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
   return (data: T) => {
     if (data) {
-      throw new Error(error); // eslint-disable-line functional/no-throw-statement
+      ; // eslint-disable-line functional/no-throw-statement
     }
     return data;
killedBy: isError — contract new SyntaxError() → true
statusReason: expected 'some string' to be 'My custom error message' // Object.is equality
