[Survived] ConditionalExpression
helpers/promise/parallelSettle.ts:40:5
   concurrency: number,
 ): Promise<{ fulfilled: T[]; rejected: unknown[] }> {
   const clampedConcurrency =
-    concurrency === Number.POSITIVE_INFINITY
+    false
       ? functions.length
       : Number.isFinite(concurrency)

[Survived] ConditionalExpression
helpers/promise/parallelSettle.ts:40:5
   concurrency: number,
 ): Promise<{ fulfilled: T[]; rejected: unknown[] }> {
   const clampedConcurrency =
-    concurrency === Number.POSITIVE_INFINITY
+    true
       ? functions.length
       : Number.isFinite(concurrency)

[Survived] MethodExpression
helpers/promise/parallelSettle.ts:43:11
     concurrency === Number.POSITIVE_INFINITY
       ? functions.length
       : Number.isFinite(concurrency)
-        ? Math.max(1, Math.floor(concurrency))
+        ? Math.min(1, Math.floor(concurrency))
         : 1;
   const results: ({ status: 'fulfilled'; value: T } | { status: 'rejected'; reason: unknown })[] = Array.from({

[Survived] ObjectLiteral
helpers/promise/parallelSettle.ts:45:111
       : Number.isFinite(concurrency)
         ? Math.max(1, Math.floor(concurrency))
         : 1;
-  const results: ({ status: 'fulfilled'; value: T } | { status: 'rejected'; reason: unknown })[] = Array.from({
-    length: functions.length,
-  });
+  const results: ({ status: 'fulfilled'; value: T } | { status: 'rejected'; reason: unknown })[] = Array.from({});
   let nextIndex = 0;
 

[Survived] BlockStatement
helpers/promise/parallelSettle.ts:50:43
   });
   let nextIndex = 0;
 
-  async function runNext(): Promise<void> {
-    if (nextIndex >= functions.length) return;
-    const currentIndex = nextIndex++;
-    try {
-      const value = await functions[currentIndex]!();
-      results[currentIndex] = { status: 'fulfilled', value };
-    } catch (reason) {
-      results[currentIndex] = { status: 'rejected', reason };
-    }
-    return runNext();
-  }
+  async function runNext(): Promise<void> {}
 
   const workers = Array.from({ length: Math.min(clampedConcurrency, functions.length) }, () => runNext());

[Survived] EqualityOperator
helpers/promise/parallelSettle.ts:51:9
   let nextIndex = 0;
 
   async function runNext(): Promise<void> {
-    if (nextIndex >= functions.length) return;
+    if (nextIndex < functions.length) return;
     const currentIndex = nextIndex++;
     try {

[Survived] BlockStatement
helpers/promise/parallelSettle.ts:53:9
   async function runNext(): Promise<void> {
     if (nextIndex >= functions.length) return;
     const currentIndex = nextIndex++;
-    try {
-      const value = await functions[currentIndex]!();
-      results[currentIndex] = { status: 'fulfilled', value };
-    } catch (reason) {
+    try {} catch (reason) {
       results[currentIndex] = { status: 'rejected', reason };
     }

[Survived] ObjectLiteral
helpers/promise/parallelSettle.ts:55:31
     const currentIndex = nextIndex++;
     try {
       const value = await functions[currentIndex]!();
-      results[currentIndex] = { status: 'fulfilled', value };
+      results[currentIndex] = {};
     } catch (reason) {
       results[currentIndex] = { status: 'rejected', reason };

[Survived] BlockStatement
helpers/promise/parallelSettle.ts:56:22
     try {
       const value = await functions[currentIndex]!();
       results[currentIndex] = { status: 'fulfilled', value };
-    } catch (reason) {
-      results[currentIndex] = { status: 'rejected', reason };
-    }
+    } catch (reason) {}
     return runNext();
   }

[Survived] StringLiteral
helpers/promise/parallelSettle.ts:57:41
       const value = await functions[currentIndex]!();
       results[currentIndex] = { status: 'fulfilled', value };
     } catch (reason) {
-      results[currentIndex] = { status: 'rejected', reason };
+      results[currentIndex] = { status: "", reason };
     }
     return runNext();

[Survived] MethodExpression
helpers/promise/parallelSettle.ts:62:40
     return runNext();
   }
 
-  const workers = Array.from({ length: Math.min(clampedConcurrency, functions.length) }, () => runNext());
+  const workers = Array.from({ length: Math.max(clampedConcurrency, functions.length) }, () => runNext());
   await Promise.all(workers);
 

[Survived] ArrowFunction
helpers/promise/parallelSettle.ts:62:90
     return runNext();
   }
 
-  const workers = Array.from({ length: Math.min(clampedConcurrency, functions.length) }, () => runNext());
+  const workers = Array.from({ length: Math.min(clampedConcurrency, functions.length) }, () => undefined);
   await Promise.all(workers);
 

[Survived] ArrayDeclaration
helpers/promise/parallelSettle.ts:65:26
   const workers = Array.from({ length: Math.min(clampedConcurrency, functions.length) }, () => runNext());
   await Promise.all(workers);
 
-  const fulfilled: T[] = [];
+  const fulfilled: T[] = ["Stryker was here"];
   const rejected: unknown[] = [];
   for (const result of results) {

[Survived] ArrayDeclaration
helpers/promise/parallelSettle.ts:66:31
   await Promise.all(workers);
 
   const fulfilled: T[] = [];
-  const rejected: unknown[] = [];
+  const rejected: unknown[] = ["Stryker was here"];
   for (const result of results) {
     if (result.status === 'fulfilled') fulfilled.push(result.value);

[Survived] BlockStatement
helpers/promise/parallelSettle.ts:67:33
 
   const fulfilled: T[] = [];
   const rejected: unknown[] = [];
-  for (const result of results) {
-    if (result.status === 'fulfilled') fulfilled.push(result.value);
-    else rejected.push(result.reason);
-  }
+  for (const result of results) {}
 
   return { fulfilled, rejected };

[Survived] CallExpression
helpers/promise/parallelSettle.ts:68:40
   const fulfilled: T[] = [];
   const rejected: unknown[] = [];
   for (const result of results) {
-    if (result.status === 'fulfilled') fulfilled.push(result.value);
+    if (result.status === 'fulfilled') ;
     else rejected.push(result.reason);
   }

[Survived] EqualityOperator
helpers/promise/parallelSettle.ts:68:9
   const fulfilled: T[] = [];
   const rejected: unknown[] = [];
   for (const result of results) {
-    if (result.status === 'fulfilled') fulfilled.push(result.value);
+    if (result.status !== 'fulfilled') fulfilled.push(result.value);
     else rejected.push(result.reason);
   }

[Survived] CallExpression
helpers/promise/parallelSettle.ts:69:10
   const rejected: unknown[] = [];
   for (const result of results) {
     if (result.status === 'fulfilled') fulfilled.push(result.value);
-    else rejected.push(result.reason);
+    else ;
   }
 

[Survived] ObjectLiteral
helpers/promise/parallelSettle.ts:72:10
     else rejected.push(result.reason);
   }
 
-  return { fulfilled, rejected };
+  return {};
 }
 
