[Survived] BlockStatement
helpers/promise/settle.ts:34:53
  */
 export async function settle<T>(
   promises: readonly Promise<T>[],
-): Promise<{ fulfilled: T[]; rejected: unknown[] }> {
-  const results = await Promise.allSettled(promises);
-  const fulfilled: T[] = [];
-  const rejected: unknown[] = [];
-
-  for (const result of results) {
-    if (result.status === 'fulfilled') {
-      fulfilled.push(result.value);
-    } else {
-      rejected.push(result.reason);
-    }
-  }
-
-  return { fulfilled, rejected };
-}
+): Promise<{ fulfilled: T[]; rejected: unknown[] }> {}
 

[Survived] ArrayDeclaration
helpers/promise/settle.ts:36:26
   promises: readonly Promise<T>[],
 ): Promise<{ fulfilled: T[]; rejected: unknown[] }> {
   const results = await Promise.allSettled(promises);
-  const fulfilled: T[] = [];
+  const fulfilled: T[] = ["Stryker was here"];
   const rejected: unknown[] = [];
 

[Survived] BlockStatement
helpers/promise/settle.ts:39:33
   const fulfilled: T[] = [];
   const rejected: unknown[] = [];
 
-  for (const result of results) {
-    if (result.status === 'fulfilled') {
-      fulfilled.push(result.value);
-    } else {
-      rejected.push(result.reason);
-    }
-  }
+  for (const result of results) {}
 
   return { fulfilled, rejected };

[Survived] ConditionalExpression
helpers/promise/settle.ts:40:9
   const rejected: unknown[] = [];
 
   for (const result of results) {
-    if (result.status === 'fulfilled') {
+    if (false) {
       fulfilled.push(result.value);
     } else {

[Survived] BlockStatement
helpers/promise/settle.ts:40:40
   const rejected: unknown[] = [];
 
   for (const result of results) {
-    if (result.status === 'fulfilled') {
-      fulfilled.push(result.value);
-    } else {
+    if (result.status === 'fulfilled') {} else {
       rejected.push(result.reason);
     }

[Survived] CallExpression
helpers/promise/settle.ts:41:7
 
   for (const result of results) {
     if (result.status === 'fulfilled') {
-      fulfilled.push(result.value);
+      ;
     } else {
       rejected.push(result.reason);

[Survived] BlockStatement
helpers/promise/settle.ts:42:12
   for (const result of results) {
     if (result.status === 'fulfilled') {
       fulfilled.push(result.value);
-    } else {
-      rejected.push(result.reason);
-    }
+    } else {}
   }
 

[Survived] CallExpression
helpers/promise/settle.ts:43:7
     if (result.status === 'fulfilled') {
       fulfilled.push(result.value);
     } else {
-      rejected.push(result.reason);
+      ;
     }
   }
