[Survived] BlockStatement
helpers/set/countBy.ts:17:89
  * // => Map(2) { 'odd' => 2, 'even' => 2 }
  * @since 3.0.3
  */
-export function countBy<T, R>(set: ReadonlySet<T>, fn: (value: T) => R): Map<R, number> {
-  const counts = new Map<R, number>();
-  for (const value of set) {
-    const group = fn(value);
-    counts.set(group, (counts.get(group) ?? 0) + 1);
-  }
-  return counts;
-}
+export function countBy<T, R>(set: ReadonlySet<T>, fn: (value: T) => R): Map<R, number> {}
 

[Survived] BlockStatement
helpers/set/countBy.ts:19:28
  */
 export function countBy<T, R>(set: ReadonlySet<T>, fn: (value: T) => R): Map<R, number> {
   const counts = new Map<R, number>();
-  for (const value of set) {
-    const group = fn(value);
-    counts.set(group, (counts.get(group) ?? 0) + 1);
-  }
+  for (const value of set) {}
   return counts;
 }

[Survived] ArithmeticOperator
helpers/set/countBy.ts:21:23
   const counts = new Map<R, number>();
   for (const value of set) {
     const group = fn(value);
-    counts.set(group, (counts.get(group) ?? 0) + 1);
+    counts.set(group, (counts.get(group) ?? 0) - 1);
   }
   return counts;

[Survived] LogicalOperator
helpers/set/countBy.ts:21:24
   const counts = new Map<R, number>();
   for (const value of set) {
     const group = fn(value);
-    counts.set(group, (counts.get(group) ?? 0) + 1);
+    counts.set(group, (counts.get(group) && 0) + 1);
   }
   return counts;
