[Killed] StringLiteral
helpers/string/_trimCharClasses.ts:35:19
 // mandatory line/paragraph separators. U+2007 FIGURE SPACE sits inside the
 // U+2000-U+200A run but is itself non-breaking (it glues digits in tables),
 // so it's carved out here and only added back in SEPARATOR below.
-const WRAPPABLE = '\\t\\n\\v\\f\\r \\u1680\\u2000-\\u2006\\u2008-\\u200A\\u2028\\u2029\\u205F\\u3000';
+const WRAPPABLE = "";
 
 // + the non-breaking subset of Zs — together, the full Space_Separator
killedBy: parsePropertyPath returns a cached (but frozen, immutable) result on repeated calls
statusReason: expected '   Hello   ' to be ' Hello ' // Object.is equality

[Killed] StringLiteral
helpers/string/_trimCharClasses.ts:43:20
 
 // + U+FEFF (BOM / zero-width no-break space) — not Zs, but ECMAScript's own
 // WhiteSpace grammar production includes it, and so does String.prototype.trim.
-const WHITESPACE = `${SEPARATOR}\\uFEFF`;
+const WHITESPACE = ``;
 
 // + genuinely invisible zero-width Format (Cf) characters, never stripped by
killedBy: listTimezones returns an array of strings
statusReason: expected 'Hello ' to be 'Hello' // Object.is equality

[Killed] ObjectLiteral
helpers/string/_trimCharClasses.ts:67:57
 // entry individually /* @__PURE__ */-annotated, tree-shakes correctly.
 
 /** @ignore */
-export const TRIM_END_REGEX: Record<TrimMode, RegExp> = {
-  wrappable: /* @__PURE__ */ new RegExp(`[${WRAPPABLE}]+$`, 'u'),
-  separator: /* @__PURE__ */ new RegExp(`[${SEPARATOR}]+$`, 'u'),
-  whitespace: /* @__PURE__ */ new RegExp(`[${WHITESPACE}]+$`, 'u'),
-  unicode: /* @__PURE__ */ new RegExp(`[${UNICODE}]+$`, 'u'),
-};
+export const TRIM_END_REGEX: Record<TrimMode, RegExp> = {};
 
 /** @ignore */
killedBy: parsePropertyPath returns a cached (but frozen, immutable) result on repeated calls
statusReason: expected ' Hello   ' to be ' Hello ' // Object.is equality

[Survived] StringLiteral
helpers/string/_trimCharClasses.ts:69:61
 /** @ignore */
 export const TRIM_END_REGEX: Record<TrimMode, RegExp> = {
   wrappable: /* @__PURE__ */ new RegExp(`[${WRAPPABLE}]+$`, 'u'),
-  separator: /* @__PURE__ */ new RegExp(`[${SEPARATOR}]+$`, 'u'),
+  separator: /* @__PURE__ */ new RegExp(`[${SEPARATOR}]+$`, ""),
   whitespace: /* @__PURE__ */ new RegExp(`[${WHITESPACE}]+$`, 'u'),
   unicode: /* @__PURE__ */ new RegExp(`[${UNICODE}]+$`, 'u'),

[Survived] StringLiteral
helpers/string/_trimCharClasses.ts:70:63
 export const TRIM_END_REGEX: Record<TrimMode, RegExp> = {
   wrappable: /* @__PURE__ */ new RegExp(`[${WRAPPABLE}]+$`, 'u'),
   separator: /* @__PURE__ */ new RegExp(`[${SEPARATOR}]+$`, 'u'),
-  whitespace: /* @__PURE__ */ new RegExp(`[${WHITESPACE}]+$`, 'u'),
+  whitespace: /* @__PURE__ */ new RegExp(`[${WHITESPACE}]+$`, ""),
   unicode: /* @__PURE__ */ new RegExp(`[${UNICODE}]+$`, 'u'),
 };

[Survived] StringLiteral
helpers/string/_trimCharClasses.ts:71:57
   wrappable: /* @__PURE__ */ new RegExp(`[${WRAPPABLE}]+$`, 'u'),
   separator: /* @__PURE__ */ new RegExp(`[${SEPARATOR}]+$`, 'u'),
   whitespace: /* @__PURE__ */ new RegExp(`[${WHITESPACE}]+$`, 'u'),
-  unicode: /* @__PURE__ */ new RegExp(`[${UNICODE}]+$`, 'u'),
+  unicode: /* @__PURE__ */ new RegExp(`[${UNICODE}]+$`, ""),
 };
 

[Killed] StringLiteral
helpers/string/_trimCharClasses.ts:77:41
 /** @ignore */
 export const TRIM_START_REGEX: Record<TrimMode, RegExp> = {
   wrappable: /* @__PURE__ */ new RegExp(`^[${WRAPPABLE}]+`, 'u'),
-  separator: /* @__PURE__ */ new RegExp(`^[${SEPARATOR}]+`, 'u'),
+  separator: /* @__PURE__ */ new RegExp(``, 'u'),
   whitespace: /* @__PURE__ */ new RegExp(`^[${WHITESPACE}]+`, 'u'),
   unicode: /* @__PURE__ */ new RegExp(`^[${UNICODE}]+`, 'u'),
killedBy: isSameDay should return false for different years
statusReason: expected ' Hello' to be 'Hello' // Object.is equality

[Survived] StringLiteral
helpers/string/_trimCharClasses.ts:77:61
 /** @ignore */
 export const TRIM_START_REGEX: Record<TrimMode, RegExp> = {
   wrappable: /* @__PURE__ */ new RegExp(`^[${WRAPPABLE}]+`, 'u'),
-  separator: /* @__PURE__ */ new RegExp(`^[${SEPARATOR}]+`, 'u'),
+  separator: /* @__PURE__ */ new RegExp(`^[${SEPARATOR}]+`, ""),
   whitespace: /* @__PURE__ */ new RegExp(`^[${WHITESPACE}]+`, 'u'),
   unicode: /* @__PURE__ */ new RegExp(`^[${UNICODE}]+`, 'u'),

[Survived] StringLiteral
helpers/string/_trimCharClasses.ts:79:57
   wrappable: /* @__PURE__ */ new RegExp(`^[${WRAPPABLE}]+`, 'u'),
   separator: /* @__PURE__ */ new RegExp(`^[${SEPARATOR}]+`, 'u'),
   whitespace: /* @__PURE__ */ new RegExp(`^[${WHITESPACE}]+`, 'u'),
-  unicode: /* @__PURE__ */ new RegExp(`^[${UNICODE}]+`, 'u'),
+  unicode: /* @__PURE__ */ new RegExp(`^[${UNICODE}]+`, ""),
 };
 

[Survived] StringLiteral
helpers/string/_trimCharClasses.ts:83:75
 };
 
 /** @ignore */
-export const TRIM_MODES: readonly TrimMode[] = ['wrappable', 'separator', 'whitespace', 'unicode'];
+export const TRIM_MODES: readonly TrimMode[] = ['wrappable', 'separator', "", 'unicode'];
 
 /**

[Survived] BlockStatement
helpers/string/_trimCharClasses.ts:95:74
  * @throws {TypeError} If `mode` isn't one of the values in {@link TRIM_MODES}
  * @ignore
  */
-export function assertValidTrimMode(mode: TrimMode, label: string): void {
-  if (!TRIM_MODES.includes(mode)) {
-    throw new TypeError(`${label}: mode must be one of ${TRIM_MODES.join(', ')}, got ${JSON.stringify(mode)}`);
-  }
-}
+export function assertValidTrimMode(mode: TrimMode, label: string): void {}
 

[Survived] BlockStatement
helpers/string/_trimCharClasses.ts:96:35
  * @ignore
  */
 export function assertValidTrimMode(mode: TrimMode, label: string): void {
-  if (!TRIM_MODES.includes(mode)) {
-    throw new TypeError(`${label}: mode must be one of ${TRIM_MODES.join(', ')}, got ${JSON.stringify(mode)}`);
-  }
+  if (!TRIM_MODES.includes(mode)) {}
 }
 

[Survived] ConditionalExpression
helpers/string/_trimCharClasses.ts:96:7
  * @ignore
  */
 export function assertValidTrimMode(mode: TrimMode, label: string): void {
-  if (!TRIM_MODES.includes(mode)) {
+  if (true) {
     throw new TypeError(`${label}: mode must be one of ${TRIM_MODES.join(', ')}, got ${JSON.stringify(mode)}`);
   }

[Survived] StringLiteral
helpers/string/_trimCharClasses.ts:97:25
  */
 export function assertValidTrimMode(mode: TrimMode, label: string): void {
   if (!TRIM_MODES.includes(mode)) {
-    throw new TypeError(`${label}: mode must be one of ${TRIM_MODES.join(', ')}, got ${JSON.stringify(mode)}`);
+    throw new TypeError(``);
   }
 }
