[Survived] BlockStatement
helpers/string/formatProgressBar.ts:42:92
  * // => '######----'
  * @since 3.0.1
  */
-export function formatProgressBar(value: number, options: ProgressBarOptions = {}): string {
-  const { width = 20, filledChar = '▓', emptyChar = '░', max = 100 } = options;
-  const safeWidth = Math.max(0, Math.round(width));
-
-  const ratio = Number.isFinite(max) && max > 0 ? value / max : 0;
-  const clamped = Number.isFinite(ratio) ? Math.min(1, Math.max(0, ratio)) : 0;
-  const filled = Math.round(clamped * safeWidth);
-
-  return filledChar.repeat(filled) + emptyChar.repeat(safeWidth - filled);
-}
+export function formatProgressBar(value: number, options: ProgressBarOptions = {}): string {}
 

[Survived] StringLiteral
helpers/string/formatProgressBar.ts:43:36
  * @since 3.0.1
  */
 export function formatProgressBar(value: number, options: ProgressBarOptions = {}): string {
-  const { width = 20, filledChar = '▓', emptyChar = '░', max = 100 } = options;
+  const { width = 20, filledChar = "", emptyChar = '░', max = 100 } = options;
   const safeWidth = Math.max(0, Math.round(width));
 

[Survived] MethodExpression
helpers/string/formatProgressBar.ts:44:21
  */
 export function formatProgressBar(value: number, options: ProgressBarOptions = {}): string {
   const { width = 20, filledChar = '▓', emptyChar = '░', max = 100 } = options;
-  const safeWidth = Math.max(0, Math.round(width));
+  const safeWidth = Math.min(0, Math.round(width));
 
   const ratio = Number.isFinite(max) && max > 0 ? value / max : 0;

[Survived] ConditionalExpression
helpers/string/formatProgressBar.ts:46:17
   const { width = 20, filledChar = '▓', emptyChar = '░', max = 100 } = options;
   const safeWidth = Math.max(0, Math.round(width));
 
-  const ratio = Number.isFinite(max) && max > 0 ? value / max : 0;
+  const ratio = false ? value / max : 0;
   const clamped = Number.isFinite(ratio) ? Math.min(1, Math.max(0, ratio)) : 0;
   const filled = Math.round(clamped * safeWidth);

[Survived] EqualityOperator
helpers/string/formatProgressBar.ts:46:41
   const { width = 20, filledChar = '▓', emptyChar = '░', max = 100 } = options;
   const safeWidth = Math.max(0, Math.round(width));
 
-  const ratio = Number.isFinite(max) && max > 0 ? value / max : 0;
+  const ratio = Number.isFinite(max) && max <= 0 ? value / max : 0;
   const clamped = Number.isFinite(ratio) ? Math.min(1, Math.max(0, ratio)) : 0;
   const filled = Math.round(clamped * safeWidth);

[Survived] MethodExpression
helpers/string/formatProgressBar.ts:47:44
   const safeWidth = Math.max(0, Math.round(width));
 
   const ratio = Number.isFinite(max) && max > 0 ? value / max : 0;
-  const clamped = Number.isFinite(ratio) ? Math.min(1, Math.max(0, ratio)) : 0;
+  const clamped = Number.isFinite(ratio) ? Math.max(1, Math.max(0, ratio)) : 0;
   const filled = Math.round(clamped * safeWidth);
 

[Survived] MethodExpression
helpers/string/formatProgressBar.ts:47:56
   const safeWidth = Math.max(0, Math.round(width));
 
   const ratio = Number.isFinite(max) && max > 0 ? value / max : 0;
-  const clamped = Number.isFinite(ratio) ? Math.min(1, Math.max(0, ratio)) : 0;
+  const clamped = Number.isFinite(ratio) ? Math.min(1, Math.min(0, ratio)) : 0;
   const filled = Math.round(clamped * safeWidth);
 

[Survived] ArithmeticOperator
helpers/string/formatProgressBar.ts:48:29
 
   const ratio = Number.isFinite(max) && max > 0 ? value / max : 0;
   const clamped = Number.isFinite(ratio) ? Math.min(1, Math.max(0, ratio)) : 0;
-  const filled = Math.round(clamped * safeWidth);
+  const filled = Math.round(clamped / safeWidth);
 
   return filledChar.repeat(filled) + emptyChar.repeat(safeWidth - filled);

[Survived] ArithmeticOperator
helpers/string/formatProgressBar.ts:50:10
   const clamped = Number.isFinite(ratio) ? Math.min(1, Math.max(0, ratio)) : 0;
   const filled = Math.round(clamped * safeWidth);
 
-  return filledChar.repeat(filled) + emptyChar.repeat(safeWidth - filled);
+  return filledChar.repeat(filled) - emptyChar.repeat(safeWidth - filled);
 }
 

[Survived] ArithmeticOperator
helpers/string/formatProgressBar.ts:50:55
   const clamped = Number.isFinite(ratio) ? Math.min(1, Math.max(0, ratio)) : 0;
   const filled = Math.round(clamped * safeWidth);
 
-  return filledChar.repeat(filled) + emptyChar.repeat(safeWidth - filled);
+  return filledChar.repeat(filled) + emptyChar.repeat(safeWidth + filled);
 }
 
