[Survived] BlockStatement
helpers/string/isEmpty.ts:23:91
  * isEmpty('foo')     // => false
  * @since 2.0.3
  */
-export function isEmpty(value: string | null | undefined): value is '' | null | undefined {
-  return value == null || value === '';
-}
+export function isEmpty(value: string | null | undefined): value is '' | null | undefined {}
 

[Survived] LogicalOperator
helpers/string/isEmpty.ts:24:10
  * @since 2.0.3
  */
 export function isEmpty(value: string | null | undefined): value is '' | null | undefined {
-  return value == null || value === '';
+  return value == null && value === '';
 }
 

[Survived] EqualityOperator
helpers/string/isEmpty.ts:24:10
  * @since 2.0.3
  */
 export function isEmpty(value: string | null | undefined): value is '' | null | undefined {
-  return value == null || value === '';
+  return value != null || value === '';
 }
 
