[Survived] BlockStatement
helpers/string/leadingSentence.ts:42:94
 export function leadingSentence(input: null): null;
 export function leadingSentence(input: undefined): undefined;
 export function leadingSentence(input: string | null | undefined): string | null | undefined;
-export function leadingSentence(input: string | null | undefined): string | null | undefined {
-  if (input == null) return input;
-  const clean = input.replace(/\n/g, ' ').trim();
-  const match = clean.match(/[.?!…;](?:\s|$)/);
-  if (match === null || match.index === undefined) return clean;
-  return clean.slice(0, match.index + 1);
-}
+export function leadingSentence(input: string | null | undefined): string | null | undefined {}
 

[Survived] ConditionalExpression
helpers/string/leadingSentence.ts:43:7
 export function leadingSentence(input: undefined): undefined;
 export function leadingSentence(input: string | null | undefined): string | null | undefined;
 export function leadingSentence(input: string | null | undefined): string | null | undefined {
-  if (input == null) return input;
+  if (false) return input;
   const clean = input.replace(/\n/g, ' ').trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);

[Survived] EqualityOperator
helpers/string/leadingSentence.ts:43:7
 export function leadingSentence(input: undefined): undefined;
 export function leadingSentence(input: string | null | undefined): string | null | undefined;
 export function leadingSentence(input: string | null | undefined): string | null | undefined {
-  if (input == null) return input;
+  if (input != null) return input;
   const clean = input.replace(/\n/g, ' ').trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);

[Survived] MethodExpression
helpers/string/leadingSentence.ts:44:17
 export function leadingSentence(input: string | null | undefined): string | null | undefined;
 export function leadingSentence(input: string | null | undefined): string | null | undefined {
   if (input == null) return input;
-  const clean = input.replace(/\n/g, ' ').trim();
+  const clean = input.replace(/\n/g, ' ');
   const match = clean.match(/[.?!…;](?:\s|$)/);
   if (match === null || match.index === undefined) return clean;

[Survived] StringLiteral
helpers/string/leadingSentence.ts:44:38
 export function leadingSentence(input: string | null | undefined): string | null | undefined;
 export function leadingSentence(input: string | null | undefined): string | null | undefined {
   if (input == null) return input;
-  const clean = input.replace(/\n/g, ' ').trim();
+  const clean = input.replace(/\n/g, "").trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);
   if (match === null || match.index === undefined) return clean;

[Survived] EqualityOperator
helpers/string/leadingSentence.ts:46:7
   if (input == null) return input;
   const clean = input.replace(/\n/g, ' ').trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);
-  if (match === null || match.index === undefined) return clean;
+  if (match !== null || match.index === undefined) return clean;
   return clean.slice(0, match.index + 1);
 }

[Survived] ConditionalExpression
helpers/string/leadingSentence.ts:46:7
   if (input == null) return input;
   const clean = input.replace(/\n/g, ' ').trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);
-  if (match === null || match.index === undefined) return clean;
+  if (false) return clean;
   return clean.slice(0, match.index + 1);
 }
