[Survived] BlockStatement
helpers/string/removeDiacritics.ts:25:55
  * removeDiacritics('hello')  // => 'hello'  (unchanged, no diacritics)
  * @since 3.0.0
  */
-export function removeDiacritics(str: string): string {
-  return str.normalize('NFKD').replace(COMBINING_DIACRITICAL_MARKS, '');
-}
+export function removeDiacritics(str: string): string {}
 

[Survived] StringLiteral
helpers/string/removeDiacritics.ts:26:24
  * @since 3.0.0
  */
 export function removeDiacritics(str: string): string {
-  return str.normalize('NFKD').replace(COMBINING_DIACRITICAL_MARKS, '');
+  return str.normalize("").replace(COMBINING_DIACRITICAL_MARKS, '');
 }
 
