[Survived] StringLiteral
helpers/string/truncate.ts:12:89
 // Reused across calls — constructing an Intl.Segmenter is measurably more
 // expensive than using a cached one. Grapheme-cluster segmentation is
 // locale-independent (Unicode UAX #29), so no locale argument is needed.
-const GRAPHEME_SEGMENTER = /* @__PURE__ */ new Intl.Segmenter(undefined, { granularity: 'grapheme' });
+const GRAPHEME_SEGMENTER = /* @__PURE__ */ new Intl.Segmenter(undefined, { granularity: "" });
 
 // Starting size (in UTF-16 code units) for the window below — generous enough

[Survived] BlockStatement
helpers/string/truncate.ts:44:74
  * stacked combining marks at the cut point) from ~1.15s into single-digit
  * milliseconds.
  */
-function snapToGraphemeBoundary(text: string, cutLength: number): number {
-  if (cutLength <= 0) return cutLength;
-
-  let windowSize = GRAPHEME_WINDOW;
-  while (true) {
-    const windowStart = Math.max(0, cutLength - windowSize);
-    const window = text.slice(windowStart, Math.min(text.length, cutLength + windowSize));
-
-    let boundary = -1;
-    for (const { index, segment } of GRAPHEME_SEGMENTER.segment(window)) {
-      const segmentEnd = windowStart + index + segment.length;
-      if (segmentEnd > cutLength) break;
-      boundary = segmentEnd;
-    }
-
-    if (boundary !== -1) return boundary;
-    if (windowStart === 0) return 0; // expanded all the way to the start of text and still nothing fits
-    windowSize *= 2; // no complete cluster fit this window — it spans wider than expected; try a bigger one
-  }
-}
+function snapToGraphemeBoundary(text: string, cutLength: number): number {}
 
 /**

[Survived] ConditionalExpression
helpers/string/truncate.ts:45:7
  * milliseconds.
  */
 function snapToGraphemeBoundary(text: string, cutLength: number): number {
-  if (cutLength <= 0) return cutLength;
+  if (true) return cutLength;
 
   let windowSize = GRAPHEME_WINDOW;

[Survived] EqualityOperator
helpers/string/truncate.ts:45:7
  * milliseconds.
  */
 function snapToGraphemeBoundary(text: string, cutLength: number): number {
-  if (cutLength <= 0) return cutLength;
+  if (cutLength < 0) return cutLength;
 
   let windowSize = GRAPHEME_WINDOW;

[Survived] BooleanLiteral
helpers/string/truncate.ts:48:10
   if (cutLength <= 0) return cutLength;
 
   let windowSize = GRAPHEME_WINDOW;
-  while (true) {
+  while (false) {
     const windowStart = Math.max(0, cutLength - windowSize);
     const window = text.slice(windowStart, Math.min(text.length, cutLength + windowSize));

[Survived] MethodExpression
helpers/string/truncate.ts:49:25
 
   let windowSize = GRAPHEME_WINDOW;
   while (true) {
-    const windowStart = Math.max(0, cutLength - windowSize);
+    const windowStart = Math.min(0, cutLength - windowSize);
     const window = text.slice(windowStart, Math.min(text.length, cutLength + windowSize));
 

[Survived] ArithmeticOperator
helpers/string/truncate.ts:49:37
 
   let windowSize = GRAPHEME_WINDOW;
   while (true) {
-    const windowStart = Math.max(0, cutLength - windowSize);
+    const windowStart = Math.max(0, cutLength + windowSize);
     const window = text.slice(windowStart, Math.min(text.length, cutLength + windowSize));
 

[Survived] ArithmeticOperator
helpers/string/truncate.ts:50:66
   let windowSize = GRAPHEME_WINDOW;
   while (true) {
     const windowStart = Math.max(0, cutLength - windowSize);
-    const window = text.slice(windowStart, Math.min(text.length, cutLength + windowSize));
+    const window = text.slice(windowStart, Math.min(text.length, cutLength - windowSize));
 
     let boundary = -1;

[Survived] MethodExpression
helpers/string/truncate.ts:50:20
   let windowSize = GRAPHEME_WINDOW;
   while (true) {
     const windowStart = Math.max(0, cutLength - windowSize);
-    const window = text.slice(windowStart, Math.min(text.length, cutLength + windowSize));
+    const window = text;
 
     let boundary = -1;

[Survived] UnaryOperator
helpers/string/truncate.ts:52:20
     const windowStart = Math.max(0, cutLength - windowSize);
     const window = text.slice(windowStart, Math.min(text.length, cutLength + windowSize));
 
-    let boundary = -1;
+    let boundary = +1;
     for (const { index, segment } of GRAPHEME_SEGMENTER.segment(window)) {
       const segmentEnd = windowStart + index + segment.length;

[Survived] BlockStatement
helpers/string/truncate.ts:53:74
     const window = text.slice(windowStart, Math.min(text.length, cutLength + windowSize));
 
     let boundary = -1;
-    for (const { index, segment } of GRAPHEME_SEGMENTER.segment(window)) {
-      const segmentEnd = windowStart + index + segment.length;
-      if (segmentEnd > cutLength) break;
-      boundary = segmentEnd;
-    }
+    for (const { index, segment } of GRAPHEME_SEGMENTER.segment(window)) {}
 
     if (boundary !== -1) return boundary;

[Survived] ArithmeticOperator
helpers/string/truncate.ts:54:26
 
     let boundary = -1;
     for (const { index, segment } of GRAPHEME_SEGMENTER.segment(window)) {
-      const segmentEnd = windowStart + index + segment.length;
+      const segmentEnd = windowStart + index - segment.length;
       if (segmentEnd > cutLength) break;
       boundary = segmentEnd;

[Survived] ArithmeticOperator
helpers/string/truncate.ts:54:26
 
     let boundary = -1;
     for (const { index, segment } of GRAPHEME_SEGMENTER.segment(window)) {
-      const segmentEnd = windowStart + index + segment.length;
+      const segmentEnd = windowStart - index + segment.length;
       if (segmentEnd > cutLength) break;
       boundary = segmentEnd;

[Survived] EqualityOperator
helpers/string/truncate.ts:55:11
     let boundary = -1;
     for (const { index, segment } of GRAPHEME_SEGMENTER.segment(window)) {
       const segmentEnd = windowStart + index + segment.length;
-      if (segmentEnd > cutLength) break;
+      if (segmentEnd <= cutLength) break;
       boundary = segmentEnd;
     }

[Survived] ConditionalExpression
helpers/string/truncate.ts:55:11
     let boundary = -1;
     for (const { index, segment } of GRAPHEME_SEGMENTER.segment(window)) {
       const segmentEnd = windowStart + index + segment.length;
-      if (segmentEnd > cutLength) break;
+      if (true) break;
       boundary = segmentEnd;
     }

[Survived] ConditionalExpression
helpers/string/truncate.ts:59:9
       boundary = segmentEnd;
     }
 
-    if (boundary !== -1) return boundary;
+    if (true) return boundary;
     if (windowStart === 0) return 0; // expanded all the way to the start of text and still nothing fits
     windowSize *= 2; // no complete cluster fit this window — it spans wider than expected; try a bigger one

[Survived] UnaryOperator
helpers/string/truncate.ts:59:22
       boundary = segmentEnd;
     }
 
-    if (boundary !== -1) return boundary;
+    if (boundary !== +1) return boundary;
     if (windowStart === 0) return 0; // expanded all the way to the start of text and still nothing fits
     windowSize *= 2; // no complete cluster fit this window — it spans wider than expected; try a bigger one

[Survived] EqualityOperator
helpers/string/truncate.ts:60:9
     }
 
     if (boundary !== -1) return boundary;
-    if (windowStart === 0) return 0; // expanded all the way to the start of text and still nothing fits
+    if (windowStart !== 0) return 0; // expanded all the way to the start of text and still nothing fits
     windowSize *= 2; // no complete cluster fit this window — it spans wider than expected; try a bigger one
   }

[Survived] ConditionalExpression
helpers/string/truncate.ts:60:9
     }
 
     if (boundary !== -1) return boundary;
-    if (windowStart === 0) return 0; // expanded all the way to the start of text and still nothing fits
+    if (false) return 0; // expanded all the way to the start of text and still nothing fits
     windowSize *= 2; // no complete cluster fit this window — it spans wider than expected; try a bigger one
   }

[Survived] AssignmentOperator
helpers/string/truncate.ts:61:5
 
     if (boundary !== -1) return boundary;
     if (windowStart === 0) return 0; // expanded all the way to the start of text and still nothing fits
-    windowSize *= 2; // no complete cluster fit this window — it spans wider than expected; try a bigger one
+    windowSize /= 2; // no complete cluster fit this window — it spans wider than expected; try a bigger one
   }
 }

[Survived] BlockStatement
helpers/string/truncate.ts:104:30
   input: string | null | undefined,
   maxLength: number,
   ellipsis = '…',
-): string | null | undefined {
-  if (input == null) return input;
-  if (input.length <= maxLength) return input;
-  if (maxLength <= ellipsis.length) return ellipsis.slice(0, maxLength);
-
-  let cutLength = maxLength - ellipsis.length;
-  let previous: number;
-  do {
-    previous = cutLength;
-    cutLength = snapToGraphemeBoundary(input, cutLength);
-    cutLength = trimEnd(input.slice(0, cutLength), 'wrappable').length;
-  } while (cutLength !== previous);
-
-  return input.slice(0, cutLength) + ellipsis;
-}
+): string | null | undefined {}
 

[Survived] ConditionalExpression
helpers/string/truncate.ts:106:7
   ellipsis = '…',
 ): string | null | undefined {
   if (input == null) return input;
-  if (input.length <= maxLength) return input;
+  if (false) return input;
   if (maxLength <= ellipsis.length) return ellipsis.slice(0, maxLength);
 

[Survived] ArithmeticOperator
helpers/string/truncate.ts:109:19
   if (input.length <= maxLength) return input;
   if (maxLength <= ellipsis.length) return ellipsis.slice(0, maxLength);
 
-  let cutLength = maxLength - ellipsis.length;
+  let cutLength = maxLength + ellipsis.length;
   let previous: number;
   do {

[Survived] BlockStatement
helpers/string/truncate.ts:111:6
 
   let cutLength = maxLength - ellipsis.length;
   let previous: number;
-  do {
-    previous = cutLength;
-    cutLength = snapToGraphemeBoundary(input, cutLength);
-    cutLength = trimEnd(input.slice(0, cutLength), 'wrappable').length;
-  } while (cutLength !== previous);
+  do {} while (cutLength !== previous);
 
   return input.slice(0, cutLength) + ellipsis;

[Survived] MethodExpression
helpers/string/truncate.ts:114:25
   do {
     previous = cutLength;
     cutLength = snapToGraphemeBoundary(input, cutLength);
-    cutLength = trimEnd(input.slice(0, cutLength), 'wrappable').length;
+    cutLength = trimEnd(input, 'wrappable').length;
   } while (cutLength !== previous);
 

[Survived] ConditionalExpression
helpers/string/truncate.ts:115:12
     previous = cutLength;
     cutLength = snapToGraphemeBoundary(input, cutLength);
     cutLength = trimEnd(input.slice(0, cutLength), 'wrappable').length;
-  } while (cutLength !== previous);
+  } while (false);
 
   return input.slice(0, cutLength) + ellipsis;

[Survived] EqualityOperator
helpers/string/truncate.ts:115:12
     previous = cutLength;
     cutLength = snapToGraphemeBoundary(input, cutLength);
     cutLength = trimEnd(input.slice(0, cutLength), 'wrappable').length;
-  } while (cutLength !== previous);
+  } while (cutLength === previous);
 
   return input.slice(0, cutLength) + ellipsis;

[Survived] MethodExpression
helpers/string/truncate.ts:117:10
     cutLength = trimEnd(input.slice(0, cutLength), 'wrappable').length;
   } while (cutLength !== previous);
 
-  return input.slice(0, cutLength) + ellipsis;
+  return input + ellipsis;
 }
 

[Survived] ArithmeticOperator
helpers/string/truncate.ts:117:10
     cutLength = trimEnd(input.slice(0, cutLength), 'wrappable').length;
   } while (cutLength !== previous);
 
-  return input.slice(0, cutLength) + ellipsis;
+  return input.slice(0, cutLength) - ellipsis;
 }
 
