[Survived] BlockStatement
helpers/structure/createUnionFind.ts:48:29
   const parent = new Map<T, T>();
   const rank = new Map<T, number>();
 
-  function find(item: T): T {
-    if (!parent.has(item)) {
-      parent.set(item, item);
-      rank.set(item, 0);
-      return item;
-    }
-
-    let root = item;
-    while (parent.get(root) !== root) root = parent.get(root)!;
-
-    // Path compression: repoint every visited node directly to the root, so the
-    // next find() for any of them is O(1) instead of retracing the same chain.
-    let current = item;
-    while (current !== root) {
-      const next = parent.get(current)!;
-      parent.set(current, root);
-      current = next;
-    }
-
-    return root;
-  }
+  function find(item: T): T {}
 
   return {

[Survived] ConditionalExpression
helpers/structure/createUnionFind.ts:49:9
   const rank = new Map<T, number>();
 
   function find(item: T): T {
-    if (!parent.has(item)) {
+    if (false) {
       parent.set(item, item);
       rank.set(item, 0);

[Survived] BlockStatement
helpers/structure/createUnionFind.ts:49:28
   const rank = new Map<T, number>();
 
   function find(item: T): T {
-    if (!parent.has(item)) {
-      parent.set(item, item);
-      rank.set(item, 0);
-      return item;
-    }
+    if (!parent.has(item)) {}
 
     let root = item;

[Survived] CallExpression
helpers/structure/createUnionFind.ts:50:7
 
   function find(item: T): T {
     if (!parent.has(item)) {
-      parent.set(item, item);
+      ;
       rank.set(item, 0);
       return item;

[Survived] CallExpression
helpers/structure/createUnionFind.ts:51:7
   function find(item: T): T {
     if (!parent.has(item)) {
       parent.set(item, item);
-      rank.set(item, 0);
+      ;
       return item;
     }

[Survived] EqualityOperator
helpers/structure/createUnionFind.ts:56:12
     }
 
     let root = item;
-    while (parent.get(root) !== root) root = parent.get(root)!;
+    while (parent.get(root) === root) root = parent.get(root)!;
 
     // Path compression: repoint every visited node directly to the root, so the

[Survived] ConditionalExpression
helpers/structure/createUnionFind.ts:56:12
     }
 
     let root = item;
-    while (parent.get(root) !== root) root = parent.get(root)!;
+    while (false) root = parent.get(root)!;
 
     // Path compression: repoint every visited node directly to the root, so the

[Survived] ConditionalExpression
helpers/structure/createUnionFind.ts:61:12
     // Path compression: repoint every visited node directly to the root, so the
     // next find() for any of them is O(1) instead of retracing the same chain.
     let current = item;
-    while (current !== root) {
+    while (false) {
       const next = parent.get(current)!;
       parent.set(current, root);

[Survived] BlockStatement
helpers/structure/createUnionFind.ts:61:30
     // Path compression: repoint every visited node directly to the root, so the
     // next find() for any of them is O(1) instead of retracing the same chain.
     let current = item;
-    while (current !== root) {
-      const next = parent.get(current)!;
-      parent.set(current, root);
-      current = next;
-    }
+    while (current !== root) {}
 
     return root;

[Survived] CallExpression
helpers/structure/createUnionFind.ts:63:7
     let current = item;
     while (current !== root) {
       const next = parent.get(current)!;
-      parent.set(current, root);
+      ;
       current = next;
     }

[Survived] BlockStatement
helpers/structure/createUnionFind.ts:72:29
 
   return {
     find,
-    union(a: T, b: T): void {
-      const rootA = find(a);
-      const rootB = find(b);
-      if (rootA === rootB) return;
-
-      // Union by rank: attach the shallower tree under the deeper one's root, so
-      // repeated unions don't degenerate into a single long chain. On equal
-      // ranks, either attach direction is fine, but the resulting tree grew
-      // one level deeper, so the new root's rank must be bumped.
-      const rankA = rank.get(rootA)!;
-      const rankB = rank.get(rootB)!;
-      if (rankA < rankB) {
-        parent.set(rootA, rootB);
-      } else {
-        parent.set(rootB, rootA);
-        if (rankA === rankB) rank.set(rootA, rankA + 1);
-      }
-    },
+    union(a: T, b: T): void {},
     connected(a: T, b: T): boolean {
       return find(a) === find(b);

[Survived] ConditionalExpression
helpers/structure/createUnionFind.ts:75:11
     union(a: T, b: T): void {
       const rootA = find(a);
       const rootB = find(b);
-      if (rootA === rootB) return;
+      if (true) return;
 
       // Union by rank: attach the shallower tree under the deeper one's root, so

[Survived] ConditionalExpression
helpers/structure/createUnionFind.ts:75:11
     union(a: T, b: T): void {
       const rootA = find(a);
       const rootB = find(b);
-      if (rootA === rootB) return;
+      if (false) return;
 
       // Union by rank: attach the shallower tree under the deeper one's root, so

[Survived] ConditionalExpression
helpers/structure/createUnionFind.ts:83:11
       // one level deeper, so the new root's rank must be bumped.
       const rankA = rank.get(rootA)!;
       const rankB = rank.get(rootB)!;
-      if (rankA < rankB) {
+      if (false) {
         parent.set(rootA, rootB);
       } else {

[Survived] BlockStatement
helpers/structure/createUnionFind.ts:83:26
       // one level deeper, so the new root's rank must be bumped.
       const rankA = rank.get(rootA)!;
       const rankB = rank.get(rootB)!;
-      if (rankA < rankB) {
-        parent.set(rootA, rootB);
-      } else {
+      if (rankA < rankB) {} else {
         parent.set(rootB, rootA);
         if (rankA === rankB) rank.set(rootA, rankA + 1);

[Survived] CallExpression
helpers/structure/createUnionFind.ts:84:9
       const rankA = rank.get(rootA)!;
       const rankB = rank.get(rootB)!;
       if (rankA < rankB) {
-        parent.set(rootA, rootB);
+        ;
       } else {
         parent.set(rootB, rootA);

[Survived] BlockStatement
helpers/structure/createUnionFind.ts:85:14
       const rankB = rank.get(rootB)!;
       if (rankA < rankB) {
         parent.set(rootA, rootB);
-      } else {
-        parent.set(rootB, rootA);
-        if (rankA === rankB) rank.set(rootA, rankA + 1);
-      }
+      } else {}
     },
     connected(a: T, b: T): boolean {

[Survived] CallExpression
helpers/structure/createUnionFind.ts:86:9
       if (rankA < rankB) {
         parent.set(rootA, rootB);
       } else {
-        parent.set(rootB, rootA);
+        ;
         if (rankA === rankB) rank.set(rootA, rankA + 1);
       }

[Survived] ConditionalExpression
helpers/structure/createUnionFind.ts:87:13
         parent.set(rootA, rootB);
       } else {
         parent.set(rootB, rootA);
-        if (rankA === rankB) rank.set(rootA, rankA + 1);
+        if (true) rank.set(rootA, rankA + 1);
       }
     },

[Survived] ArithmeticOperator
helpers/structure/createUnionFind.ts:87:46
         parent.set(rootA, rootB);
       } else {
         parent.set(rootB, rootA);
-        if (rankA === rankB) rank.set(rootA, rankA + 1);
+        if (rankA === rankB) rank.set(rootA, rankA - 1);
       }
     },

[Survived] BlockStatement
helpers/structure/createUnionFind.ts:90:36
         if (rankA === rankB) rank.set(rootA, rankA + 1);
       }
     },
-    connected(a: T, b: T): boolean {
-      return find(a) === find(b);
-    },
+    connected(a: T, b: T): boolean {},
   };
 }

[Survived] EqualityOperator
helpers/structure/createUnionFind.ts:91:14
       }
     },
     connected(a: T, b: T): boolean {
-      return find(a) === find(b);
+      return find(a) !== find(b);
     },
   };

[Survived] ConditionalExpression
helpers/structure/createUnionFind.ts:91:14
       }
     },
     connected(a: T, b: T): boolean {
-      return find(a) === find(b);
+      return false;
     },
   };
