[Survived] BlockStatement
helpers/version/_assertNeverScheme.ts:23:57
  * stringify.ts/isPrerelease.ts's object-input overloads have to) still names the actual value.
  * @ignore
  */
-export function assertNeverScheme(scheme: never): never {
-  const rendered = typeof scheme === 'object' && scheme !== null ? JSON.stringify(scheme) : String(scheme);
-  throw new Error(`Unhandled version scheme: ${rendered}`);
-}
+export function assertNeverScheme(scheme: never): never {}
 

[Survived] LogicalOperator
helpers/version/_assertNeverScheme.ts:24:20
  * @ignore
  */
 export function assertNeverScheme(scheme: never): never {
-  const rendered = typeof scheme === 'object' && scheme !== null ? JSON.stringify(scheme) : String(scheme);
+  const rendered = typeof scheme === 'object' || scheme !== null ? JSON.stringify(scheme) : String(scheme);
   throw new Error(`Unhandled version scheme: ${rendered}`);
 }

[Survived] EqualityOperator
helpers/version/_assertNeverScheme.ts:24:20
  * @ignore
  */
 export function assertNeverScheme(scheme: never): never {
-  const rendered = typeof scheme === 'object' && scheme !== null ? JSON.stringify(scheme) : String(scheme);
+  const rendered = typeof scheme !== 'object' && scheme !== null ? JSON.stringify(scheme) : String(scheme);
   throw new Error(`Unhandled version scheme: ${rendered}`);
 }
