[Survived] BlockStatement
helpers/version/increment.ts:44:30
   version: string | undefined | null,
   type: IncrementType,
   scheme: VersionScheme = 'semver',
-): string | undefined | null {
-  if (version === undefined || version === null) return version;
-  switch (scheme) {
-    case 'semver':
-      return incrementSemVer(version, type);
-    case 'gentoo':
-      return incrementGentoo(version, type);
-    default:
-      return assertNeverScheme(scheme);
-  }
-}
+): string | undefined | null {}
 

[Survived] EqualityOperator
helpers/version/increment.ts:45:32
   type: IncrementType,
   scheme: VersionScheme = 'semver',
 ): string | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (version === undefined || version !== null) return version;
   switch (scheme) {
     case 'semver':

[Survived] ConditionalExpression
helpers/version/increment.ts:47:5
 ): string | undefined | null {
   if (version === undefined || version === null) return version;
   switch (scheme) {
-    case 'semver':
-      return incrementSemVer(version, type);
+    case 'semver':
     case 'gentoo':
       return incrementGentoo(version, type);

[Survived] StringLiteral
helpers/version/increment.ts:47:10
 ): string | undefined | null {
   if (version === undefined || version === null) return version;
   switch (scheme) {
-    case 'semver':
+    case "":
       return incrementSemVer(version, type);
     case 'gentoo':

[Survived] ConditionalExpression
helpers/version/increment.ts:49:5
   switch (scheme) {
     case 'semver':
       return incrementSemVer(version, type);
-    case 'gentoo':
-      return incrementGentoo(version, type);
+    case 'gentoo':
     default:
       return assertNeverScheme(scheme);

[Survived] StringLiteral
helpers/version/increment.ts:49:10
   switch (scheme) {
     case 'semver':
       return incrementSemVer(version, type);
-    case 'gentoo':
+    case "":
       return incrementGentoo(version, type);
     default:

[Survived] ConditionalExpression
helpers/version/increment.ts:51:5
       return incrementSemVer(version, type);
     case 'gentoo':
       return incrementGentoo(version, type);
-    default:
-      return assertNeverScheme(scheme);
+    default:
   }
 }
