[Survived] BlockStatement
helpers/version/satisfiesRange.ts:38:107
  * satisfiesRange('1.2.3-r0', '1.2.3', 'gentoo') // true — '-r0' is the implicit default, same version
  * @since 1.9.0
  */
-export function satisfiesRange(version: string, range: string, scheme: VersionScheme = 'semver'): boolean {
-  switch (scheme) {
-    case 'semver':
-      return satisfiesRangeSemVer(version, range);
-    case 'gentoo':
-      return satisfiesRangeGentoo(version, range);
-    default:
-      return assertNeverScheme(scheme);
-  }
-}
+export function satisfiesRange(version: string, range: string, scheme: VersionScheme = 'semver'): boolean {}
 

[Survived] ConditionalExpression
helpers/version/satisfiesRange.ts:40:5
  */
 export function satisfiesRange(version: string, range: string, scheme: VersionScheme = 'semver'): boolean {
   switch (scheme) {
-    case 'semver':
-      return satisfiesRangeSemVer(version, range);
+    case 'semver':
     case 'gentoo':
       return satisfiesRangeGentoo(version, range);

[Survived] ConditionalExpression
helpers/version/satisfiesRange.ts:42:5
   switch (scheme) {
     case 'semver':
       return satisfiesRangeSemVer(version, range);
-    case 'gentoo':
-      return satisfiesRangeGentoo(version, range);
+    case 'gentoo':
     default:
       return assertNeverScheme(scheme);

[Survived] StringLiteral
helpers/version/satisfiesRange.ts:42:10
   switch (scheme) {
     case 'semver':
       return satisfiesRangeSemVer(version, range);
-    case 'gentoo':
+    case "":
       return satisfiesRangeGentoo(version, range);
     default:

[Survived] ConditionalExpression
helpers/version/satisfiesRange.ts:44:5
       return satisfiesRangeSemVer(version, range);
     case 'gentoo':
       return satisfiesRangeGentoo(version, range);
-    default:
-      return assertNeverScheme(scheme);
+    default:
   }
 }
