[Survived] BlockStatement
helpers/array/_concurrentMap.ts:19:96
  * an invalid `concurrency` is always rejected regardless of the input array's length.
  * @ignore
  */
-export function resolveConcurrency(concurrency: number | undefined, itemCount: number): number {
-  if (concurrency === undefined) return itemCount;
-  return Math.min(validatePositiveCount(concurrency, 'concurrency'), itemCount);
-}
+export function resolveConcurrency(concurrency: number | undefined, itemCount: number): number {}
 
 /**

[Survived] ConditionalExpression
helpers/array/_concurrentMap.ts:20:7
  * @ignore
  */
 export function resolveConcurrency(concurrency: number | undefined, itemCount: number): number {
-  if (concurrency === undefined) return itemCount;
+  if (false) return itemCount;
   return Math.min(validatePositiveCount(concurrency, 'concurrency'), itemCount);
 }

[Survived] ConditionalExpression
helpers/array/_concurrentMap.ts:20:7
  * @ignore
  */
 export function resolveConcurrency(concurrency: number | undefined, itemCount: number): number {
-  if (concurrency === undefined) return itemCount;
+  if (true) return itemCount;
   return Math.min(validatePositiveCount(concurrency, 'concurrency'), itemCount);
 }

[Survived] MethodExpression
helpers/array/_concurrentMap.ts:21:10
  */
 export function resolveConcurrency(concurrency: number | undefined, itemCount: number): number {
   if (concurrency === undefined) return itemCount;
-  return Math.min(validatePositiveCount(concurrency, 'concurrency'), itemCount);
+  return Math.max(validatePositiveCount(concurrency, 'concurrency'), itemCount);
 }
 

[Survived] BlockStatement
helpers/array/_concurrentMap.ts:43:17
   items: readonly T[],
   fn: (item: T, index: number) => R | Promise<R>,
   concurrency: number | undefined,
-): Promise<R[]> {
-  const workerCount = resolveConcurrency(concurrency, items.length);
-  if (items.length === 0) return [];
-  const thunks = Array.from(
-    { length: items.length },
-    (_, index) =>
-      async () =>
-        index in items ? fn(items[index]!, index) : (undefined as R),
-  );
-  return parallel(thunks, workerCount);
-}
+): Promise<R[]> {}
 
 /**

[Survived] EqualityOperator
helpers/array/_concurrentMap.ts:45:7
   concurrency: number | undefined,
 ): Promise<R[]> {
   const workerCount = resolveConcurrency(concurrency, items.length);
-  if (items.length === 0) return [];
+  if (items.length !== 0) return [];
   const thunks = Array.from(
     { length: items.length },

[Survived] ConditionalExpression
helpers/array/_concurrentMap.ts:45:7
   concurrency: number | undefined,
 ): Promise<R[]> {
   const workerCount = resolveConcurrency(concurrency, items.length);
-  if (items.length === 0) return [];
+  if (false) return [];
   const thunks = Array.from(
     { length: items.length },

[Survived] ArrowFunction
helpers/array/_concurrentMap.ts:48:5
   if (items.length === 0) return [];
   const thunks = Array.from(
     { length: items.length },
-    (_, index) =>
-      async () =>
-        index in items ? fn(items[index]!, index) : (undefined as R),
+    () => undefined,
   );
   return parallel(thunks, workerCount);

[Survived] ArrowFunction
helpers/array/_concurrentMap.ts:49:7
   const thunks = Array.from(
     { length: items.length },
     (_, index) =>
-      async () =>
-        index in items ? fn(items[index]!, index) : (undefined as R),
+      () => undefined,
   );
   return parallel(thunks, workerCount);

[Survived] BlockStatement
helpers/array/_concurrentMap.ts:69:18
   items: readonly T[],
   fn: (item: T, index: number) => unknown,
   concurrency: number | undefined,
-): Promise<void> {
-  const workerCount = resolveConcurrency(concurrency, items.length);
-  if (items.length === 0) return;
-  let nextIndex = 0;
-
-  async function worker(): Promise<void> {
-    if (nextIndex >= items.length) return;
-    const currentIndex = nextIndex++;
-    if (currentIndex in items) {
-      await fn(items[currentIndex]!, currentIndex);
-    }
-    return worker();
-  }
-
-  await Promise.all(Array.from({ length: workerCount }, worker));
-}
+): Promise<void> {}
 

[Survived] EqualityOperator
helpers/array/_concurrentMap.ts:71:7
   concurrency: number | undefined,
 ): Promise<void> {
   const workerCount = resolveConcurrency(concurrency, items.length);
-  if (items.length === 0) return;
+  if (items.length !== 0) return;
   let nextIndex = 0;
 

[Survived] ConditionalExpression
helpers/array/_concurrentMap.ts:71:7
   concurrency: number | undefined,
 ): Promise<void> {
   const workerCount = resolveConcurrency(concurrency, items.length);
-  if (items.length === 0) return;
+  if (false) return;
   let nextIndex = 0;
 

[Survived] BlockStatement
helpers/array/_concurrentMap.ts:74:42
   if (items.length === 0) return;
   let nextIndex = 0;
 
-  async function worker(): Promise<void> {
-    if (nextIndex >= items.length) return;
-    const currentIndex = nextIndex++;
-    if (currentIndex in items) {
-      await fn(items[currentIndex]!, currentIndex);
-    }
-    return worker();
-  }
+  async function worker(): Promise<void> {}
 
   await Promise.all(Array.from({ length: workerCount }, worker));

[Survived] EqualityOperator
helpers/array/_concurrentMap.ts:75:9
   let nextIndex = 0;
 
   async function worker(): Promise<void> {
-    if (nextIndex >= items.length) return;
+    if (nextIndex < items.length) return;
     const currentIndex = nextIndex++;
     if (currentIndex in items) {

[Survived] EqualityOperator
helpers/array/_concurrentMap.ts:75:9
   let nextIndex = 0;
 
   async function worker(): Promise<void> {
-    if (nextIndex >= items.length) return;
+    if (nextIndex > items.length) return;
     const currentIndex = nextIndex++;
     if (currentIndex in items) {

[Survived] UpdateOperator
helpers/array/_concurrentMap.ts:76:26
 
   async function worker(): Promise<void> {
     if (nextIndex >= items.length) return;
-    const currentIndex = nextIndex++;
+    const currentIndex = nextIndex--;
     if (currentIndex in items) {
       await fn(items[currentIndex]!, currentIndex);

[Survived] ConditionalExpression
helpers/array/_concurrentMap.ts:77:9
   async function worker(): Promise<void> {
     if (nextIndex >= items.length) return;
     const currentIndex = nextIndex++;
-    if (currentIndex in items) {
+    if (false) {
       await fn(items[currentIndex]!, currentIndex);
     }

[Survived] BlockStatement
helpers/array/_concurrentMap.ts:77:32
   async function worker(): Promise<void> {
     if (nextIndex >= items.length) return;
     const currentIndex = nextIndex++;
-    if (currentIndex in items) {
-      await fn(items[currentIndex]!, currentIndex);
-    }
+    if (currentIndex in items) {}
     return worker();
   }
