[Killed] BlockStatement
helpers/array/combineSortFns.ts:31:76
  * // => [{ a: 1, b: 1 }, { a: 1, b: 2 }]
  * @since 3.0.0
  */
-export function combineSortFns<T>(...fns: readonly SortFn<T>[]): SortFn<T> {
-  return (a: T, b: T) => {
-    for (const fn of fns) {
-      const result = fn(a, b);
-      if (result !== 0) return result;
-    }
-    return 0;
-  };
-}
+export function combineSortFns<T>(...fns: readonly SortFn<T>[]): SortFn<T> {}
 
killedBy: min returns undefined for undefined
statusReason: Property failed after 2 tests
{ seed: 863869883, path: "1:2:2:2:2:3:3:2:4:5:2:3:2:2:2:3:3:2:2:5:7:6:6:6:6:7:7:7:6:8:6:9:6:6:6:6:8:6:7", endOnFailure: true }
Counterexample: [[-10000000,-10000001]]
Shrunk 38 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BlockStatement
helpers/array/combineSortFns.ts:32:26
  * @since 3.0.0
  */
 export function combineSortFns<T>(...fns: readonly SortFn<T>[]): SortFn<T> {
-  return (a: T, b: T) => {
-    for (const fn of fns) {
-      const result = fn(a, b);
-      if (result !== 0) return result;
-    }
-    return 0;
-  };
+  return (a: T, b: T) => {};
 }
 

[Survived] BlockStatement
helpers/array/combineSortFns.ts:33:27
  */
 export function combineSortFns<T>(...fns: readonly SortFn<T>[]): SortFn<T> {
   return (a: T, b: T) => {
-    for (const fn of fns) {
-      const result = fn(a, b);
-      if (result !== 0) return result;
-    }
+    for (const fn of fns) {}
     return 0;
   };

[Survived] EqualityOperator
helpers/array/combineSortFns.ts:35:11
   return (a: T, b: T) => {
     for (const fn of fns) {
       const result = fn(a, b);
-      if (result !== 0) return result;
+      if (result === 0) return result;
     }
     return 0;

[Survived] ConditionalExpression
helpers/array/combineSortFns.ts:35:11
   return (a: T, b: T) => {
     for (const fn of fns) {
       const result = fn(a, b);
-      if (result !== 0) return result;
+      if (false) return result;
     }
     return 0;
