[Survived] BlockStatement
helpers/array/difference.ts:16:118
  * @returns Array with items from first array not present in second array
  * @since 1.9.0
  */
-export function difference<T>(array1: readonly T[] | null | undefined, array2: readonly T[] | null | undefined): T[] {
-  if (array1 == null) return [];
-  const set2 = new Set(array2 ?? []);
-  return array1.filter(item => !set2.has(item));
-}
+export function difference<T>(array1: readonly T[] | null | undefined, array2: readonly T[] | null | undefined): T[] {}
 

[Survived] ConditionalExpression
helpers/array/difference.ts:17:7
  * @since 1.9.0
  */
 export function difference<T>(array1: readonly T[] | null | undefined, array2: readonly T[] | null | undefined): T[] {
-  if (array1 == null) return [];
+  if (true) return [];
   const set2 = new Set(array2 ?? []);
   return array1.filter(item => !set2.has(item));

[Survived] ConditionalExpression
helpers/array/difference.ts:17:7
  * @since 1.9.0
  */
 export function difference<T>(array1: readonly T[] | null | undefined, array2: readonly T[] | null | undefined): T[] {
-  if (array1 == null) return [];
+  if (false) return [];
   const set2 = new Set(array2 ?? []);
   return array1.filter(item => !set2.has(item));

[Survived] LogicalOperator
helpers/array/difference.ts:18:24
  */
 export function difference<T>(array1: readonly T[] | null | undefined, array2: readonly T[] | null | undefined): T[] {
   if (array1 == null) return [];
-  const set2 = new Set(array2 ?? []);
+  const set2 = new Set(array2 && []);
   return array1.filter(item => !set2.has(item));
 }

[Killed] MethodExpression
helpers/array/difference.ts:19:10
 export function difference<T>(array1: readonly T[] | null | undefined, array2: readonly T[] | null | undefined): T[] {
   if (array1 == null) return [];
   const set2 = new Set(array2 ?? []);
-  return array1.filter(item => !set2.has(item));
+  return array1;
 }
 
killedBy: min handles negative numbers
statusReason: Property failed after 57 tests
{ seed: 911795510, path: "56:2:0:5:6:5", endOnFailure: true }
Counterexample: [[-13],[-13]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/difference.ts:19:32
 export function difference<T>(array1: readonly T[] | null | undefined, array2: readonly T[] | null | undefined): T[] {
   if (array1 == null) return [];
   const set2 = new Set(array2 ?? []);
-  return array1.filter(item => !set2.has(item));
+  return array1.filter(item => set2.has(item));
 }
 
killedBy: min handles duplicate minimums
statusReason: Property failed after 1 tests
{ seed: -1244720119, path: "0:1:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
