[Survived] BlockStatement
helpers/array/intersection.ts:17:110
  * @returns The intersection of the two arrays
  * @since 1.0.0
  */
-export function intersection<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): T[] {
-  if (a == null || b == null || a.length === 0 || b.length === 0) return [];
-  const setB = new Set(b);
-  return a.filter((v) => setB.has(v));
-}
+export function intersection<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): T[] {}
 

[Survived] ConditionalExpression
helpers/array/intersection.ts:18:20
  * @since 1.0.0
  */
 export function intersection<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): T[] {
-  if (a == null || b == null || a.length === 0 || b.length === 0) return [];
+  if (a == null || false || a.length === 0 || b.length === 0) return [];
   const setB = new Set(b);
   return a.filter((v) => setB.has(v));

[Survived] ConditionalExpression
helpers/array/intersection.ts:18:7
  * @since 1.0.0
  */
 export function intersection<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): T[] {
-  if (a == null || b == null || a.length === 0 || b.length === 0) return [];
+  if (false) return [];
   const setB = new Set(b);
   return a.filter((v) => setB.has(v));

[Survived] ArrowFunction
helpers/array/intersection.ts:20:19
 export function intersection<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): T[] {
   if (a == null || b == null || a.length === 0 || b.length === 0) return [];
   const setB = new Set(b);
-  return a.filter((v) => setB.has(v));
+  return a.filter(() => undefined);
 }
 

[Survived] MethodExpression
helpers/array/intersection.ts:20:10
 export function intersection<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): T[] {
   if (a == null || b == null || a.length === 0 || b.length === 0) return [];
   const setB = new Set(b);
-  return a.filter((v) => setB.has(v));
+  return a;
 }
 
