[Survived] BlockStatement
helpers/array/meanBy.ts:29:100
  * // => NaN
  * @since 3.0.3
  */
-export function meanBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
-  const length = array?.length ?? 0;
-  if (length === 0) return NaN;
-  return sumBy(array, accessor) / length;
-}
+export function meanBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {}
 

[Survived] LogicalOperator
helpers/array/meanBy.ts:30:18
  * @since 3.0.3
  */
 export function meanBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
-  const length = array?.length ?? 0;
+  const length = array?.length && 0;
   if (length === 0) return NaN;
   return sumBy(array, accessor) / length;

[Survived] OptionalChaining
helpers/array/meanBy.ts:30:18
  * @since 3.0.3
  */
 export function meanBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
-  const length = array?.length ?? 0;
+  const length = array.length ?? 0;
   if (length === 0) return NaN;
   return sumBy(array, accessor) / length;

[Survived] ConditionalExpression
helpers/array/meanBy.ts:31:7
  */
 export function meanBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
   const length = array?.length ?? 0;
-  if (length === 0) return NaN;
+  if (false) return NaN;
   return sumBy(array, accessor) / length;
 }

[Survived] EqualityOperator
helpers/array/meanBy.ts:31:7
  */
 export function meanBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
   const length = array?.length ?? 0;
-  if (length === 0) return NaN;
+  if (length !== 0) return NaN;
   return sumBy(array, accessor) / length;
 }

[Survived] ArithmeticOperator
helpers/array/meanBy.ts:32:10
 export function meanBy<T>(array: readonly T[] | null | undefined, accessor: ByAccessor<T>): number {
   const length = array?.length ?? 0;
   if (length === 0) return NaN;
-  return sumBy(array, accessor) / length;
+  return sumBy(array, accessor) * length;
 }
 
