[Survived] BlockStatement
helpers/array/partition.ts:25:15
 export function partition<T>(
   array: readonly T[] | null | undefined,
   predicate: (item: T, index: number) => boolean,
-): [T[], T[]] {
-  const pass: T[] = [];
-  const fail: T[] = [];
-  if (array == null) return [pass, fail];
-  for (let i = 0; i < array.length; i++) {
-    if (predicate(array[i], i)) {
-      pass.push(array[i]);
-    } else {
-      fail.push(array[i]);
-    }
-  }
-  return [pass, fail];
-}
+): [T[], T[]] {}
 

[Survived] ConditionalExpression
helpers/array/partition.ts:28:7
 ): [T[], T[]] {
   const pass: T[] = [];
   const fail: T[] = [];
-  if (array == null) return [pass, fail];
+  if (true) return [pass, fail];
   for (let i = 0; i < array.length; i++) {
     if (predicate(array[i], i)) {

[Survived] ConditionalExpression
helpers/array/partition.ts:28:7
 ): [T[], T[]] {
   const pass: T[] = [];
   const fail: T[] = [];
-  if (array == null) return [pass, fail];
+  if (false) return [pass, fail];
   for (let i = 0; i < array.length; i++) {
     if (predicate(array[i], i)) {

[Killed] EqualityOperator
helpers/array/partition.ts:29:19
   const pass: T[] = [];
   const fail: T[] = [];
   if (array == null) return [pass, fail];
-  for (let i = 0; i < array.length; i++) {
+  for (let i = 0; i <= array.length; i++) {
     if (predicate(array[i], i)) {
       pass.push(array[i]);
killedBy: isTemporalInstant — narrowing in if/else narrows the value to Temporal.Instant in the then-branch
statusReason: Property failed after 1 tests
{ seed: -561548312, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/partition.ts:29:42
   const pass: T[] = [];
   const fail: T[] = [];
   if (array == null) return [pass, fail];
-  for (let i = 0; i < array.length; i++) {
-    if (predicate(array[i], i)) {
-      pass.push(array[i]);
-    } else {
-      fail.push(array[i]);
-    }
-  }
+  for (let i = 0; i < array.length; i++) {}
   return [pass, fail];
 }
killedBy: isTemporalInstant — narrowing in if/else narrows the value to Temporal.Instant in the then-branch
statusReason: Property failed after 1 tests
{ seed: -1670640132, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/partition.ts:30:9
   const fail: T[] = [];
   if (array == null) return [pass, fail];
   for (let i = 0; i < array.length; i++) {
-    if (predicate(array[i], i)) {
+    if (false) {
       pass.push(array[i]);
     } else {
killedBy: isTemporalInstant should return true for Temporal.Instant.from()
statusReason: Property failed after 1 tests
{ seed: -1148604791, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] CallExpression
helpers/array/partition.ts:31:7
   if (array == null) return [pass, fail];
   for (let i = 0; i < array.length; i++) {
     if (predicate(array[i], i)) {
-      pass.push(array[i]);
+      ;
     } else {
       fail.push(array[i]);

[Survived] CallExpression
helpers/array/partition.ts:33:7
     if (predicate(array[i], i)) {
       pass.push(array[i]);
     } else {
-      fail.push(array[i]);
+      ;
     }
   }
