[Survived] BlockStatement
helpers/array/sample.ts:27:104
  */
 export function sample<T>(array: readonly T[] | null | undefined): T | undefined;
 export function sample<T>(array: readonly T[] | null | undefined, count: number): T[];
-export function sample<T>(array: readonly T[] | null | undefined, count?: number): T | undefined | T[] {
-  if (array == null || array.length === 0) {
-    return count === undefined ? undefined : [];
-  }
-
-  if (count === undefined) {
-    return array[Math.floor(Math.random() * array.length)];
-  }
-
-  const clamped = clamp(count, 0, array.length);
-  return shuffle(array).slice(0, clamped);
-}
+export function sample<T>(array: readonly T[] | null | undefined, count?: number): T | undefined | T[] {}
 

[Survived] LogicalOperator
helpers/array/sample.ts:28:7
 export function sample<T>(array: readonly T[] | null | undefined): T | undefined;
 export function sample<T>(array: readonly T[] | null | undefined, count: number): T[];
 export function sample<T>(array: readonly T[] | null | undefined, count?: number): T | undefined | T[] {
-  if (array == null || array.length === 0) {
+  if (array == null && array.length === 0) {
     return count === undefined ? undefined : [];
   }

[Survived] ConditionalExpression
helpers/array/sample.ts:28:7
 export function sample<T>(array: readonly T[] | null | undefined): T | undefined;
 export function sample<T>(array: readonly T[] | null | undefined, count: number): T[];
 export function sample<T>(array: readonly T[] | null | undefined, count?: number): T | undefined | T[] {
-  if (array == null || array.length === 0) {
+  if (true) {
     return count === undefined ? undefined : [];
   }

[Killed] ConditionalExpression
helpers/array/sample.ts:29:12
 export function sample<T>(array: readonly T[] | null | undefined, count: number): T[];
 export function sample<T>(array: readonly T[] | null | undefined, count?: number): T | undefined | T[] {
   if (array == null || array.length === 0) {
-    return count === undefined ? undefined : [];
+    return true ? undefined : [];
   }
 
killedBy: range — contract range(0) returns []
statusReason: Property failed after 10 tests
{ seed: -1131286433, path: "9:0", endOnFailure: true }
Counterexample: [[],0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/sample.ts:29:12
 export function sample<T>(array: readonly T[] | null | undefined, count: number): T[];
 export function sample<T>(array: readonly T[] | null | undefined, count?: number): T | undefined | T[] {
   if (array == null || array.length === 0) {
-    return count === undefined ? undefined : [];
+    return false ? undefined : [];
   }
 
killedBy: range — property-based length matches expected count
statusReason: Property failed after 38 tests
{ seed: 1652717781, path: "37", endOnFailure: true }
Counterexample: [[]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/sample.ts:32:7
     return count === undefined ? undefined : [];
   }
 
-  if (count === undefined) {
+  if (false) {
     return array[Math.floor(Math.random() * array.length)];
   }
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: 2127190903, path: "0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] MethodExpression
helpers/array/sample.ts:37:10
   }
 
   const clamped = clamp(count, 0, array.length);
-  return shuffle(array).slice(0, clamped);
+  return shuffle(array);
 }
 
