[Survived] BlockStatement
helpers/array/sortBy.ts:17:39
 
 // Duck-types via .getTime() so cross-realm Date objects (jsdom, iframe, Node vm)
 // are handled correctly — instanceof Date fails across realm boundaries.
-function toDateMs(v: unknown): number {
-  if (v !== null && typeof v === 'object' && typeof (v as Record<string, unknown>)['getTime'] === 'function')
-    return (v as unknown as { getTime(): number }).getTime();
-  if (typeof v === 'string' || typeof v === 'number')
-    return new Date(v).getTime();
-  return NaN;
-}
+function toDateMs(v: unknown): number {}
 
 /**

[Survived] EqualityOperator
helpers/array/sortBy.ts:18:7
 // Duck-types via .getTime() so cross-realm Date objects (jsdom, iframe, Node vm)
 // are handled correctly — instanceof Date fails across realm boundaries.
 function toDateMs(v: unknown): number {
-  if (v !== null && typeof v === 'object' && typeof (v as Record<string, unknown>)['getTime'] === 'function')
+  if (v === null && typeof v === 'object' && typeof (v as Record<string, unknown>)['getTime'] === 'function')
     return (v as unknown as { getTime(): number }).getTime();
   if (typeof v === 'string' || typeof v === 'number')

[Survived] EqualityOperator
helpers/array/sortBy.ts:18:46
 // Duck-types via .getTime() so cross-realm Date objects (jsdom, iframe, Node vm)
 // are handled correctly — instanceof Date fails across realm boundaries.
 function toDateMs(v: unknown): number {
-  if (v !== null && typeof v === 'object' && typeof (v as Record<string, unknown>)['getTime'] === 'function')
+  if (v !== null && typeof v === 'object' && typeof (v as Record<string, unknown>)['getTime'] !== 'function')
     return (v as unknown as { getTime(): number }).getTime();
   if (typeof v === 'string' || typeof v === 'number')

[Survived] EqualityOperator
helpers/array/sortBy.ts:20:7
 function toDateMs(v: unknown): number {
   if (v !== null && typeof v === 'object' && typeof (v as Record<string, unknown>)['getTime'] === 'function')
     return (v as unknown as { getTime(): number }).getTime();
-  if (typeof v === 'string' || typeof v === 'number')
+  if (typeof v !== 'string' || typeof v === 'number')
     return new Date(v).getTime();
   return NaN;

[Survived] ConditionalExpression
helpers/array/sortBy.ts:20:7
 function toDateMs(v: unknown): number {
   if (v !== null && typeof v === 'object' && typeof (v as Record<string, unknown>)['getTime'] === 'function')
     return (v as unknown as { getTime(): number }).getTime();
-  if (typeof v === 'string' || typeof v === 'number')
+  if (false)
     return new Date(v).getTime();
   return NaN;

[Survived] BooleanLiteral
helpers/array/sortBy.ts:54:30
  */
 export function createSortByStringFn<T extends Record<string, unknown>>(
   property?: keyof T | readonly (keyof T)[],
-  caseInsensitive: boolean = false,
+  caseInsensitive: boolean = true,
 ): SortFn<T> {
   const collator = caseInsensitive ? getStringCollatorInsensitive() : getStringCollator();

[Survived] BlockStatement
helpers/array/sortBy.ts:55:14
 export function createSortByStringFn<T extends Record<string, unknown>>(
   property?: keyof T | readonly (keyof T)[],
   caseInsensitive: boolean = false,
-): SortFn<T> {
-  const collator = caseInsensitive ? getStringCollatorInsensitive() : getStringCollator();
-  return buildCollatorCompareFn<T>(collator, normalizePropertyToKeys<T>(property));
-}
+): SortFn<T> {}
 
 /**

[Survived] BlockStatement
helpers/array/sortBy.ts:77:14
  */
 export function createSortByNumberFn<T extends Record<string, unknown>>(
   property?: keyof T,
-): SortFn<T> {
-  const prop = property ?? 'value';
-  return (a: T, b: T) => {
-    const aRaw = a[prop] == null ? NaN : Number(a[prop]);
-    const bRaw = b[prop] == null ? NaN : Number(b[prop]);
-    const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
-    const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;
-    return aVal > bVal ? 1 : aVal < bVal ? -1 : 0;
-  };
-}
+): SortFn<T> {}
 
 /**

[Survived] LogicalOperator
helpers/array/sortBy.ts:78:16
 export function createSortByNumberFn<T extends Record<string, unknown>>(
   property?: keyof T,
 ): SortFn<T> {
-  const prop = property ?? 'value';
+  const prop = property && 'value';
   return (a: T, b: T) => {
     const aRaw = a[prop] == null ? NaN : Number(a[prop]);

[Survived] StringLiteral
helpers/array/sortBy.ts:78:28
 export function createSortByNumberFn<T extends Record<string, unknown>>(
   property?: keyof T,
 ): SortFn<T> {
-  const prop = property ?? 'value';
+  const prop = property ?? "";
   return (a: T, b: T) => {
     const aRaw = a[prop] == null ? NaN : Number(a[prop]);

[Survived] BlockStatement
helpers/array/sortBy.ts:79:26
   property?: keyof T,
 ): SortFn<T> {
   const prop = property ?? 'value';
-  return (a: T, b: T) => {
-    const aRaw = a[prop] == null ? NaN : Number(a[prop]);
-    const bRaw = b[prop] == null ? NaN : Number(b[prop]);
-    const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
-    const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;
-    return aVal > bVal ? 1 : aVal < bVal ? -1 : 0;
-  };
+  return (a: T, b: T) => {};
 }
 

[Survived] ConditionalExpression
helpers/array/sortBy.ts:80:18
 ): SortFn<T> {
   const prop = property ?? 'value';
   return (a: T, b: T) => {
-    const aRaw = a[prop] == null ? NaN : Number(a[prop]);
+    const aRaw = true ? NaN : Number(a[prop]);
     const bRaw = b[prop] == null ? NaN : Number(b[prop]);
     const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;

[Survived] ConditionalExpression
helpers/array/sortBy.ts:80:18
 ): SortFn<T> {
   const prop = property ?? 'value';
   return (a: T, b: T) => {
-    const aRaw = a[prop] == null ? NaN : Number(a[prop]);
+    const aRaw = false ? NaN : Number(a[prop]);
     const bRaw = b[prop] == null ? NaN : Number(b[prop]);
     const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;

[Survived] EqualityOperator
helpers/array/sortBy.ts:81:18
   const prop = property ?? 'value';
   return (a: T, b: T) => {
     const aRaw = a[prop] == null ? NaN : Number(a[prop]);
-    const bRaw = b[prop] == null ? NaN : Number(b[prop]);
+    const bRaw = b[prop] != null ? NaN : Number(b[prop]);
     const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
     const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;

[Survived] ConditionalExpression
helpers/array/sortBy.ts:81:18
   const prop = property ?? 'value';
   return (a: T, b: T) => {
     const aRaw = a[prop] == null ? NaN : Number(a[prop]);
-    const bRaw = b[prop] == null ? NaN : Number(b[prop]);
+    const bRaw = false ? NaN : Number(b[prop]);
     const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
     const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;

[Survived] EqualityOperator
helpers/array/sortBy.ts:84:12
     const bRaw = b[prop] == null ? NaN : Number(b[prop]);
     const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
     const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;
-    return aVal > bVal ? 1 : aVal < bVal ? -1 : 0;
+    return aVal >= bVal ? 1 : aVal < bVal ? -1 : 0;
   };
 }

[Survived] EqualityOperator
helpers/array/sortBy.ts:84:30
     const bRaw = b[prop] == null ? NaN : Number(b[prop]);
     const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
     const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;
-    return aVal > bVal ? 1 : aVal < bVal ? -1 : 0;
+    return aVal > bVal ? 1 : aVal <= bVal ? -1 : 0;
   };
 }

[Survived] BlockStatement
helpers/array/sortBy.ts:108:14
  */
 export function createSortByDateFn<T extends Record<string, unknown>>(
   property?: keyof T,
-): SortFn<T> {
-  const prop = property ?? 'date';
-  return (a: T, b: T) => {
-    const aRaw = toDateMs(a[prop]);
-    const bRaw = toDateMs(b[prop]);
-    // NaN (null / undefined / unparseable) → Infinity so missing dates sort last.
-    // Explicit ternary avoids Infinity - Infinity = NaN (invalid comparator return value).
-    const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
-    const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;
-    return aVal > bVal ? 1 : aVal < bVal ? -1 : 0;
-  };
-}
+): SortFn<T> {}
 

[Survived] LogicalOperator
helpers/array/sortBy.ts:109:16
 export function createSortByDateFn<T extends Record<string, unknown>>(
   property?: keyof T,
 ): SortFn<T> {
-  const prop = property ?? 'date';
+  const prop = property && 'date';
   return (a: T, b: T) => {
     const aRaw = toDateMs(a[prop]);

[Survived] BlockStatement
helpers/array/sortBy.ts:110:26
   property?: keyof T,
 ): SortFn<T> {
   const prop = property ?? 'date';
-  return (a: T, b: T) => {
-    const aRaw = toDateMs(a[prop]);
-    const bRaw = toDateMs(b[prop]);
-    // NaN (null / undefined / unparseable) → Infinity so missing dates sort last.
-    // Explicit ternary avoids Infinity - Infinity = NaN (invalid comparator return value).
-    const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
-    const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;
-    return aVal > bVal ? 1 : aVal < bVal ? -1 : 0;
-  };
+  return (a: T, b: T) => {};
 }
 

[Survived] UnaryOperator
helpers/array/sortBy.ts:117:44
     // Explicit ternary avoids Infinity - Infinity = NaN (invalid comparator return value).
     const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
     const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;
-    return aVal > bVal ? 1 : aVal < bVal ? -1 : 0;
+    return aVal > bVal ? 1 : aVal < bVal ? +1 : 0;
   };
 }

[Survived] EqualityOperator
helpers/array/sortBy.ts:117:12
     // Explicit ternary avoids Infinity - Infinity = NaN (invalid comparator return value).
     const aVal = Number.isNaN(aRaw) ? Infinity : aRaw;
     const bVal = Number.isNaN(bRaw) ? Infinity : bRaw;
-    return aVal > bVal ? 1 : aVal < bVal ? -1 : 0;
+    return aVal <= bVal ? 1 : aVal < bVal ? -1 : 0;
   };
 }
