[Survived] BlockStatement
helpers/array/symmetricDifference.ts:22:8
 export function symmetricDifference<T>(
   array1: readonly T[] | null | undefined,
   array2: readonly T[] | null | undefined,
-): T[] {
-  const a = array1 ?? [];
-  const b = array2 ?? [];
-  const setA = new Set(a);
-  const setB = new Set(b);
-  return [...a.filter((item) => !setB.has(item)), ...b.filter((item) => !setA.has(item))];
-}
+): T[] {}
 

[Survived] LogicalOperator
helpers/array/symmetricDifference.ts:23:13
   array1: readonly T[] | null | undefined,
   array2: readonly T[] | null | undefined,
 ): T[] {
-  const a = array1 ?? [];
+  const a = array1 && [];
   const b = array2 ?? [];
   const setA = new Set(a);

[Survived] LogicalOperator
helpers/array/symmetricDifference.ts:24:13
   array2: readonly T[] | null | undefined,
 ): T[] {
   const a = array1 ?? [];
-  const b = array2 ?? [];
+  const b = array2 && [];
   const setA = new Set(a);
   const setB = new Set(b);

[Survived] BooleanLiteral
helpers/array/symmetricDifference.ts:27:33
   const b = array2 ?? [];
   const setA = new Set(a);
   const setB = new Set(b);
-  return [...a.filter((item) => !setB.has(item)), ...b.filter((item) => !setA.has(item))];
+  return [...a.filter((item) => setB.has(item)), ...b.filter((item) => !setA.has(item))];
 }
 

[Survived] MethodExpression
helpers/array/symmetricDifference.ts:27:14
   const b = array2 ?? [];
   const setA = new Set(a);
   const setB = new Set(b);
-  return [...a.filter((item) => !setB.has(item)), ...b.filter((item) => !setA.has(item))];
+  return [...a, ...b.filter((item) => !setA.has(item))];
 }
 
