[Survived] BlockStatement
helpers/array/unzip.ts:23:84
 export function unzip<A, B>(pairs: readonly [A, B][] | null | undefined): [A[], B[]];
 export function unzip<A, B, C>(pairs: readonly [A, B, C][] | null | undefined): [A[], B[], C[]];
 export function unzip<A, B, C, D>(pairs: readonly [A, B, C, D][] | null | undefined): [A[], B[], C[], D[]];
-export function unzip(pairs: readonly unknown[][] | null | undefined): unknown[][] {
-  if (pairs == null || pairs.length === 0) return [];
-  const width = pairs[0].length;
-  const result = Array.from({ length: width }, (): unknown[] => []);
-  for (const tuple of pairs) {
-    for (let i = 0; i < width; i++) {
-      result[i].push(tuple[i]);
-    }
-  }
-  return result;
-}
+export function unzip(pairs: readonly unknown[][] | null | undefined): unknown[][] {}
 

[Survived] EqualityOperator
helpers/array/unzip.ts:24:24
 export function unzip<A, B, C>(pairs: readonly [A, B, C][] | null | undefined): [A[], B[], C[]];
 export function unzip<A, B, C, D>(pairs: readonly [A, B, C, D][] | null | undefined): [A[], B[], C[], D[]];
 export function unzip(pairs: readonly unknown[][] | null | undefined): unknown[][] {
-  if (pairs == null || pairs.length === 0) return [];
+  if (pairs == null || pairs.length !== 0) return [];
   const width = pairs[0].length;
   const result = Array.from({ length: width }, (): unknown[] => []);

[Survived] ConditionalExpression
helpers/array/unzip.ts:24:24
 export function unzip<A, B, C>(pairs: readonly [A, B, C][] | null | undefined): [A[], B[], C[]];
 export function unzip<A, B, C, D>(pairs: readonly [A, B, C, D][] | null | undefined): [A[], B[], C[], D[]];
 export function unzip(pairs: readonly unknown[][] | null | undefined): unknown[][] {
-  if (pairs == null || pairs.length === 0) return [];
+  if (pairs == null || false) return [];
   const width = pairs[0].length;
   const result = Array.from({ length: width }, (): unknown[] => []);

[Survived] CallExpression
helpers/array/unzip.ts:29:7
   const result = Array.from({ length: width }, (): unknown[] => []);
   for (const tuple of pairs) {
     for (let i = 0; i < width; i++) {
-      result[i].push(tuple[i]);
+      ;
     }
   }
