[Killed] ArrayDeclaration
helpers/ci/percentageToTier.ts:29:68
  *
  * @since 3.0.1
  */
-export const DEFAULT_PERCENTAGE_TIERS: readonly PercentageTier[] = [
-  { min: 100, icon: '✅', color: 'brightgreen', label: 'perfect' },
-  { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
-  { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
-  { min: 60, icon: '🟠', color: 'orange', label: 'fair' },
-  { min: 0, icon: '🔴', color: 'red', label: 'poor' },
-];
+export const DEFAULT_PERCENTAGE_TIERS: readonly PercentageTier[] = [];
 
 /**
killedBy: consoleLogPromise — contract passes through an array (same reference)
statusReason: percentageToTier: tiers must not be empty

[Killed] StringLiteral
helpers/ci/percentageToTier.ts:30:33
  * @since 3.0.1
  */
 export const DEFAULT_PERCENTAGE_TIERS: readonly PercentageTier[] = [
-  { min: 100, icon: '✅', color: 'brightgreen', label: 'perfect' },
+  { min: 100, icon: '✅', color: "", label: 'perfect' },
   { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
   { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
killedBy: consoleLogPromise — contract passes through an array (same reference)
statusReason: expected { Object (min, icon, ...) } to deeply equal { min: 100, icon: '✅', …(2) }

[Killed] StringLiteral
helpers/ci/percentageToTier.ts:30:55
  * @since 3.0.1
  */
 export const DEFAULT_PERCENTAGE_TIERS: readonly PercentageTier[] = [
-  { min: 100, icon: '✅', color: 'brightgreen', label: 'perfect' },
+  { min: 100, icon: '✅', color: 'brightgreen', label: "" },
   { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
   { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
killedBy: consoleLogPromise — contract passes through an array (same reference)
statusReason: expected { min: 100, icon: '✅', …(2) } to deeply equal { min: 100, icon: '✅', …(2) }

[Killed] StringLiteral
helpers/ci/percentageToTier.ts:31:49
  */
 export const DEFAULT_PERCENTAGE_TIERS: readonly PercentageTier[] = [
   { min: 100, icon: '✅', color: 'brightgreen', label: 'perfect' },
-  { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
+  { min: 90, icon: '🟢', color: 'green', label: '""},
   { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
   { min: 60, icon: '🟠', color: 'orange', label: 'fair' },
killedBy: consoleLogPromise — contract logs with the given prefix
statusReason: expected '' to be 'excellent' // Object.is equality

[Survived] StringLiteral
helpers/ci/percentageToTier.ts:31:20
  */
 export const DEFAULT_PERCENTAGE_TIERS: readonly PercentageTier[] = [
   { min: 100, icon: '✅', color: 'brightgreen', label: 'perfect' },
-  { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
+  { min: 90, icon: "" color: 'green', label: 'excellent' },
   { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
   { min: 60, icon: '🟠', color: 'orange', label: 'fair' },

[Killed] StringLiteral
helpers/ci/percentageToTier.ts:32:50
 export const DEFAULT_PERCENTAGE_TIERS: readonly PercentageTier[] = [
   { min: 100, icon: '✅', color: 'brightgreen', label: 'perfect' },
   { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
-  { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
+  { min: 80, icon: '🟡', color: 'yellow', label: '""},
   { min: 60, icon: '🟠', color: 'orange', label: 'fair' },
   { min: 0, icon: '🔴', color: 'red', label: 'poor' },
killedBy: isTemporalInstant — property-based every Instant created from epoch ms is detected
statusReason: expected '' to be 'good' // Object.is equality

[Survived] StringLiteral
helpers/ci/percentageToTier.ts:33:20
   { min: 100, icon: '✅', color: 'brightgreen', label: 'perfect' },
   { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
   { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
-  { min: 60, icon: '🟠', color: 'orange', label: 'fair' },
+  { min: 60, icon: "" color: 'orange', label: 'fair' },
   { min: 0, icon: '🔴', color: 'red', label: 'poor' },
 ];

[Survived] StringLiteral
helpers/ci/percentageToTier.ts:33:33
   { min: 100, icon: '✅', color: 'brightgreen', label: 'perfect' },
   { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
   { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
-  { min: 60, icon: '🟠', color: 'orange', label: 'fair' },
+  { min: 60, icon: '🟠', color: '"" label: 'fair' },
   { min: 0, icon: '🔴', color: 'red', label: 'poor' },
 ];

[Killed] ObjectLiteral
helpers/ci/percentageToTier.ts:34:3
   { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
   { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
   { min: 60, icon: '🟠', color: 'orange', label: 'fair' },
-  { min: 0, icon: '🔴', color: 'red', label: 'poor' },
+  {}
 ];
 
killedBy: isTemporalInstant — contract Temporal.Now.instant() → true
statusReason: expected undefined to be 'poor' // Object.is equality

[Killed] StringLiteral
helpers/ci/percentageToTier.ts:34:46
   { min: 90, icon: '🟢', color: 'green', label: 'excellent' },
   { min: 80, icon: '🟡', color: 'yellow', label: 'good' },
   { min: 60, icon: '🟠', color: 'orange', label: 'fair' },
-  { min: 0, icon: '🔴', color: 'red', label: 'poor' },
+  { min: 0, icon: '🔴', color: 'red', label: '""},
 ];
 
killedBy: isTemporalInstant — contract Temporal.Now.instant() → true
statusReason: expected '' to be 'poor' // Object.is equality

[Killed] ArrowFunction
helpers/ci/percentageToTier.ts:40:24
 /**
  * Comparator to sort tiers by descending min value.
  */
-const DESCENDING_MIN = (a: PercentageTier, b: PercentageTier): number => b.min - a.min;
+const DESCENDING_MIN = () => undefined;
 
 /**
killedBy: isTemporalInstant — contract string → false
statusReason: expected 'fail' to be 'pass' // Object.is equality

[Survived] ArithmeticOperator
helpers/ci/percentageToTier.ts:40:74
 /**
  * Comparator to sort tiers by descending min value.
  */
-const DESCENDING_MIN = (a: PercentageTier, b: PercentageTier): number => b.min - a.min;
+const DESCENDING_MIN = (a: PercentageTier, b: PercentageTier): number => b.min + a.min;
 
 /**

[Survived] BlockStatement
helpers/ci/percentageToTier.ts:70:19
 export function percentageToTier(
   value: number,
   tiers: readonly PercentageTier[] = DEFAULT_PERCENTAGE_TIERS
-): PercentageTier {
-  if (tiers.length === 0) {
-    throw new RangeError('percentageToTier: tiers must not be empty');
-  }
-
-  const sorted = tiers.toSorted(DESCENDING_MIN);
-  const match = sorted.find(tier => value >= tier.min);
-  // sorted is non-empty (checked above), so its last element (lowest min) is always defined —
-  // reached when value is below every tier's min (e.g. a negative value).
-  return match ?? sorted[sorted.length - 1]!;
-}
+): PercentageTier {}
 

[Survived] EqualityOperator
helpers/ci/percentageToTier.ts:71:7
   value: number,
   tiers: readonly PercentageTier[] = DEFAULT_PERCENTAGE_TIERS
 ): PercentageTier {
-  if (tiers.length === 0) {
+  if (tiers.length !== 0) {
     throw new RangeError('percentageToTier: tiers must not be empty');
   }

[Survived] ConditionalExpression
helpers/ci/percentageToTier.ts:71:7
   value: number,
   tiers: readonly PercentageTier[] = DEFAULT_PERCENTAGE_TIERS
 ): PercentageTier {
-  if (tiers.length === 0) {
+  if (true) {
     throw new RangeError('percentageToTier: tiers must not be empty');
   }

[Survived] EqualityOperator
helpers/ci/percentageToTier.ts:76:37
   }
 
   const sorted = tiers.toSorted(DESCENDING_MIN);
-  const match = sorted.find(tier => value >= tier.min);
+  const match = sorted.find(tier => value > tier.min);
   // sorted is non-empty (checked above), so its last element (lowest min) is always defined —
   // reached when value is below every tier's min (e.g. a negative value).

[Survived] ConditionalExpression
helpers/ci/percentageToTier.ts:76:37
   }
 
   const sorted = tiers.toSorted(DESCENDING_MIN);
-  const match = sorted.find(tier => value >= tier.min);
+  const match = sorted.find(tier => false);
   // sorted is non-empty (checked above), so its last element (lowest min) is always defined —
   // reached when value is below every tier's min (e.g. a negative value).

[Survived] LogicalOperator
helpers/ci/percentageToTier.ts:79:10
   const match = sorted.find(tier => value >= tier.min);
   // sorted is non-empty (checked above), so its last element (lowest min) is always defined —
   // reached when value is below every tier's min (e.g. a negative value).
-  return match ?? sorted[sorted.length - 1]!;
+  return match && sorted[sorted.length - 1]!;
 }
 

[Survived] ArithmeticOperator
helpers/ci/percentageToTier.ts:79:26
   const match = sorted.find(tier => value >= tier.min);
   // sorted is non-empty (checked above), so its last element (lowest min) is always defined —
   // reached when value is below every tier's min (e.g. a negative value).
-  return match ?? sorted[sorted.length - 1]!;
+  return match ?? sorted[sorted.length + 1]!;
 }
 
