[Survived] BlockStatement
helpers/color/argbToRgb.ts:20:49
  * argbToRgb(0x8000ff00) // => 'rgb(0,255,0)'  (alpha byte is ignored)
  * @since 3.0.0
  */
-export function argbToRgb(argb: number): string {
-  const r = (argb >>> 16) & 0xff;
-  const g = (argb >>> 8) & 0xff;
-  const b = argb & 0xff;
-  return `rgb(${r},${g},${b})`;
-}
+export function argbToRgb(argb: number): string {}
 

[Survived] StringLiteral
helpers/color/argbToRgb.ts:24:10
   const r = (argb >>> 16) & 0xff;
   const g = (argb >>> 8) & 0xff;
   const b = argb & 0xff;
-  return `rgb(${r},${g},${b})`;
+  return ``;
 }
 
