[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:38:14
  * @since 3.0.0
  */
 export function rgbToHsl({ r, g, b, a = 1 }: RgbColor): HslColor {
-  const rN = r / 255;
+  const rN = r * 255;
   const gN = g / 255;
   const bN = b / 255;

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:39:14
  */
 export function rgbToHsl({ r, g, b, a = 1 }: RgbColor): HslColor {
   const rN = r / 255;
-  const gN = g / 255;
+  const gN = g * 255;
   const bN = b / 255;
   const max = Math.max(rN, gN, bN);

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:40:14
 export function rgbToHsl({ r, g, b, a = 1 }: RgbColor): HslColor {
   const rN = r / 255;
   const gN = g / 255;
-  const bN = b / 255;
+  const bN = b * 255;
   const max = Math.max(rN, gN, bN);
   const min = Math.min(rN, gN, bN);

[Survived] MethodExpression
helpers/color/rgbToHsl.ts:41:15
   const rN = r / 255;
   const gN = g / 255;
   const bN = b / 255;
-  const max = Math.max(rN, gN, bN);
+  const max = Math.min(rN, gN, bN);
   const min = Math.min(rN, gN, bN);
   const delta = max - min;

[Survived] MethodExpression
helpers/color/rgbToHsl.ts:42:15
   const gN = g / 255;
   const bN = b / 255;
   const max = Math.max(rN, gN, bN);
-  const min = Math.min(rN, gN, bN);
+  const min = Math.max(rN, gN, bN);
   const delta = max - min;
   const l = (max + min) / 2;

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:43:17
   const bN = b / 255;
   const max = Math.max(rN, gN, bN);
   const min = Math.min(rN, gN, bN);
-  const delta = max - min;
+  const delta = max + min;
   const l = (max + min) / 2;
 

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:44:13
   const max = Math.max(rN, gN, bN);
   const min = Math.min(rN, gN, bN);
   const delta = max - min;
-  const l = (max + min) / 2;
+  const l = (max + min) * 2;
 
   let h = 0;

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:44:14
   const max = Math.max(rN, gN, bN);
   const min = Math.min(rN, gN, bN);
   const delta = max - min;
-  const l = (max + min) / 2;
+  const l = (max - min) / 2;
 
   let h = 0;

[Survived] EqualityOperator
helpers/color/rgbToHsl.ts:48:7
 
   let h = 0;
   let s = 0;
-  if (delta !== 0) {
+  if (delta === 0) {
     s = delta / (1 - Math.abs(2 * l - 1));
     switch (max) {

[Survived] ConditionalExpression
helpers/color/rgbToHsl.ts:48:7
 
   let h = 0;
   let s = 0;
-  if (delta !== 0) {
+  if (false) {
     s = delta / (1 - Math.abs(2 * l - 1));
     switch (max) {

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:49:18
   let h = 0;
   let s = 0;
   if (delta !== 0) {
-    s = delta / (1 - Math.abs(2 * l - 1));
+    s = delta / (1 + Math.abs(2 * l - 1));
     switch (max) {
       case rN:

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:49:9
   let h = 0;
   let s = 0;
   if (delta !== 0) {
-    s = delta / (1 - Math.abs(2 * l - 1));
+    s = delta * (1 - Math.abs(2 * l - 1));
     switch (max) {
       case rN:

[Survived] ConditionalExpression
helpers/color/rgbToHsl.ts:51:7
   if (delta !== 0) {
     s = delta / (1 - Math.abs(2 * l - 1));
     switch (max) {
-      case rN:
-        h = 60 * (((gN - bN) / delta) % 6);
-        break;
+      case rN:
       case gN:
         h = 60 * ((bN - rN) / delta + 2);

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:52:19
     s = delta / (1 - Math.abs(2 * l - 1));
     switch (max) {
       case rN:
-        h = 60 * (((gN - bN) / delta) % 6);
+        h = 60 * ((gN - bN) / delta * 6);
         break;
       case gN:

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:52:13
     s = delta / (1 - Math.abs(2 * l - 1));
     switch (max) {
       case rN:
-        h = 60 * (((gN - bN) / delta) % 6);
+        h = 60 / ((gN - bN) / delta % 6);
         break;
       case gN:

[Survived] ConditionalExpression
helpers/color/rgbToHsl.ts:54:7
       case rN:
         h = 60 * (((gN - bN) / delta) % 6);
         break;
-      case gN:
-        h = 60 * ((bN - rN) / delta + 2);
-        break;
+      case gN:
       default:
         h = 60 * ((rN - gN) / delta + 4);

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:55:19
         h = 60 * (((gN - bN) / delta) % 6);
         break;
       case gN:
-        h = 60 * ((bN - rN) / delta + 2);
+        h = 60 * ((bN - rN) / delta - 2);
         break;
       default:

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:55:20
         h = 60 * (((gN - bN) / delta) % 6);
         break;
       case gN:
-        h = 60 * ((bN - rN) / delta + 2);
+        h = 60 * ((bN + rN) / delta + 2);
         break;
       default:

[Survived] ConditionalExpression
helpers/color/rgbToHsl.ts:57:7
       case gN:
         h = 60 * ((bN - rN) / delta + 2);
         break;
-      default:
-        h = 60 * ((rN - gN) / delta + 4);
-        break;
+      default:
     }
   }

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:58:13
         h = 60 * ((bN - rN) / delta + 2);
         break;
       default:
-        h = 60 * ((rN - gN) / delta + 4);
+        h = 60 / ((rN - gN) / delta + 4);
         break;
     }

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:58:19
         h = 60 * ((bN - rN) / delta + 2);
         break;
       default:
-        h = 60 * ((rN - gN) / delta + 4);
+        h = 60 * ((rN - gN) / delta - 4);
         break;
     }

[Survived] AssignmentOperator
helpers/color/rgbToHsl.ts:62:14
         break;
     }
   }
-  if (h < 0) h += 360;
+  if (h < 0) h -= 360;
 
   return { h: roundTo(h, 1), s: roundTo(s * 100, 1), l: roundTo(l * 100, 1), a };

[Survived] ConditionalExpression
helpers/color/rgbToHsl.ts:62:7
         break;
     }
   }
-  if (h < 0) h += 360;
+  if (false) h += 360;
 
   return { h: roundTo(h, 1), s: roundTo(s * 100, 1), l: roundTo(l * 100, 1), a };

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:64:65
   }
   if (h < 0) h += 360;
 
-  return { h: roundTo(h, 1), s: roundTo(s * 100, 1), l: roundTo(l * 100, 1), a };
+  return { h: roundTo(h, 1), s: roundTo(s * 100, 1), l: roundTo(l / 100, 1), a };
 }
 

[Survived] ArithmeticOperator
helpers/color/rgbToHsl.ts:64:41
   }
   if (h < 0) h += 360;
 
-  return { h: roundTo(h, 1), s: roundTo(s * 100, 1), l: roundTo(l * 100, 1), a };
+  return { h: roundTo(h, 1), s: roundTo(s / 100, 1), l: roundTo(l * 100, 1), a };
 }
 
