[Killed] EqualityOperator
helpers/date/timestamp.ts:19:10
 export function isTimestampInSeconds(timestamp: number): boolean {
   // Timestamps before year 2001 in milliseconds are less than 10^10
   // Use Math.abs to correctly handle negative timestamps (before epoch)
-  return Math.abs(timestamp) < 10000000000;
+  return Math.abs(timestamp) <= 10000000000;
 }
 
killedBy: toSeconds handles negative (pre-epoch)
statusReason: Property failed after 57 tests
{ seed: 1286241162, path: "56", endOnFailure: true }
Counterexample: [10000000000]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/timestamp.ts:19:10
 export function isTimestampInSeconds(timestamp: number): boolean {
   // Timestamps before year 2001 in milliseconds are less than 10^10
   // Use Math.abs to correctly handle negative timestamps (before epoch)
-  return Math.abs(timestamp) < 10000000000;
+  return true;
 }
 
killedBy: startOf month should preserve month and year
statusReason: expected [] to have a length of 3 but got +0
