[Survived] CallExpression
helpers/function/debounce.ts:22:7
 
   return (...args: A) => {
     if (timeoutId) {
-      clearTimeout(timeoutId);
+      ;
     }
     timeoutId = setTimeout(() => func(...args), delay);
