[Survived] BlockStatement
helpers/guard/isAsyncGenerator.ts:23:102
  * @see {@link isAsyncGeneratorFunction}
  * @since 2.0.3
  */
-export function isAsyncGenerator(value: unknown): value is AsyncGenerator<unknown, unknown, unknown> {
-  return Object.prototype.toString.call(value) === '[object AsyncGenerator]';
-}
+export function isAsyncGenerator(value: unknown): value is AsyncGenerator<unknown, unknown, unknown> {}
 

[Survived] EqualityOperator
helpers/guard/isAsyncGenerator.ts:24:10
  * @since 2.0.3
  */
 export function isAsyncGenerator(value: unknown): value is AsyncGenerator<unknown, unknown, unknown> {
-  return Object.prototype.toString.call(value) === '[object AsyncGenerator]';
+  return Object.prototype.toString.call(value) !== '[object AsyncGenerator]';
 }
 

[Survived] ConditionalExpression
helpers/guard/isAsyncGenerator.ts:24:10
  * @since 2.0.3
  */
 export function isAsyncGenerator(value: unknown): value is AsyncGenerator<unknown, unknown, unknown> {
-  return Object.prototype.toString.call(value) === '[object AsyncGenerator]';
+  return false;
 }
 
