[Survived] EqualityOperator
helpers/guard/isBlob.ts:22:10
  * @since 2.0.0
  */
 export function isBlob(value: unknown): value is Blob {
-  return typeof Blob !== 'undefined' && value instanceof Blob;
+  return typeof Blob === 'undefined' && value instanceof Blob;
 }
 

[Survived] ConditionalExpression
helpers/guard/isBlob.ts:22:10
  * @since 2.0.0
  */
 export function isBlob(value: unknown): value is Blob {
-  return typeof Blob !== 'undefined' && value instanceof Blob;
+  return false;
 }
 
