[Survived] ConditionalExpression
helpers/guard/isFormData.ts:22:10
  * @since 2.0.0
  */
 export function isFormData(value: unknown): value is FormData {
-  return typeof FormData !== 'undefined' && value instanceof FormData;
+  return true && value instanceof FormData;
 }
 
