[Survived] ConditionalExpression
helpers/guard/isIterable.ts:25:7
  * @since 2.0.0
  */
 export function isIterable(value: unknown): value is Iterable<unknown> {
-  if (value === null || value === undefined) return false;
+  if (true) return false;
   return typeof (value as Iterable<unknown>)[Symbol.iterator] === 'function';
 }

[Survived] EqualityOperator
helpers/guard/isIterable.ts:25:7
  * @since 2.0.0
  */
 export function isIterable(value: unknown): value is Iterable<unknown> {
-  if (value === null || value === undefined) return false;
+  if (value !== null || value === undefined) return false;
   return typeof (value as Iterable<unknown>)[Symbol.iterator] === 'function';
 }
