[Survived] BlockStatement
helpers/guard/isJSONValue.ts:9:65
 
 import { isPlainObject } from './isPlainObject';
 
-function transform(value: unknown, seen: Set<unknown>): boolean {
-  if (value === null) return true;
-  if (typeof value === 'string' || typeof value === 'boolean') return true;
-  if (typeof value === 'number') return Number.isFinite(value);
-  if (Array.isArray(value) || isPlainObject(value)) {
-    // A real JSON.stringify/parse round-trip never terminates on a cycle, so treat one as
-    // invalid rather than recursing forever. Popped after this node's subtree is fully
-    // checked, so a value referenced twice without a cycle (a shared, non-circular node) is
-    // still valid.
-    if (seen.has(value)) return false;
-    seen.add(value);
-    try {
-      const items = Array.isArray(value) ? value : Object.values(value);
-      return items.every((item) => transform(item, seen));
-    } finally {
-      seen.delete(value);
-    }
-  }
-  return false;
-}
+function transform(value: unknown, seen: Set<unknown>): boolean {}
 
 /**

[Survived] ConditionalExpression
helpers/guard/isJSONValue.ts:10:7
 import { isPlainObject } from './isPlainObject';
 
 function transform(value: unknown, seen: Set<unknown>): boolean {
-  if (value === null) return true;
+  if (true) return true;
   if (typeof value === 'string' || typeof value === 'boolean') return true;
   if (typeof value === 'number') return Number.isFinite(value);

[Survived] EqualityOperator
helpers/guard/isJSONValue.ts:10:7
 import { isPlainObject } from './isPlainObject';
 
 function transform(value: unknown, seen: Set<unknown>): boolean {
-  if (value === null) return true;
+  if (value !== null) return true;
   if (typeof value === 'string' || typeof value === 'boolean') return true;
   if (typeof value === 'number') return Number.isFinite(value);

[Survived] ConditionalExpression
helpers/guard/isJSONValue.ts:11:36
 
 function transform(value: unknown, seen: Set<unknown>): boolean {
   if (value === null) return true;
-  if (typeof value === 'string' || typeof value === 'boolean') return true;
+  if (typeof value === 'string' || false) return true;
   if (typeof value === 'number') return Number.isFinite(value);
   if (Array.isArray(value) || isPlainObject(value)) {

[Survived] ConditionalExpression
helpers/guard/isJSONValue.ts:11:7
 
 function transform(value: unknown, seen: Set<unknown>): boolean {
   if (value === null) return true;
-  if (typeof value === 'string' || typeof value === 'boolean') return true;
+  if (true) return true;
   if (typeof value === 'number') return Number.isFinite(value);
   if (Array.isArray(value) || isPlainObject(value)) {

[Survived] ConditionalExpression
helpers/guard/isJSONValue.ts:12:7
 function transform(value: unknown, seen: Set<unknown>): boolean {
   if (value === null) return true;
   if (typeof value === 'string' || typeof value === 'boolean') return true;
-  if (typeof value === 'number') return Number.isFinite(value);
+  if (true) return Number.isFinite(value);
   if (Array.isArray(value) || isPlainObject(value)) {
     // A real JSON.stringify/parse round-trip never terminates on a cycle, so treat one as

[Survived] EqualityOperator
helpers/guard/isJSONValue.ts:12:7
 function transform(value: unknown, seen: Set<unknown>): boolean {
   if (value === null) return true;
   if (typeof value === 'string' || typeof value === 'boolean') return true;
-  if (typeof value === 'number') return Number.isFinite(value);
+  if (typeof value !== 'number') return Number.isFinite(value);
   if (Array.isArray(value) || isPlainObject(value)) {
     // A real JSON.stringify/parse round-trip never terminates on a cycle, so treat one as

[Survived] BlockStatement
helpers/guard/isJSONValue.ts:13:53
   if (value === null) return true;
   if (typeof value === 'string' || typeof value === 'boolean') return true;
   if (typeof value === 'number') return Number.isFinite(value);
-  if (Array.isArray(value) || isPlainObject(value)) {
-    // A real JSON.stringify/parse round-trip never terminates on a cycle, so treat one as
-    // invalid rather than recursing forever. Popped after this node's subtree is fully
-    // checked, so a value referenced twice without a cycle (a shared, non-circular node) is
-    // still valid.
-    if (seen.has(value)) return false;
-    seen.add(value);
-    try {
-      const items = Array.isArray(value) ? value : Object.values(value);
-      return items.every((item) => transform(item, seen));
-    } finally {
-      seen.delete(value);
-    }
-  }
+  if (Array.isArray(value) || isPlainObject(value)) {}
   return false;
 }

[Survived] ConditionalExpression
helpers/guard/isJSONValue.ts:13:7
   if (value === null) return true;
   if (typeof value === 'string' || typeof value === 'boolean') return true;
   if (typeof value === 'number') return Number.isFinite(value);
-  if (Array.isArray(value) || isPlainObject(value)) {
+  if (false) {
     // A real JSON.stringify/parse round-trip never terminates on a cycle, so treat one as
     // invalid rather than recursing forever. Popped after this node's subtree is fully

[Survived] BooleanLiteral
helpers/guard/isJSONValue.ts:18:33
     // invalid rather than recursing forever. Popped after this node's subtree is fully
     // checked, so a value referenced twice without a cycle (a shared, non-circular node) is
     // still valid.
-    if (seen.has(value)) return false;
+    if (seen.has(value)) return true;
     seen.add(value);
     try {

[Survived] ConditionalExpression
helpers/guard/isJSONValue.ts:18:9
     // invalid rather than recursing forever. Popped after this node's subtree is fully
     // checked, so a value referenced twice without a cycle (a shared, non-circular node) is
     // still valid.
-    if (seen.has(value)) return false;
+    if (false) return false;
     seen.add(value);
     try {

[Survived] CallExpression
helpers/guard/isJSONValue.ts:19:5
     // checked, so a value referenced twice without a cycle (a shared, non-circular node) is
     // still valid.
     if (seen.has(value)) return false;
-    seen.add(value);
+    ;
     try {
       const items = Array.isArray(value) ? value : Object.values(value);

[Survived] BlockStatement
helpers/guard/isJSONValue.ts:20:9
     // still valid.
     if (seen.has(value)) return false;
     seen.add(value);
-    try {
-      const items = Array.isArray(value) ? value : Object.values(value);
-      return items.every((item) => transform(item, seen));
-    } finally {
+    try {} finally {
       seen.delete(value);
     }

[Survived] ArrowFunction
helpers/guard/isJSONValue.ts:22:26
     seen.add(value);
     try {
       const items = Array.isArray(value) ? value : Object.values(value);
-      return items.every((item) => transform(item, seen));
+      return items.every(() => undefined);
     } finally {
       seen.delete(value);

[Survived] MethodExpression
helpers/guard/isJSONValue.ts:22:14
     seen.add(value);
     try {
       const items = Array.isArray(value) ? value : Object.values(value);
-      return items.every((item) => transform(item, seen));
+      return items.some(item => transform(item, seen));
     } finally {
       seen.delete(value);

[Survived] BlockStatement
helpers/guard/isJSONValue.ts:23:15
     try {
       const items = Array.isArray(value) ? value : Object.values(value);
       return items.every((item) => transform(item, seen));
-    } finally {
-      seen.delete(value);
-    }
+    } finally {}
   }
   return false;

[Survived] CallExpression
helpers/guard/isJSONValue.ts:24:7
       const items = Array.isArray(value) ? value : Object.values(value);
       return items.every((item) => transform(item, seen));
     } finally {
-      seen.delete(value);
+      ;
     }
   }

[Survived] BlockStatement
helpers/guard/isJSONValue.ts:46:54
  * isJSONValue(Number.NaN)                             // => false
  * @since 3.0.3
  */
-export function isJSONValue(value: unknown): boolean {
-  return transform(value, new Set());
-}
+export function isJSONValue(value: unknown): boolean {}
 
