[Survived] ConditionalExpression
helpers/guard/isPrimitive.ts:29:29
  * @since 2.0.0
  */
 export function isPrimitive(value: unknown): value is Primitive {
-  return value === null || (typeof value !== 'object' && typeof value !== 'function');
+  return value === null || (false);
 }
 
