[Survived] ConditionalExpression
helpers/guard/isSymbol.ts:18:10
  * @since 2.0.0
  */
 export function isSymbol(value: unknown): value is symbol {
-  return typeof value === 'symbol';
+  return false;
 }
 
