[Survived] BlockStatement
helpers/guard/isTemporalPlainDateTime.ts:22:40
  * @since 2.0.0
  */
 export function isTemporalPlainDateTime(value: unknown): value is Temporal.PlainDateTime {
-  if (typeof Temporal !== 'undefined') {
-    return value instanceof Temporal.PlainDateTime;
-  }
+  if (typeof Temporal !== 'undefined') {}
   return (
     typeof value === 'object' &&

[Survived] ConditionalExpression
helpers/guard/isTemporalPlainDateTime.ts:26:5
     return value instanceof Temporal.PlainDateTime;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDateTime'
+    true
   );
 }
