[Survived] BlockStatement
helpers/guard/isWeakMapKey.ts:29:72
  * isWeakMapKey(42)              // => false
  * @since 3.0.8
  */
-export function isWeakMapKey(value: unknown): value is object | symbol {
-  if (typeof value === 'object') return value !== null;
-  if (typeof value === 'function') return true;
-  if (typeof value === 'symbol') return Symbol.keyFor(value) === undefined;
-  return false;
-}
+export function isWeakMapKey(value: unknown): value is object | symbol {}
 

[Survived] ConditionalExpression
helpers/guard/isWeakMapKey.ts:30:7
  * @since 3.0.8
  */
 export function isWeakMapKey(value: unknown): value is object | symbol {
-  if (typeof value === 'object') return value !== null;
+  if (false) return value !== null;
   if (typeof value === 'function') return true;
   if (typeof value === 'symbol') return Symbol.keyFor(value) === undefined;

[Survived] EqualityOperator
helpers/guard/isWeakMapKey.ts:30:41
  * @since 3.0.8
  */
 export function isWeakMapKey(value: unknown): value is object | symbol {
-  if (typeof value === 'object') return value !== null;
+  if (typeof value === 'object') return value === null;
   if (typeof value === 'function') return true;
   if (typeof value === 'symbol') return Symbol.keyFor(value) === undefined;

[Survived] ConditionalExpression
helpers/guard/isWeakMapKey.ts:31:7
  */
 export function isWeakMapKey(value: unknown): value is object | symbol {
   if (typeof value === 'object') return value !== null;
-  if (typeof value === 'function') return true;
+  if (false) return true;
   if (typeof value === 'symbol') return Symbol.keyFor(value) === undefined;
   return false;

[Survived] BooleanLiteral
helpers/guard/isWeakMapKey.ts:31:43
  */
 export function isWeakMapKey(value: unknown): value is object | symbol {
   if (typeof value === 'object') return value !== null;
-  if (typeof value === 'function') return true;
+  if (typeof value === 'function') return false;
   if (typeof value === 'symbol') return Symbol.keyFor(value) === undefined;
   return false;

[Survived] ConditionalExpression
helpers/guard/isWeakMapKey.ts:32:41
 export function isWeakMapKey(value: unknown): value is object | symbol {
   if (typeof value === 'object') return value !== null;
   if (typeof value === 'function') return true;
-  if (typeof value === 'symbol') return Symbol.keyFor(value) === undefined;
+  if (typeof value === 'symbol') return false;
   return false;
 }

[Survived] EqualityOperator
helpers/guard/isWeakMapKey.ts:32:41
 export function isWeakMapKey(value: unknown): value is object | symbol {
   if (typeof value === 'object') return value !== null;
   if (typeof value === 'function') return true;
-  if (typeof value === 'symbol') return Symbol.keyFor(value) === undefined;
+  if (typeof value === 'symbol') return Symbol.keyFor(value) !== undefined;
   return false;
 }

[Survived] BooleanLiteral
helpers/guard/isWeakMapKey.ts:33:10
   if (typeof value === 'object') return value !== null;
   if (typeof value === 'function') return true;
   if (typeof value === 'symbol') return Symbol.keyFor(value) === undefined;
-  return false;
+  return true;
 }
 
