[Survived] BlockStatement
helpers/license/agree.ts:29:54
  * // => true (a vague claim is never itself a conflict)
  * @since 3.1.2
  */
-export function agree(a: string, b: string): boolean {
-  const knownA = new Set([...families(a)].filter((f) => f !== UNKNOWN_FAMILY));
-  const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
-
-  if (knownA.size === 0 || knownB.size === 0) return true;
-  for (const family of knownA) if (knownB.has(family)) return true;
-  return false;
-}
+export function agree(a: string, b: string): boolean {}
 

[Survived] ArrowFunction
helpers/license/agree.ts:30:50
  * @since 3.1.2
  */
 export function agree(a: string, b: string): boolean {
-  const knownA = new Set([...families(a)].filter((f) => f !== UNKNOWN_FAMILY));
+  const knownA = new Set([...families(a)].filter(() => undefined));
   const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
 

[Survived] ConditionalExpression
helpers/license/agree.ts:30:57
  * @since 3.1.2
  */
 export function agree(a: string, b: string): boolean {
-  const knownA = new Set([...families(a)].filter((f) => f !== UNKNOWN_FAMILY));
+  const knownA = new Set([...families(a)].filter((f) => false));
   const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
 

[Survived] ConditionalExpression
helpers/license/agree.ts:31:57
  */
 export function agree(a: string, b: string): boolean {
   const knownA = new Set([...families(a)].filter((f) => f !== UNKNOWN_FAMILY));
-  const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
+  const knownB = new Set([...families(b)].filter((f) => true));
 
   if (knownA.size === 0 || knownB.size === 0) return true;

[Survived] EqualityOperator
helpers/license/agree.ts:31:57
  */
 export function agree(a: string, b: string): boolean {
   const knownA = new Set([...families(a)].filter((f) => f !== UNKNOWN_FAMILY));
-  const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
+  const knownB = new Set([...families(b)].filter((f) => f === UNKNOWN_FAMILY));
 
   if (knownA.size === 0 || knownB.size === 0) return true;

[Survived] ConditionalExpression
helpers/license/agree.ts:33:7
   const knownA = new Set([...families(a)].filter((f) => f !== UNKNOWN_FAMILY));
   const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
 
-  if (knownA.size === 0 || knownB.size === 0) return true;
+  if (false) return true;
   for (const family of knownA) if (knownB.has(family)) return true;
   return false;

[Survived] ConditionalExpression
helpers/license/agree.ts:33:7
   const knownA = new Set([...families(a)].filter((f) => f !== UNKNOWN_FAMILY));
   const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
 
-  if (knownA.size === 0 || knownB.size === 0) return true;
+  if (false || knownB.size === 0) return true;
   for (const family of knownA) if (knownB.has(family)) return true;
   return false;

[Survived] BooleanLiteral
helpers/license/agree.ts:34:63
   const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
 
   if (knownA.size === 0 || knownB.size === 0) return true;
-  for (const family of knownA) if (knownB.has(family)) return true;
+  for (const family of knownA) if (knownB.has(family)) return false;
   return false;
 }

[Survived] ConditionalExpression
helpers/license/agree.ts:34:36
   const knownB = new Set([...families(b)].filter((f) => f !== UNKNOWN_FAMILY));
 
   if (knownA.size === 0 || knownB.size === 0) return true;
-  for (const family of knownA) if (knownB.has(family)) return true;
+  for (const family of knownA) if (true) return true;
   return false;
 }

[Survived] BooleanLiteral
helpers/license/agree.ts:35:10
 
   if (knownA.size === 0 || knownB.size === 0) return true;
   for (const family of knownA) if (knownB.has(family)) return true;
-  return false;
+  return true;
 }
 
