[Survived] BlockStatement
helpers/map/every.ts:20:12
 export function every<K, V>(
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
-): boolean {
-  for (const [key, value] of map) {
-    if (!predicate(value, key)) return false;
-  }
-  return true;
-}
+): boolean {}
 

[Survived] BlockStatement
helpers/map/every.ts:21:35
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
 ): boolean {
-  for (const [key, value] of map) {
-    if (!predicate(value, key)) return false;
-  }
+  for (const [key, value] of map) {}
   return true;
 }

[Survived] BooleanLiteral
helpers/map/every.ts:22:40
   predicate: (value: V, key: K) => boolean,
 ): boolean {
   for (const [key, value] of map) {
-    if (!predicate(value, key)) return false;
+    if (!predicate(value, key)) return true;
   }
   return true;

[Survived] ConditionalExpression
helpers/map/every.ts:22:9
   predicate: (value: V, key: K) => boolean,
 ): boolean {
   for (const [key, value] of map) {
-    if (!predicate(value, key)) return false;
+    if (false) return false;
   }
   return true;
