[Survived] BlockStatement
helpers/map/hasValue.ts:18:75
  * // => true
  * @since 3.0.3
  */
-export function hasValue<K, V>(map: ReadonlyMap<K, V>, value: V): boolean {
-  for (const v of map.values()) {
-    if (Object.is(v, value)) return true;
-  }
-  return false;
-}
+export function hasValue<K, V>(map: ReadonlyMap<K, V>, value: V): boolean {}
 

[Survived] BlockStatement
helpers/map/hasValue.ts:19:33
  * @since 3.0.3
  */
 export function hasValue<K, V>(map: ReadonlyMap<K, V>, value: V): boolean {
-  for (const v of map.values()) {
-    if (Object.is(v, value)) return true;
-  }
+  for (const v of map.values()) {}
   return false;
 }

[Survived] ConditionalExpression
helpers/map/hasValue.ts:20:9
  */
 export function hasValue<K, V>(map: ReadonlyMap<K, V>, value: V): boolean {
   for (const v of map.values()) {
-    if (Object.is(v, value)) return true;
+    if (false) return true;
   }
   return false;

[Survived] BooleanLiteral
helpers/map/hasValue.ts:20:37
  */
 export function hasValue<K, V>(map: ReadonlyMap<K, V>, value: V): boolean {
   for (const v of map.values()) {
-    if (Object.is(v, value)) return true;
+    if (Object.is(v, value)) return false;
   }
   return false;
