[Survived] BlockStatement
helpers/map/some.ts:20:12
 export function some<K, V>(
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
-): boolean {
-  for (const [key, value] of map) {
-    if (predicate(value, key)) return true;
-  }
-  return false;
-}
+): boolean {}
 

[Survived] BlockStatement
helpers/map/some.ts:21:35
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
 ): boolean {
-  for (const [key, value] of map) {
-    if (predicate(value, key)) return true;
-  }
+  for (const [key, value] of map) {}
   return false;
 }

[Survived] BooleanLiteral
helpers/map/some.ts:22:39
   predicate: (value: V, key: K) => boolean,
 ): boolean {
   for (const [key, value] of map) {
-    if (predicate(value, key)) return true;
+    if (predicate(value, key)) return false;
   }
   return false;

[Survived] ConditionalExpression
helpers/map/some.ts:22:9
   predicate: (value: V, key: K) => boolean,
 ): boolean {
   for (const [key, value] of map) {
-    if (predicate(value, key)) return true;
+    if (false) return true;
   }
   return false;
