[Killed] ConditionalExpression
helpers/node/isBuffer.ts:26:10
  * @since 2.0.0
  */
 export function isBuffer(value: unknown): value is Buffer {
-  return typeof Buffer !== 'undefined' && value instanceof Buffer;
+  return true;
 }
 
killedBy: compact should remove null and undefined values
statusReason: Property failed after 1 tests
{ seed: 20803890, path: "0", endOnFailure: true }
Counterexample: [false]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
