[Survived] BlockStatement
helpers/node/withTempDir.ts:26:103
  * // => 'data' (the directory no longer exists once this resolves)
  * @since 3.1.1
  */
-export async function withTempDir<T>(prefix: string, fn: (dir: string) => T | Promise<T>): Promise<T> {
-  const dir = await mkdtemp(join(tmpdir(), `${prefix}-`));
-  try {
-    return await fn(dir);
-  } finally {
-    await rm(dir, { recursive: true, force: true });
-  }
-}
+export async function withTempDir<T>(prefix: string, fn: (dir: string) => T | Promise<T>): Promise<T> {}
 

[Survived] BlockStatement
helpers/node/withTempDir.ts:28:7
  */
 export async function withTempDir<T>(prefix: string, fn: (dir: string) => T | Promise<T>): Promise<T> {
   const dir = await mkdtemp(join(tmpdir(), `${prefix}-`));
-  try {
-    return await fn(dir);
-  } finally {
+  try {} finally {
     await rm(dir, { recursive: true, force: true });
   }

[Survived] BlockStatement
helpers/node/withTempDir.ts:30:13
   const dir = await mkdtemp(join(tmpdir(), `${prefix}-`));
   try {
     return await fn(dir);
-  } finally {
-    await rm(dir, { recursive: true, force: true });
-  }
+  } finally {}
 }
 

[Survived] BooleanLiteral
helpers/node/withTempDir.ts:31:45
   try {
     return await fn(dir);
   } finally {
-    await rm(dir, { recursive: true, force: true });
+    await rm(dir, { recursive: true, force: false });
   }
 }

[Survived] BooleanLiteral
helpers/node/withTempDir.ts:31:32
   try {
     return await fn(dir);
   } finally {
-    await rm(dir, { recursive: true, force: true });
+    await rm(dir, { recursive: false, force: true });
   }
 }
