[Survived] BlockStatement
helpers/number/isNegative.ts:23:61
  * isNegative(NaN)       // => false
  * @since 2.0.0
  */
-export function isNegative(value: unknown): value is number {
-  return typeof value === 'number' && value < 0;
-}
+export function isNegative(value: unknown): value is number {}
 

[Survived] ConditionalExpression
helpers/number/isNegative.ts:24:10
  * @since 2.0.0
  */
 export function isNegative(value: unknown): value is number {
-  return typeof value === 'number' && value < 0;
+  return true;
 }
 

[Survived] ConditionalExpression
helpers/number/isNegative.ts:24:10
  * @since 2.0.0
  */
 export function isNegative(value: unknown): value is number {
-  return typeof value === 'number' && value < 0;
+  return true && value < 0;
 }
 
