[Survived] BlockStatement
helpers/object/clone.ts:30:39
  * clone([1, 2, 3])              // => new array, same elements
  * @since 3.0.0
  */
-export function clone<T>(value: T): T {
-  if (value === null || typeof value !== 'object') return value;
-  if (value instanceof Date) return new Date(value.getTime()) as T;
-  if (value instanceof Map) return new Map(value) as T;
-  if (value instanceof Set) return new Set(value) as T;
-  if (Array.isArray(value)) return [...value] as T;
-
-  const result: Record<string, unknown> = {};
-  for (const key of Object.keys(value)) {
-    if (!UNSAFE_KEYS.has(key)) {
-      result[key] = (value as Record<string, unknown>)[key];
-    }
-  }
-  return result as T;
-}
+export function clone<T>(value: T): T {}
 

[Survived] ConditionalExpression
helpers/object/clone.ts:31:7
  * @since 3.0.0
  */
 export function clone<T>(value: T): T {
-  if (value === null || typeof value !== 'object') return value;
+  if (false) return value;
   if (value instanceof Date) return new Date(value.getTime()) as T;
   if (value instanceof Map) return new Map(value) as T;

[Survived] ConditionalExpression
helpers/object/clone.ts:31:7
  * @since 3.0.0
  */
 export function clone<T>(value: T): T {
-  if (value === null || typeof value !== 'object') return value;
+  if (false || typeof value !== 'object') return value;
   if (value instanceof Date) return new Date(value.getTime()) as T;
   if (value instanceof Map) return new Map(value) as T;

[Survived] ConditionalExpression
helpers/object/clone.ts:32:7
  */
 export function clone<T>(value: T): T {
   if (value === null || typeof value !== 'object') return value;
-  if (value instanceof Date) return new Date(value.getTime()) as T;
+  if (false) return new Date(value.getTime()) as T;
   if (value instanceof Map) return new Map(value) as T;
   if (value instanceof Set) return new Set(value) as T;

[Survived] ConditionalExpression
helpers/object/clone.ts:32:7
  */
 export function clone<T>(value: T): T {
   if (value === null || typeof value !== 'object') return value;
-  if (value instanceof Date) return new Date(value.getTime()) as T;
+  if (true) return new Date(value.getTime()) as T;
   if (value instanceof Map) return new Map(value) as T;
   if (value instanceof Set) return new Set(value) as T;

[Survived] ConditionalExpression
helpers/object/clone.ts:33:7
 export function clone<T>(value: T): T {
   if (value === null || typeof value !== 'object') return value;
   if (value instanceof Date) return new Date(value.getTime()) as T;
-  if (value instanceof Map) return new Map(value) as T;
+  if (false) return new Map(value) as T;
   if (value instanceof Set) return new Set(value) as T;
   if (Array.isArray(value)) return [...value] as T;

[Survived] ConditionalExpression
helpers/object/clone.ts:33:7
 export function clone<T>(value: T): T {
   if (value === null || typeof value !== 'object') return value;
   if (value instanceof Date) return new Date(value.getTime()) as T;
-  if (value instanceof Map) return new Map(value) as T;
+  if (true) return new Map(value) as T;
   if (value instanceof Set) return new Set(value) as T;
   if (Array.isArray(value)) return [...value] as T;

[Survived] ConditionalExpression
helpers/object/clone.ts:34:7
   if (value === null || typeof value !== 'object') return value;
   if (value instanceof Date) return new Date(value.getTime()) as T;
   if (value instanceof Map) return new Map(value) as T;
-  if (value instanceof Set) return new Set(value) as T;
+  if (true) return new Set(value) as T;
   if (Array.isArray(value)) return [...value] as T;
 

[Survived] ConditionalExpression
helpers/object/clone.ts:34:7
   if (value === null || typeof value !== 'object') return value;
   if (value instanceof Date) return new Date(value.getTime()) as T;
   if (value instanceof Map) return new Map(value) as T;
-  if (value instanceof Set) return new Set(value) as T;
+  if (false) return new Set(value) as T;
   if (Array.isArray(value)) return [...value] as T;
 

[Survived] ConditionalExpression
helpers/object/clone.ts:35:7
   if (value instanceof Date) return new Date(value.getTime()) as T;
   if (value instanceof Map) return new Map(value) as T;
   if (value instanceof Set) return new Set(value) as T;
-  if (Array.isArray(value)) return [...value] as T;
+  if (false) return [...value] as T;
 
   const result: Record<string, unknown> = {};

[Survived] ConditionalExpression
helpers/object/clone.ts:35:7
   if (value instanceof Date) return new Date(value.getTime()) as T;
   if (value instanceof Map) return new Map(value) as T;
   if (value instanceof Set) return new Set(value) as T;
-  if (Array.isArray(value)) return [...value] as T;
+  if (true) return [...value] as T;
 
   const result: Record<string, unknown> = {};

[Survived] BlockStatement
helpers/object/clone.ts:38:41
   if (Array.isArray(value)) return [...value] as T;
 
   const result: Record<string, unknown> = {};
-  for (const key of Object.keys(value)) {
-    if (!UNSAFE_KEYS.has(key)) {
-      result[key] = (value as Record<string, unknown>)[key];
-    }
-  }
+  for (const key of Object.keys(value)) {}
   return result as T;
 }

[Survived] ConditionalExpression
helpers/object/clone.ts:39:9
 
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(value)) {
-    if (!UNSAFE_KEYS.has(key)) {
+    if (true) {
       result[key] = (value as Record<string, unknown>)[key];
     }

[Survived] ConditionalExpression
helpers/object/clone.ts:39:9
 
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(value)) {
-    if (!UNSAFE_KEYS.has(key)) {
+    if (false) {
       result[key] = (value as Record<string, unknown>)[key];
     }
