[Survived] BlockStatement
helpers/object/groupBy.ts:31:28
 export function groupBy<T, K extends PropertyKey>(
   items: readonly T[] | null | undefined,
   keyFn: (item: T) => K
-): Partial<Record<K, T[]>> {
-  const result = {} as Partial<Record<K, T[]>>;
-  if (items == null) return result;
-  for (const item of items) {
-    const key = keyFn(item);
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    if (result[key] === undefined) {
-      result[key] = [];
-    }
-    (result[key] as T[]).push(item);
-  }
-  return result;
-}
+): Partial<Record<K, T[]>> {}
 

[Survived] EqualityOperator
helpers/object/groupBy.ts:33:7
   keyFn: (item: T) => K
 ): Partial<Record<K, T[]>> {
   const result = {} as Partial<Record<K, T[]>>;
-  if (items == null) return result;
+  if (items != null) return result;
   for (const item of items) {
     const key = keyFn(item);

[Survived] ConditionalExpression
helpers/object/groupBy.ts:33:7
   keyFn: (item: T) => K
 ): Partial<Record<K, T[]>> {
   const result = {} as Partial<Record<K, T[]>>;
-  if (items == null) return result;
+  if (true) return result;
   for (const item of items) {
     const key = keyFn(item);

[Survived] BlockStatement
helpers/object/groupBy.ts:34:29
 ): Partial<Record<K, T[]>> {
   const result = {} as Partial<Record<K, T[]>>;
   if (items == null) return result;
-  for (const item of items) {
-    const key = keyFn(item);
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    if (result[key] === undefined) {
-      result[key] = [];
-    }
-    (result[key] as T[]).push(item);
-  }
+  for (const item of items) {}
   return result;
 }

[Survived] EqualityOperator
helpers/object/groupBy.ts:36:9
   if (items == null) return result;
   for (const item of items) {
     const key = keyFn(item);
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
+    if (typeof key !== 'string' && UNSAFE_KEYS.has(key)) continue;
     if (result[key] === undefined) {
       result[key] = [];

[Survived] ConditionalExpression
helpers/object/groupBy.ts:36:9
   if (items == null) return result;
   for (const item of items) {
     const key = keyFn(item);
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
+    if (true) continue;
     if (result[key] === undefined) {
       result[key] = [];

[Survived] ConditionalExpression
helpers/object/groupBy.ts:37:9
   for (const item of items) {
     const key = keyFn(item);
     if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    if (result[key] === undefined) {
+    if (true) {
       result[key] = [];
     }

[Survived] ConditionalExpression
helpers/object/groupBy.ts:37:9
   for (const item of items) {
     const key = keyFn(item);
     if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    if (result[key] === undefined) {
+    if (false) {
       result[key] = [];
     }

[Survived] CallExpression
helpers/object/groupBy.ts:40:5
     if (result[key] === undefined) {
       result[key] = [];
     }
-    (result[key] as T[]).push(item);
+    ;
   }
   return result;
