[Survived] BlockStatement
helpers/object/kebabCaseKeys.ts:24:47
  * // => { 'user-name': 'Alice', 'home-address': { 'zip-code': '12345' } }
  * @since 3.0.3
  */
-export function kebabCaseKeys<T>(value: T): T {
-  return mapDeep(value, undefined, kebabCase);
-}
+export function kebabCaseKeys<T>(value: T): T {}
 
