[Survived] BlockStatement
helpers/object/pick.ts:27:34
 export function pick<T extends Record<string, unknown>, K extends keyof T>(
   obj: T | undefined | null,
   keys: readonly K[]
-): Pick<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
-  const result = {} as Pick<T, K>;
-  for (const key of keys) {
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
-      result[key] = obj[key];
-    }
-  }
-  return result;
-}
+): Pick<T, K> | undefined | null {}
 

[Killed] EqualityOperator
helpers/object/pick.ts:28:7
   obj: T | undefined | null,
   keys: readonly K[]
 ): Pick<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (obj !== undefined || obj === null) return obj;
   const result = {} as Pick<T, K>;
   for (const key of keys) {
killedBy: isArrayLike should return false for objects without length
statusReason: Property failed after 1 tests
{ seed: -2121164943, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":"","c":false},[]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/pick.ts:28:28
   obj: T | undefined | null,
   keys: readonly K[]
 ): Pick<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (obj === undefined || false) return obj;
   const result = {} as Pick<T, K>;
   for (const key of keys) {
killedBy: hslToRgb converts hue 60 (yellow)
statusReason: Cannot convert undefined or null to object

[Survived] BlockStatement
helpers/object/pick.ts:30:27
 ): Pick<T, K> | undefined | null {
   if (obj === undefined || obj === null) return obj;
   const result = {} as Pick<T, K>;
-  for (const key of keys) {
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
-      result[key] = obj[key];
-    }
-  }
+  for (const key of keys) {}
   return result;
 }

[Survived] ConditionalExpression
helpers/object/pick.ts:31:9
   if (obj === undefined || obj === null) return obj;
   const result = {} as Pick<T, K>;
   for (const key of keys) {
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
+    if (true) continue;
     if (Object.prototype.hasOwnProperty.call(obj, key)) {
       result[key] = obj[key];

[Survived] ConditionalExpression
helpers/object/pick.ts:31:9
   if (obj === undefined || obj === null) return obj;
   const result = {} as Pick<T, K>;
   for (const key of keys) {
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
+    if (true && UNSAFE_KEYS.has(key)) continue;
     if (Object.prototype.hasOwnProperty.call(obj, key)) {
       result[key] = obj[key];

[Killed] ConditionalExpression
helpers/object/pick.ts:32:9
   const result = {} as Pick<T, K>;
   for (const key of keys) {
     if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
+    if (true) {
       result[key] = obj[key];
     }
killedBy: hslToRgb converts hue 120 (green)
statusReason: expected { inherited: 99 } to deeply equal {}

[Killed] BlockStatement
helpers/object/pick.ts:32:57
   const result = {} as Pick<T, K>;
   for (const key of keys) {
     if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
-      result[key] = obj[key];
-    }
+    if (Object.prototype.hasOwnProperty.call(obj, key)) {}
   }
   return result;
killedBy: isArrayLike should return false for functions
statusReason: Property failed after 1 tests
{ seed: -852123493, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
