[Survived] BlockStatement
helpers/object/set.ts:60:88
   path: P,
   value: V,
 ): string extends P ? T : readonly PropertyKey[] extends P ? T : ContainsUnsafeStringKey<ParsePath<P>> extends true ? T : DeepSet<T, ParsePath<P>, V>;
-export function set(obj: object, path: string | PropertyKey[], value: unknown): object {
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
-
-  if (keys.length === 0) return obj;
-  if (keys.some((k) => typeof k === 'string' && UNSAFE_KEYS.has(k))) return obj;
-
-  let current = obj as Record<PropertyKey, unknown>;
-
-  for (let i = 0; i < keys.length - 1; i++) {
-    const key = keys[i];
-
-    // Object.hasOwn (not `key in current`) is intentional: `in` checks the prototype chain,
-    // which would silently traverse into — and potentially mutate — an inherited object.
-    // Using hasOwn ensures we only follow own properties; inherited intermediate nodes are
-    // shadowed with a fresh own `{}` instead of being followed into the prototype.
-    if (!Object.hasOwn(current, key) || typeof current[key] !== 'object' || current[key] === null) {
-      current[key] = {};
-    }
-
-    current = current[key] as Record<PropertyKey, unknown>;
-  }
-
-  current[keys[keys.length - 1]] = value;
-  return obj;
-}
+export function set(obj: object, path: string | PropertyKey[], value: unknown): object {}
 

[Survived] EqualityOperator
helpers/object/set.ts:61:40
   value: V,
 ): string extends P ? T : readonly PropertyKey[] extends P ? T : ContainsUnsafeStringKey<ParsePath<P>> extends true ? T : DeepSet<T, ParsePath<P>, V>;
 export function set(obj: object, path: string | PropertyKey[], value: unknown): object {
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
+  const keys: readonly PropertyKey[] = typeof path !== 'string' ? parsePropertyPath(path) : path;
 
   if (keys.length === 0) return obj;

[Survived] ConditionalExpression
helpers/object/set.ts:61:40
   value: V,
 ): string extends P ? T : readonly PropertyKey[] extends P ? T : ContainsUnsafeStringKey<ParsePath<P>> extends true ? T : DeepSet<T, ParsePath<P>, V>;
 export function set(obj: object, path: string | PropertyKey[], value: unknown): object {
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
+  const keys: readonly PropertyKey[] = true ? parsePropertyPath(path) : path;
 
   if (keys.length === 0) return obj;

[Survived] EqualityOperator
helpers/object/set.ts:63:7
 export function set(obj: object, path: string | PropertyKey[], value: unknown): object {
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
 
-  if (keys.length === 0) return obj;
+  if (keys.length !== 0) return obj;
   if (keys.some((k) => typeof k === 'string' && UNSAFE_KEYS.has(k))) return obj;
 

[Survived] ConditionalExpression
helpers/object/set.ts:63:7
 export function set(obj: object, path: string | PropertyKey[], value: unknown): object {
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
 
-  if (keys.length === 0) return obj;
+  if (false) return obj;
   if (keys.some((k) => typeof k === 'string' && UNSAFE_KEYS.has(k))) return obj;
 

[Survived] ArrowFunction
helpers/object/set.ts:64:17
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
 
   if (keys.length === 0) return obj;
-  if (keys.some((k) => typeof k === 'string' && UNSAFE_KEYS.has(k))) return obj;
+  if (keys.some(() => undefined)) return obj;
 
   let current = obj as Record<PropertyKey, unknown>;

[Survived] ConditionalExpression
helpers/object/set.ts:64:7
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
 
   if (keys.length === 0) return obj;
-  if (keys.some((k) => typeof k === 'string' && UNSAFE_KEYS.has(k))) return obj;
+  if (false) return obj;
 
   let current = obj as Record<PropertyKey, unknown>;

[Survived] ConditionalExpression
helpers/object/set.ts:68:19
 
   let current = obj as Record<PropertyKey, unknown>;
 
-  for (let i = 0; i < keys.length - 1; i++) {
+  for (let i = 0; false; i++) {
     const key = keys[i];
 

[Survived] ConditionalExpression
helpers/object/set.ts:75:41
     // which would silently traverse into — and potentially mutate — an inherited object.
     // Using hasOwn ensures we only follow own properties; inherited intermediate nodes are
     // shadowed with a fresh own `{}` instead of being followed into the prototype.
-    if (!Object.hasOwn(current, key) || typeof current[key] !== 'object' || current[key] === null) {
+    if (!Object.hasOwn(current, key) || false || current[key] === null) {
       current[key] = {};
     }

[Survived] EqualityOperator
helpers/object/set.ts:75:77
     // which would silently traverse into — and potentially mutate — an inherited object.
     // Using hasOwn ensures we only follow own properties; inherited intermediate nodes are
     // shadowed with a fresh own `{}` instead of being followed into the prototype.
-    if (!Object.hasOwn(current, key) || typeof current[key] !== 'object' || current[key] === null) {
+    if (!Object.hasOwn(current, key) || typeof current[key] !== 'object' || current[key] !== null) {
       current[key] = {};
     }
