[Survived] BlockStatement
helpers/object/unflatten.ts:25:82
  * // => { a: { b: { c: 1 }, d: 2 } }
  * @since 3.0.0
  */
-export function unflatten(obj: Record<string, unknown>): Record<string, unknown> {
-  const result: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(obj)) {
-    set(result, key, value);
-  }
-  return result;
-}
+export function unflatten(obj: Record<string, unknown>): Record<string, unknown> {}
 

[Survived] BlockStatement
helpers/object/unflatten.ts:27:51
  */
 export function unflatten(obj: Record<string, unknown>): Record<string, unknown> {
   const result: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(obj)) {
-    set(result, key, value);
-  }
+  for (const [key, value] of Object.entries(obj)) {}
   return result;
 }

[Survived] CallExpression
helpers/object/unflatten.ts:28:5
 export function unflatten(obj: Record<string, unknown>): Record<string, unknown> {
   const result: Record<string, unknown> = {};
   for (const [key, value] of Object.entries(obj)) {
-    set(result, key, value);
+    ;
   }
   return result;
