[Survived] StringLiteral
helpers/promise/createSemaphore.ts:69:55
  * @since 3.0.4
  */
 export function createSemaphore(permits: number): Semaphore {
-  const totalPermits = validatePositiveCount(permits, 'createSemaphore: permits');
+  const totalPermits = validatePositiveCount(permits, "");
 
   let available = totalPermits;

[Survived] ArrayDeclaration
helpers/promise/createSemaphore.ts:76:31
   // (O(n) per call, O(n²) draining a long queue) — under heavy contention (many more callers
   // than permits) that adds up. Advancing `queueHead` is O(1); the array is only compacted
   // once consumed slots build up, so the amortized cost per call stays O(1).
-  let queue: (() => void)[] = [];
+  let queue: (() => void)[] = ["Stryker was here"];
   let queueHead = 0;
 

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:79:46
   let queue: (() => void)[] = [];
   let queueHead = 0;
 
-  function enqueue(waiter: () => void): void {
-    queue.push(waiter);
-  }
+  function enqueue(waiter: () => void): void {}
 
   function dequeue(): (() => void) | undefined {

[Survived] CallExpression
helpers/promise/createSemaphore.ts:80:5
   let queueHead = 0;
 
   function enqueue(waiter: () => void): void {
-    queue.push(waiter);
+    ;
   }
 

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:83:48
     queue.push(waiter);
   }
 
-  function dequeue(): (() => void) | undefined {
-    if (queueHead >= queue.length) return undefined;
-    const waiter = queue[queueHead];
-    queue[queueHead] = undefined as unknown as () => void; // drop the reference for GC
-    queueHead++;
-    if (queueHead > 16 && queueHead * 2 >= queue.length) {
-      queue = queue.slice(queueHead);
-      queueHead = 0;
-    }
-    return waiter;
-  }
+  function dequeue(): (() => void) | undefined {}
 
   function createRelease(): Release {

[Survived] EqualityOperator
helpers/promise/createSemaphore.ts:84:9
   }
 
   function dequeue(): (() => void) | undefined {
-    if (queueHead >= queue.length) return undefined;
+    if (queueHead < queue.length) return undefined;
     const waiter = queue[queueHead];
     queue[queueHead] = undefined as unknown as () => void; // drop the reference for GC

[Survived] ConditionalExpression
helpers/promise/createSemaphore.ts:84:9
   }
 
   function dequeue(): (() => void) | undefined {
-    if (queueHead >= queue.length) return undefined;
+    if (true) return undefined;
     const waiter = queue[queueHead];
     queue[queueHead] = undefined as unknown as () => void; // drop the reference for GC

[Survived] UpdateOperator
helpers/promise/createSemaphore.ts:87:5
     if (queueHead >= queue.length) return undefined;
     const waiter = queue[queueHead];
     queue[queueHead] = undefined as unknown as () => void; // drop the reference for GC
-    queueHead++;
+    queueHead--;
     if (queueHead > 16 && queueHead * 2 >= queue.length) {
       queue = queue.slice(queueHead);

[Survived] ConditionalExpression
helpers/promise/createSemaphore.ts:88:9
     const waiter = queue[queueHead];
     queue[queueHead] = undefined as unknown as () => void; // drop the reference for GC
     queueHead++;
-    if (queueHead > 16 && queueHead * 2 >= queue.length) {
+    if (true) {
       queue = queue.slice(queueHead);
       queueHead = 0;

[Survived] ConditionalExpression
helpers/promise/createSemaphore.ts:88:9
     const waiter = queue[queueHead];
     queue[queueHead] = undefined as unknown as () => void; // drop the reference for GC
     queueHead++;
-    if (queueHead > 16 && queueHead * 2 >= queue.length) {
+    if (true && queueHead * 2 >= queue.length) {
       queue = queue.slice(queueHead);
       queueHead = 0;

[Survived] MethodExpression
helpers/promise/createSemaphore.ts:89:15
     queue[queueHead] = undefined as unknown as () => void; // drop the reference for GC
     queueHead++;
     if (queueHead > 16 && queueHead * 2 >= queue.length) {
-      queue = queue.slice(queueHead);
+      queue = queue;
       queueHead = 0;
     }

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:95:37
     return waiter;
   }
 
-  function createRelease(): Release {
-    let released = false;
-    return () => {
-      if (released) {
-        throw new RangeError('Semaphore: this permit was already released');
-      }
-      released = true;
-      available++;
-      const next = dequeue();
-      if (next) next();
-    };
-  }
+  function createRelease(): Release {}
 
   function acquire(): Promise<Release> {

[Survived] BooleanLiteral
helpers/promise/createSemaphore.ts:96:20
   }
 
   function createRelease(): Release {
-    let released = false;
+    let released = true;
     return () => {
       if (released) {

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:97:18
 
   function createRelease(): Release {
     let released = false;
-    return () => {
-      if (released) {
-        throw new RangeError('Semaphore: this permit was already released');
-      }
-      released = true;
-      available++;
-      const next = dequeue();
-      if (next) next();
-    };
+    return () => {};
   }
 

[Survived] ConditionalExpression
helpers/promise/createSemaphore.ts:98:11
   function createRelease(): Release {
     let released = false;
     return () => {
-      if (released) {
+      if (true) {
         throw new RangeError('Semaphore: this permit was already released');
       }

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:98:21
   function createRelease(): Release {
     let released = false;
     return () => {
-      if (released) {
-        throw new RangeError('Semaphore: this permit was already released');
-      }
+      if (released) {}
       released = true;
       available++;

[Survived] BooleanLiteral
helpers/promise/createSemaphore.ts:101:18
       if (released) {
         throw new RangeError('Semaphore: this permit was already released');
       }
-      released = true;
+      released = false;
       available++;
       const next = dequeue();

[Survived] UpdateOperator
helpers/promise/createSemaphore.ts:102:7
         throw new RangeError('Semaphore: this permit was already released');
       }
       released = true;
-      available++;
+      available--;
       const next = dequeue();
       if (next) next();

[Survived] ConditionalExpression
helpers/promise/createSemaphore.ts:104:11
       released = true;
       available++;
       const next = dequeue();
-      if (next) next();
+      if (false) next();
     };
   }

[Survived] ConditionalExpression
helpers/promise/createSemaphore.ts:104:11
       released = true;
       available++;
       const next = dequeue();
-      if (next) next();
+      if (true) next();
     };
   }

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:108:40
     };
   }
 
-  function acquire(): Promise<Release> {
-    if (available > 0) {
-      available--;
-      return Promise.resolve(createRelease());
-    }
-    return new Promise<Release>((resolve) => {
-      enqueue(() => {
-        available--;
-        resolve(createRelease());
-      });
-    });
-  }
+  function acquire(): Promise<Release> {}
 
   async function run<T>(fn: () => T | Promise<T>): Promise<T> {

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:109:24
   }
 
   function acquire(): Promise<Release> {
-    if (available > 0) {
-      available--;
-      return Promise.resolve(createRelease());
-    }
+    if (available > 0) {}
     return new Promise<Release>((resolve) => {
       enqueue(() => {

[Survived] ConditionalExpression
helpers/promise/createSemaphore.ts:109:9
   }
 
   function acquire(): Promise<Release> {
-    if (available > 0) {
+    if (true) {
       available--;
       return Promise.resolve(createRelease());

[Survived] UpdateOperator
helpers/promise/createSemaphore.ts:110:7
 
   function acquire(): Promise<Release> {
     if (available > 0) {
-      available--;
+      available++;
       return Promise.resolve(createRelease());
     }

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:113:46
       available--;
       return Promise.resolve(createRelease());
     }
-    return new Promise<Release>((resolve) => {
-      enqueue(() => {
-        available--;
-        resolve(createRelease());
-      });
-    });
+    return new Promise<Release>((resolve) => {});
   }
 

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:114:21
       return Promise.resolve(createRelease());
     }
     return new Promise<Release>((resolve) => {
-      enqueue(() => {
-        available--;
-        resolve(createRelease());
-      });
+      enqueue(() => {});
     });
   }

[Survived] UpdateOperator
helpers/promise/createSemaphore.ts:115:9
     }
     return new Promise<Release>((resolve) => {
       enqueue(() => {
-        available--;
+        available++;
         resolve(createRelease());
       });

[Survived] CallExpression
helpers/promise/createSemaphore.ts:116:9
     return new Promise<Release>((resolve) => {
       enqueue(() => {
         available--;
-        resolve(createRelease());
+        ;
       });
     });

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:121:63
     });
   }
 
-  async function run<T>(fn: () => T | Promise<T>): Promise<T> {
-    const release = await acquire();
-    try {
-      return await fn();
-    } finally {
-      release();
-    }
-  }
+  async function run<T>(fn: () => T | Promise<T>): Promise<T> {}
 
   return { acquire, run, availablePermits: () => available };

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:123:9
 
   async function run<T>(fn: () => T | Promise<T>): Promise<T> {
     const release = await acquire();
-    try {
-      return await fn();
-    } finally {
+    try {} finally {
       release();
     }

[Survived] BlockStatement
helpers/promise/createSemaphore.ts:125:15
     const release = await acquire();
     try {
       return await fn();
-    } finally {
-      release();
-    }
+    } finally {}
   }
 

[Survived] ArrowFunction
helpers/promise/createSemaphore.ts:130:44
     }
   }
 
-  return { acquire, run, availablePermits: () => available };
+  return { acquire, run, availablePermits: () => undefined };
 }
 

[Survived] ObjectLiteral
helpers/promise/createSemaphore.ts:130:10
     }
   }
 
-  return { acquire, run, availablePermits: () => available };
+  return {};
 }
 
