[Survived] CallExpression
helpers/promise/timeout.ts:34:9
 
     promise.then(
       (value) => {
-        clearTimeout(timer);
+        ;
         resolve(value);
       },

[Survived] CallExpression
helpers/promise/timeout.ts:35:9
     promise.then(
       (value) => {
         clearTimeout(timer);
-        resolve(value);
+        ;
       },
       (error) => {

[Survived] CallExpression
helpers/promise/timeout.ts:38:9
         resolve(value);
       },
       (error) => {
-        clearTimeout(timer);
+        ;
         reject(error);
       },

[Survived] CallExpression
helpers/promise/timeout.ts:39:9
       },
       (error) => {
         clearTimeout(timer);
-        reject(error);
+        ;
       },
     );
