[Survived] BlockStatement
helpers/set/filter.ts:17:90
  * // => Set(2) { 2, 4 }
  * @since 3.0.3
  */
-export function filter<T>(set: ReadonlySet<T>, predicate: (value: T) => boolean): Set<T> {
-  const result = new Set<T>();
-  for (const value of set) {
-    if (predicate(value)) {
-      result.add(value);
-    }
-  }
-  return result;
-}
+export function filter<T>(set: ReadonlySet<T>, predicate: (value: T) => boolean): Set<T> {}
 

[Survived] BlockStatement
helpers/set/filter.ts:19:28
  */
 export function filter<T>(set: ReadonlySet<T>, predicate: (value: T) => boolean): Set<T> {
   const result = new Set<T>();
-  for (const value of set) {
-    if (predicate(value)) {
-      result.add(value);
-    }
-  }
+  for (const value of set) {}
   return result;
 }

[Survived] ConditionalExpression
helpers/set/filter.ts:20:9
 export function filter<T>(set: ReadonlySet<T>, predicate: (value: T) => boolean): Set<T> {
   const result = new Set<T>();
   for (const value of set) {
-    if (predicate(value)) {
+    if (true) {
       result.add(value);
     }

[Survived] BlockStatement
helpers/set/filter.ts:20:27
 export function filter<T>(set: ReadonlySet<T>, predicate: (value: T) => boolean): Set<T> {
   const result = new Set<T>();
   for (const value of set) {
-    if (predicate(value)) {
-      result.add(value);
-    }
+    if (predicate(value)) {}
   }
   return result;

[Survived] CallExpression
helpers/set/filter.ts:21:7
   const result = new Set<T>();
   for (const value of set) {
     if (predicate(value)) {
-      result.add(value);
+      ;
     }
   }
