[Survived] BlockStatement
helpers/string/camelCase.ts:28:86
 export function camelCase(str: string): string;
 export function camelCase(str: undefined): undefined;
 export function camelCase(str: null): null;
-export function camelCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
-  const words = str
-    .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
-    .split(/[\s_-]+/)
-    .filter(Boolean);
-  if (words.length === 0) return '';
-  return (
-    words[0]!.toLowerCase() +
-    words
-      .slice(1)
-      .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
-      .join('')
-  );
-}
+export function camelCase(str: string | undefined | null): string | undefined | null {}
 

[Survived] EqualityOperator
helpers/string/camelCase.ts:29:7
 export function camelCase(str: undefined): undefined;
 export function camelCase(str: null): null;
 export function camelCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (str !== undefined || str === null) return str;
   const words = str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')

[Survived] MethodExpression
helpers/string/camelCase.ts:30:17
 export function camelCase(str: null): null;
 export function camelCase(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
-  const words = str
-    .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
-    .split(/[\s_-]+/)
-    .filter(Boolean);
+  const words = str.replace(/([a-z0-9])([A-Z])/g, '$1 $2').replace(/([A-Z])([A-Z][a-z])/g, '$1 $2').split(/[\s_-]+/);
   if (words.length === 0) return '';
   return (

[Survived] EqualityOperator
helpers/string/camelCase.ts:35:7
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
     .split(/[\s_-]+/)
     .filter(Boolean);
-  if (words.length === 0) return '';
+  if (words.length !== 0) return '';
   return (
     words[0]!.toLowerCase() +

[Survived] ConditionalExpression
helpers/string/camelCase.ts:35:7
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
     .split(/[\s_-]+/)
     .filter(Boolean);
-  if (words.length === 0) return '';
+  if (false) return '';
   return (
     words[0]!.toLowerCase() +

[Survived] MethodExpression
helpers/string/camelCase.ts:37:5
     .filter(Boolean);
   if (words.length === 0) return '';
   return (
-    words[0]!.toLowerCase() +
+    words[0]!.toUpperCase() +
     words
       .slice(1)

[Survived] ArithmeticOperator
helpers/string/camelCase.ts:37:5
     .filter(Boolean);
   if (words.length === 0) return '';
   return (
-    words[0]!.toLowerCase() +
-    words
-      .slice(1)
-      .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
-      .join('')
+    words[0]!.toLowerCase() - words.slice(1).map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase()).join('')
   );
 }

[Survived] MethodExpression
helpers/string/camelCase.ts:38:5
   if (words.length === 0) return '';
   return (
     words[0]!.toLowerCase() +
-    words
-      .slice(1)
+    words
       .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
       .join('')

[Survived] MethodExpression
helpers/string/camelCase.ts:40:20
     words[0]!.toLowerCase() +
     words
       .slice(1)
-      .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
+      .map(word => word.charAt(0).toLowerCase() + word.slice(1).toLowerCase())
       .join('')
   );

[Survived] ArithmeticOperator
helpers/string/camelCase.ts:40:20
     words[0]!.toLowerCase() +
     words
       .slice(1)
-      .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
+      .map(word => word.charAt(0).toUpperCase() - word.slice(1).toLowerCase())
       .join('')
   );
