[Killed] Regex
helpers/string/escapeRegExp.ts:7:30
  * SPDX-License-Identifier: LGPL-3.0-or-later
  */
 
-const REGEXP_SPECIAL_CHARS = /[.*+?^${}()|[\]\\]/g;
+const REGEXP_SPECIAL_CHARS = /[^.*+?^${}()|[\]\\]/g;
 
 /**
killedBy: mean handles negative numbers
statusReason: Property failed after 3 tests
{ seed: 2010954804, path: "2:2:4:2", endOnFailure: true }
Counterexample: ["("]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BlockStatement
helpers/string/escapeRegExp.ts:27:51
  * new RegExp(search).test(text) // userInput is matched literally
  * @since 3.0.0
  */
-export function escapeRegExp(str: string): string {
-  return str.replace(REGEXP_SPECIAL_CHARS, '\\$&');
-}
+export function escapeRegExp(str: string): string {}
 
