[Survived] BlockStatement
helpers/string/globToRegExp.ts:30:77
  * // => true
  * @since 3.1.1
  */
-export function globToRegExp(pattern: string, caseSensitive = true): RegExp {
-  const body = pattern
-    .split(/([*?])/)
-    .map((segment) => (segment === '*' ? '.*' : segment === '?' ? '.' : escapeRegExp(segment)))
-    .join('');
-
-  return new RegExp(`^${body}$`, caseSensitive ? '' : 'i');
-}
+export function globToRegExp(pattern: string, caseSensitive = true): RegExp {}
 

[Survived] BooleanLiteral
helpers/string/globToRegExp.ts:30:63
  * // => true
  * @since 3.1.1
  */
-export function globToRegExp(pattern: string, caseSensitive = true): RegExp {
+export function globToRegExp(pattern: string, caseSensitive = false): RegExp {
   const body = pattern
     .split(/([*?])/)

[Survived] ConditionalExpression
helpers/string/globToRegExp.ts:33:49
 export function globToRegExp(pattern: string, caseSensitive = true): RegExp {
   const body = pattern
     .split(/([*?])/)
-    .map((segment) => (segment === '*' ? '.*' : segment === '?' ? '.' : escapeRegExp(segment)))
+    .map((segment) => (segment === '*' ? '.*' : true ? '.' : escapeRegExp(segment)))
     .join('');
 

[Survived] EqualityOperator
helpers/string/globToRegExp.ts:33:49
 export function globToRegExp(pattern: string, caseSensitive = true): RegExp {
   const body = pattern
     .split(/([*?])/)
-    .map((segment) => (segment === '*' ? '.*' : segment === '?' ? '.' : escapeRegExp(segment)))
+    .map((segment) => (segment === '*' ? '.*' : segment !== '?' ? '.' : escapeRegExp(segment)))
     .join('');
 

[Survived] StringLiteral
helpers/string/globToRegExp.ts:36:50
     .map((segment) => (segment === '*' ? '.*' : segment === '?' ? '.' : escapeRegExp(segment)))
     .join('');
 
-  return new RegExp(`^${body}$`, caseSensitive ? '' : 'i');
+  return new RegExp(`^${body}$`, caseSensitive ? "Stryker was here!" : 'i');
 }
 
