[Survived] BlockStatement
helpers/string/isNonEmpty.ts:25:79
  * isNonEmpty(undefined)  // => false
  * @since 2.0.3
  */
-export function isNonEmpty(value: string | null | undefined): value is string {
-  return value != null && value.length > 0;
-}
+export function isNonEmpty(value: string | null | undefined): value is string {}
 

[Survived] EqualityOperator
helpers/string/isNonEmpty.ts:26:27
  * @since 2.0.3
  */
 export function isNonEmpty(value: string | null | undefined): value is string {
-  return value != null && value.length > 0;
+  return value != null && value.length >= 0;
 }
 

[Survived] LogicalOperator
helpers/string/isNonEmpty.ts:26:10
  * @since 2.0.3
  */
 export function isNonEmpty(value: string | null | undefined): value is string {
-  return value != null && value.length > 0;
+  return value != null || value.length > 0;
 }
 
