[Survived] BooleanLiteral
helpers/string/levenshteinDistance.ts:23:75
  * // => 0
  * @since 3.1.1
  */
-export function levenshteinDistance(a: string, b: string, caseSensitive = true): number {
+export function levenshteinDistance(a: string, b: string, caseSensitive = false): number {
   const s = caseSensitive ? a : a.toLowerCase();
   const t = caseSensitive ? b : b.toLowerCase();

[Survived] BlockStatement
helpers/string/levenshteinDistance.ts:23:89
  * // => 0
  * @since 3.1.1
  */
-export function levenshteinDistance(a: string, b: string, caseSensitive = true): number {
-  const s = caseSensitive ? a : a.toLowerCase();
-  const t = caseSensitive ? b : b.toLowerCase();
-
-  if (s === t) return 0;
-  if (s.length === 0) return t.length;
-  if (t.length === 0) return s.length;
-
-  let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);
-
-  for (let i = 0; i < s.length; i++) {
-    const currentRow: number[] = [i + 1];
-    for (let j = 0; j < t.length; j++) {
-      const deletionCost = previousRow[j + 1] + 1;
-      const insertionCost = currentRow[j] + 1;
-      const substitutionCost = previousRow[j] + (s[i] === t[j] ? 0 : 1);
-      currentRow.push(Math.min(deletionCost, insertionCost, substitutionCost));
-    }
-    previousRow = currentRow;
-  }
-
-  return previousRow[t.length];
-}
+export function levenshteinDistance(a: string, b: string, caseSensitive = true): number {}
 

[Survived] MethodExpression
helpers/string/levenshteinDistance.ts:24:33
  * @since 3.1.1
  */
 export function levenshteinDistance(a: string, b: string, caseSensitive = true): number {
-  const s = caseSensitive ? a : a.toLowerCase();
+  const s = caseSensitive ? a : a.toUpperCase();
   const t = caseSensitive ? b : b.toLowerCase();
 

[Survived] MethodExpression
helpers/string/levenshteinDistance.ts:25:33
  */
 export function levenshteinDistance(a: string, b: string, caseSensitive = true): number {
   const s = caseSensitive ? a : a.toLowerCase();
-  const t = caseSensitive ? b : b.toLowerCase();
+  const t = caseSensitive ? b : b.toUpperCase();
 
   if (s === t) return 0;

[Survived] ConditionalExpression
helpers/string/levenshteinDistance.ts:27:7
   const s = caseSensitive ? a : a.toLowerCase();
   const t = caseSensitive ? b : b.toLowerCase();
 
-  if (s === t) return 0;
+  if (false) return 0;
   if (s.length === 0) return t.length;
   if (t.length === 0) return s.length;

[Survived] EqualityOperator
helpers/string/levenshteinDistance.ts:27:7
   const s = caseSensitive ? a : a.toLowerCase();
   const t = caseSensitive ? b : b.toLowerCase();
 
-  if (s === t) return 0;
+  if (s !== t) return 0;
   if (s.length === 0) return t.length;
   if (t.length === 0) return s.length;

[Survived] EqualityOperator
helpers/string/levenshteinDistance.ts:28:7
   const t = caseSensitive ? b : b.toLowerCase();
 
   if (s === t) return 0;
-  if (s.length === 0) return t.length;
+  if (s.length !== 0) return t.length;
   if (t.length === 0) return s.length;
 

[Survived] ConditionalExpression
helpers/string/levenshteinDistance.ts:28:7
   const t = caseSensitive ? b : b.toLowerCase();
 
   if (s === t) return 0;
-  if (s.length === 0) return t.length;
+  if (false) return t.length;
   if (t.length === 0) return s.length;
 

[Survived] EqualityOperator
helpers/string/levenshteinDistance.ts:29:7
 
   if (s === t) return 0;
   if (s.length === 0) return t.length;
-  if (t.length === 0) return s.length;
+  if (t.length !== 0) return s.length;
 
   let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);

[Survived] ConditionalExpression
helpers/string/levenshteinDistance.ts:29:7
 
   if (s === t) return 0;
   if (s.length === 0) return t.length;
-  if (t.length === 0) return s.length;
+  if (true) return s.length;
 
   let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);

[Survived] ArrowFunction
helpers/string/levenshteinDistance.ts:31:58
   if (s.length === 0) return t.length;
   if (t.length === 0) return s.length;
 
-  let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);
+  let previousRow = Array.from({ length: t.length + 1 }, () => undefined);
 
   for (let i = 0; i < s.length; i++) {

[Survived] ArithmeticOperator
helpers/string/levenshteinDistance.ts:31:42
   if (s.length === 0) return t.length;
   if (t.length === 0) return s.length;
 
-  let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);
+  let previousRow = Array.from({ length: t.length - 1 }, (_, i) => i);
 
   for (let i = 0; i < s.length; i++) {

[Survived] UpdateOperator
helpers/string/levenshteinDistance.ts:33:33
 
   let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);
 
-  for (let i = 0; i < s.length; i++) {
+  for (let i = 0; i < s.length; i--) {
     const currentRow: number[] = [i + 1];
     for (let j = 0; j < t.length; j++) {

[Survived] EqualityOperator
helpers/string/levenshteinDistance.ts:33:19
 
   let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);
 
-  for (let i = 0; i < s.length; i++) {
+  for (let i = 0; i <= s.length; i++) {
     const currentRow: number[] = [i + 1];
     for (let j = 0; j < t.length; j++) {

[Survived] ArithmeticOperator
helpers/string/levenshteinDistance.ts:34:35
   let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);
 
   for (let i = 0; i < s.length; i++) {
-    const currentRow: number[] = [i + 1];
+    const currentRow: number[] = [i - 1];
     for (let j = 0; j < t.length; j++) {
       const deletionCost = previousRow[j + 1] + 1;

[Survived] ArrayDeclaration
helpers/string/levenshteinDistance.ts:34:34
   let previousRow = Array.from({ length: t.length + 1 }, (_, i) => i);
 
   for (let i = 0; i < s.length; i++) {
-    const currentRow: number[] = [i + 1];
+    const currentRow: number[] = [];
     for (let j = 0; j < t.length; j++) {
       const deletionCost = previousRow[j + 1] + 1;

[Survived] ConditionalExpression
helpers/string/levenshteinDistance.ts:35:21
 
   for (let i = 0; i < s.length; i++) {
     const currentRow: number[] = [i + 1];
-    for (let j = 0; j < t.length; j++) {
+    for (let j = 0; false; j++) {
       const deletionCost = previousRow[j + 1] + 1;
       const insertionCost = currentRow[j] + 1;

[Survived] EqualityOperator
helpers/string/levenshteinDistance.ts:35:21
 
   for (let i = 0; i < s.length; i++) {
     const currentRow: number[] = [i + 1];
-    for (let j = 0; j < t.length; j++) {
+    for (let j = 0; j >= t.length; j++) {
       const deletionCost = previousRow[j + 1] + 1;
       const insertionCost = currentRow[j] + 1;

[Survived] ArithmeticOperator
helpers/string/levenshteinDistance.ts:36:28
   for (let i = 0; i < s.length; i++) {
     const currentRow: number[] = [i + 1];
     for (let j = 0; j < t.length; j++) {
-      const deletionCost = previousRow[j + 1] + 1;
+      const deletionCost = previousRow[j + 1] - 1;
       const insertionCost = currentRow[j] + 1;
       const substitutionCost = previousRow[j] + (s[i] === t[j] ? 0 : 1);

[Survived] ArithmeticOperator
helpers/string/levenshteinDistance.ts:36:40
   for (let i = 0; i < s.length; i++) {
     const currentRow: number[] = [i + 1];
     for (let j = 0; j < t.length; j++) {
-      const deletionCost = previousRow[j + 1] + 1;
+      const deletionCost = previousRow[j - 1] + 1;
       const insertionCost = currentRow[j] + 1;
       const substitutionCost = previousRow[j] + (s[i] === t[j] ? 0 : 1);

[Survived] ArithmeticOperator
helpers/string/levenshteinDistance.ts:37:29
     const currentRow: number[] = [i + 1];
     for (let j = 0; j < t.length; j++) {
       const deletionCost = previousRow[j + 1] + 1;
-      const insertionCost = currentRow[j] + 1;
+      const insertionCost = currentRow[j] - 1;
       const substitutionCost = previousRow[j] + (s[i] === t[j] ? 0 : 1);
       currentRow.push(Math.min(deletionCost, insertionCost, substitutionCost));

[Survived] ConditionalExpression
helpers/string/levenshteinDistance.ts:38:50
     for (let j = 0; j < t.length; j++) {
       const deletionCost = previousRow[j + 1] + 1;
       const insertionCost = currentRow[j] + 1;
-      const substitutionCost = previousRow[j] + (s[i] === t[j] ? 0 : 1);
+      const substitutionCost = previousRow[j] + (true ? 0 : 1);
       currentRow.push(Math.min(deletionCost, insertionCost, substitutionCost));
     }

[Survived] EqualityOperator
helpers/string/levenshteinDistance.ts:38:50
     for (let j = 0; j < t.length; j++) {
       const deletionCost = previousRow[j + 1] + 1;
       const insertionCost = currentRow[j] + 1;
-      const substitutionCost = previousRow[j] + (s[i] === t[j] ? 0 : 1);
+      const substitutionCost = previousRow[j] + (s[i] !== t[j] ? 0 : 1);
       currentRow.push(Math.min(deletionCost, insertionCost, substitutionCost));
     }

[Survived] MethodExpression
helpers/string/levenshteinDistance.ts:39:23
       const deletionCost = previousRow[j + 1] + 1;
       const insertionCost = currentRow[j] + 1;
       const substitutionCost = previousRow[j] + (s[i] === t[j] ? 0 : 1);
-      currentRow.push(Math.min(deletionCost, insertionCost, substitutionCost));
+      currentRow.push(Math.max(deletionCost, insertionCost, substitutionCost));
     }
     previousRow = currentRow;
