[Survived] BlockStatement
helpers/string/slugify.ts:23:84
 export function slugify(str: string): string;
 export function slugify(str: undefined): undefined;
 export function slugify(str: null): null;
-export function slugify(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
-  return removeDiacritics(str)
-    .toLowerCase()
-    .trim()
-    .replace(/['’]/g, '')
-    .replace(/[^a-z0-9]+/g, '-')
-    .replace(/^-+|-+$/g, '')
-    .replace(/-{2,}/g, '-');
-}
+export function slugify(str: string | undefined | null): string | undefined | null {}
 

[Killed] LogicalOperator
helpers/string/slugify.ts:24:7
 export function slugify(str: undefined): undefined;
 export function slugify(str: null): null;
 export function slugify(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (str === undefined && str === null) return str;
   return removeDiacritics(str)
     .toLowerCase()
killedBy: buildConventionalCommitRegex with restricted types rejects disallowed types
statusReason: Cannot read properties of null (reading 'normalize')

[Killed] EqualityOperator
helpers/string/slugify.ts:24:7
 export function slugify(str: undefined): undefined;
 export function slugify(str: null): null;
 export function slugify(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (str !== undefined || str === null) return str;
   return removeDiacritics(str)
     .toLowerCase()
killedBy: analyzeCommits detects BREAKING CHANGE in CRLF body of non-conventional commits
statusReason: expected 'Hello World' to be 'hello-world' // Object.is equality

[Survived] MethodExpression
helpers/string/slugify.ts:25:10
 export function slugify(str: null): null;
 export function slugify(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
-  return removeDiacritics(str)
-    .toLowerCase()
+  return removeDiacritics(str).toUpperCase()
     .trim()
     .replace(/['’]/g, '')

[Survived] MethodExpression
helpers/string/slugify.ts:25:10
 export function slugify(str: null): null;
 export function slugify(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
-  return removeDiacritics(str)
-    .toLowerCase()
-    .trim()
+  return removeDiacritics(str).toLowerCase()
     .replace(/['’]/g, '')
     .replace(/[^a-z0-9]+/g, '-')
