[Survived] BlockStatement
helpers/string/trim.ts:45:114
 export function trim(input: string, mode?: TrimMode): string;
 export function trim(input: undefined, mode?: TrimMode): undefined;
 export function trim(input: null, mode?: TrimMode): null;
-export function trim(input: string | null | undefined, mode: TrimMode = 'whitespace'): string | null | undefined {
-  if (input == null) return input;
-  if (mode === 'whitespace') return input.trim();
-  assertValidTrimMode(mode, 'trim');
-  return trimStart(trimEnd(input, mode), mode);
-}
+export function trim(input: string | null | undefined, mode: TrimMode = 'whitespace'): string | null | undefined {}
 

[Survived] EqualityOperator
helpers/string/trim.ts:46:7
 export function trim(input: undefined, mode?: TrimMode): undefined;
 export function trim(input: null, mode?: TrimMode): null;
 export function trim(input: string | null | undefined, mode: TrimMode = 'whitespace'): string | null | undefined {
-  if (input == null) return input;
+  if (input != null) return input;
   if (mode === 'whitespace') return input.trim();
   assertValidTrimMode(mode, 'trim');

[Survived] ConditionalExpression
helpers/string/trim.ts:46:7
 export function trim(input: undefined, mode?: TrimMode): undefined;
 export function trim(input: null, mode?: TrimMode): null;
 export function trim(input: string | null | undefined, mode: TrimMode = 'whitespace'): string | null | undefined {
-  if (input == null) return input;
+  if (false) return input;
   if (mode === 'whitespace') return input.trim();
   assertValidTrimMode(mode, 'trim');

[Survived] ConditionalExpression
helpers/string/trim.ts:47:7
 export function trim(input: null, mode?: TrimMode): null;
 export function trim(input: string | null | undefined, mode: TrimMode = 'whitespace'): string | null | undefined {
   if (input == null) return input;
-  if (mode === 'whitespace') return input.trim();
+  if (true) return input.trim();
   assertValidTrimMode(mode, 'trim');
   return trimStart(trimEnd(input, mode), mode);

[Survived] MethodExpression
helpers/string/trim.ts:47:37
 export function trim(input: null, mode?: TrimMode): null;
 export function trim(input: string | null | undefined, mode: TrimMode = 'whitespace'): string | null | undefined {
   if (input == null) return input;
-  if (mode === 'whitespace') return input.trim();
+  if (mode === 'whitespace') return input;
   assertValidTrimMode(mode, 'trim');
   return trimStart(trimEnd(input, mode), mode);
