[Killed] Regex
helpers/version/_gentoo.ts:15:27
 import type { GentooSuffix, GentooSuffixType, IncrementType, ParsedGentooVersion } from './types';
 
 /** @ignore */
-const GENTOO_VERSION_RE = /^(\d+(?:\.\d+)*)([a-z])?((?:_(?:alpha|beta|pre|rc|p)\d*)*)(?:-r(\d+))?$/;
+const GENTOO_VERSION_RE = /^(\d+(?:\.\d+)*)([a-z])((?:_(?:alpha|beta|pre|rc|p)\d*)*)(?:-r(\d+))?$/;
 /** @ignore */
 const GENTOO_SUFFIX_RE = /_(alpha|beta|pre|rc|p)(\d*)/g;
killedBy: set — type inference wrong value type is rejected at compile time
statusReason: parse: "1.2.3" is not a valid Gentoo/Portage ebuild version

[Killed] Regex
helpers/version/_gentoo.ts:15:27
 import type { GentooSuffix, GentooSuffixType, IncrementType, ParsedGentooVersion } from './types';
 
 /** @ignore */
-const GENTOO_VERSION_RE = /^(\d+(?:\.\d+)*)([a-z])?((?:_(?:alpha|beta|pre|rc|p)\d*)*)(?:-r(\d+))?$/;
+const GENTOO_VERSION_RE = /^(\d+(?:\.\d+)*)([a-z])?((?:_(?:alpha|beta|pre|rc|p)\d*))(?:-r(\d+))?$/;
 /** @ignore */
 const GENTOO_SUFFIX_RE = /_(alpha|beta|pre|rc|p)(\d*)/g;
killedBy: set — type inference wrong value type is rejected at compile time
statusReason: parse: "1.2.3" is not a valid Gentoo/Portage ebuild version

[Survived] BlockStatement
helpers/version/_gentoo.ts:36:15
 /** @ignore */
 export function parseGentoo(version: string): ParsedGentooVersion {
   const match = GENTOO_VERSION_RE.exec(version);
-  if (!match) {
-    throw new SyntaxError(`parse: "${version}" is not a valid Gentoo/Portage ebuild version`);
-  }
+  if (!match) {}
   const [, componentsStr, letter, suffixesStr, revisionStr] = match;
 

[Survived] BooleanLiteral
helpers/version/_gentoo.ts:36:7
 /** @ignore */
 export function parseGentoo(version: string): ParsedGentooVersion {
   const match = GENTOO_VERSION_RE.exec(version);
-  if (!match) {
+  if (match) {
     throw new SyntaxError(`parse: "${version}" is not a valid Gentoo/Portage ebuild version`);
   }

[Survived] EqualityOperator
helpers/version/_gentoo.ts:46:10
   const suffixes: GentooSuffix[] = [];
   GENTOO_SUFFIX_RE.lastIndex = 0;
   let suffixMatch: RegExpExecArray | null;
-  while ((suffixMatch = GENTOO_SUFFIX_RE.exec(suffixesStr)) !== null) {
+  while ((suffixMatch = GENTOO_SUFFIX_RE.exec(suffixesStr)) === null) {
     suffixes.push({
       type: suffixMatch[1] as GentooSuffixType,

[Survived] BlockStatement
helpers/version/_gentoo.ts:46:71
   const suffixes: GentooSuffix[] = [];
   GENTOO_SUFFIX_RE.lastIndex = 0;
   let suffixMatch: RegExpExecArray | null;
-  while ((suffixMatch = GENTOO_SUFFIX_RE.exec(suffixesStr)) !== null) {
-    suffixes.push({
-      type: suffixMatch[1] as GentooSuffixType,
-      number: suffixMatch[2] ? Number(suffixMatch[2]) : 0,
-    });
-  }
+  while ((suffixMatch = GENTOO_SUFFIX_RE.exec(suffixesStr)) !== null) {}
 
   return {

[Survived] CallExpression
helpers/version/_gentoo.ts:47:5
   GENTOO_SUFFIX_RE.lastIndex = 0;
   let suffixMatch: RegExpExecArray | null;
   while ((suffixMatch = GENTOO_SUFFIX_RE.exec(suffixesStr)) !== null) {
-    suffixes.push({
-      type: suffixMatch[1] as GentooSuffixType,
-      number: suffixMatch[2] ? Number(suffixMatch[2]) : 0,
-    });
+    ;
   }
 

[Survived] LogicalOperator
helpers/version/_gentoo.ts:56:13
   return {
     scheme: 'gentoo',
     components,
-    letter: letter ?? '',
+    letter: letter && '',
     suffixes,
     revision: revisionStr ? Number(revisionStr) : 0,

[Survived] BlockStatement
helpers/version/_gentoo.ts:63:80
 }
 
 /** @ignore */
-function compareComponents(a: readonly number[], b: readonly number[]): number {
-  const length = Math.max(a.length, b.length);
-  for (let i = 0; i < length; i++) {
-    const av = a[i] ?? 0;
-    const bv = b[i] ?? 0;
-    if (av !== bv) return av < bv ? -1 : 1;
-  }
-  return 0;
-}
+function compareComponents(a: readonly number[], b: readonly number[]): number {}
 
 /**

[Survived] MethodExpression
helpers/version/_gentoo.ts:64:18
 
 /** @ignore */
 function compareComponents(a: readonly number[], b: readonly number[]): number {
-  const length = Math.max(a.length, b.length);
+  const length = Math.min(a.length, b.length);
   for (let i = 0; i < length; i++) {
     const av = a[i] ?? 0;

[Survived] BlockStatement
helpers/version/_gentoo.ts:65:36
 /** @ignore */
 function compareComponents(a: readonly number[], b: readonly number[]): number {
   const length = Math.max(a.length, b.length);
-  for (let i = 0; i < length; i++) {
-    const av = a[i] ?? 0;
-    const bv = b[i] ?? 0;
-    if (av !== bv) return av < bv ? -1 : 1;
-  }
+  for (let i = 0; i < length; i++) {}
   return 0;
 }

[Survived] UpdateOperator
helpers/version/_gentoo.ts:65:31
 /** @ignore */
 function compareComponents(a: readonly number[], b: readonly number[]): number {
   const length = Math.max(a.length, b.length);
-  for (let i = 0; i < length; i++) {
+  for (let i = 0; i < length; i--) {
     const av = a[i] ?? 0;
     const bv = b[i] ?? 0;

[Survived] LogicalOperator
helpers/version/_gentoo.ts:66:16
 function compareComponents(a: readonly number[], b: readonly number[]): number {
   const length = Math.max(a.length, b.length);
   for (let i = 0; i < length; i++) {
-    const av = a[i] ?? 0;
+    const av = a[i] && 0;
     const bv = b[i] ?? 0;
     if (av !== bv) return av < bv ? -1 : 1;

[Survived] LogicalOperator
helpers/version/_gentoo.ts:67:16
   const length = Math.max(a.length, b.length);
   for (let i = 0; i < length; i++) {
     const av = a[i] ?? 0;
-    const bv = b[i] ?? 0;
+    const bv = b[i] && 0;
     if (av !== bv) return av < bv ? -1 : 1;
   }

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:68:27
   for (let i = 0; i < length; i++) {
     const av = a[i] ?? 0;
     const bv = b[i] ?? 0;
-    if (av !== bv) return av < bv ? -1 : 1;
+    if (av !== bv) return true ? -1 : 1;
   }
   return 0;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:68:27
   for (let i = 0; i < length; i++) {
     const av = a[i] ?? 0;
     const bv = b[i] ?? 0;
-    if (av !== bv) return av < bv ? -1 : 1;
+    if (av !== bv) return av <= bv ? -1 : 1;
   }
   return 0;

[Survived] BlockStatement
helpers/version/_gentoo.ts:78:90
  * chained multi-suffix versions aren't specially handled.
  * @ignore
  */
-function compareSuffixes(a: readonly GentooSuffix[], b: readonly GentooSuffix[]): number {
-  const lastA = a[a.length - 1];
-  const lastB = b[b.length - 1];
-  const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];
-  const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
-  if (rankA !== rankB) return rankA < rankB ? -1 : 1;
-
-  const numA = lastA?.number ?? 0;
-  const numB = lastB?.number ?? 0;
-  if (numA !== numB) return numA < numB ? -1 : 1;
-  return 0;
-}
+function compareSuffixes(a: readonly GentooSuffix[], b: readonly GentooSuffix[]): number {}
 
 /**

[Survived] ArithmeticOperator
helpers/version/_gentoo.ts:79:19
  * @ignore
  */
 function compareSuffixes(a: readonly GentooSuffix[], b: readonly GentooSuffix[]): number {
-  const lastA = a[a.length - 1];
+  const lastA = a[a.length + 1];
   const lastB = b[b.length - 1];
   const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];

[Survived] ArithmeticOperator
helpers/version/_gentoo.ts:80:19
  */
 function compareSuffixes(a: readonly GentooSuffix[], b: readonly GentooSuffix[]): number {
   const lastA = a[a.length - 1];
-  const lastB = b[b.length - 1];
+  const lastB = b[b.length + 1];
   const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];
   const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];

[Survived] OptionalChaining
helpers/version/_gentoo.ts:81:29
 function compareSuffixes(a: readonly GentooSuffix[], b: readonly GentooSuffix[]): number {
   const lastA = a[a.length - 1];
   const lastB = b[b.length - 1];
-  const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];
+  const rankA = SUFFIX_RANK[lastA.type ?? 'release'];
   const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
   if (rankA !== rankB) return rankA < rankB ? -1 : 1;

[Survived] LogicalOperator
helpers/version/_gentoo.ts:81:29
 function compareSuffixes(a: readonly GentooSuffix[], b: readonly GentooSuffix[]): number {
   const lastA = a[a.length - 1];
   const lastB = b[b.length - 1];
-  const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];
+  const rankA = SUFFIX_RANK[lastA?.type && 'release'];
   const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
   if (rankA !== rankB) return rankA < rankB ? -1 : 1;

[Survived] LogicalOperator
helpers/version/_gentoo.ts:82:29
   const lastA = a[a.length - 1];
   const lastB = b[b.length - 1];
   const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];
-  const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
+  const rankB = SUFFIX_RANK[lastB?.type && 'release'];
   if (rankA !== rankB) return rankA < rankB ? -1 : 1;
 

[Survived] OptionalChaining
helpers/version/_gentoo.ts:82:29
   const lastA = a[a.length - 1];
   const lastB = b[b.length - 1];
   const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];
-  const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
+  const rankB = SUFFIX_RANK[lastB.type ?? 'release'];
   if (rankA !== rankB) return rankA < rankB ? -1 : 1;
 

[Survived] EqualityOperator
helpers/version/_gentoo.ts:83:31
   const lastB = b[b.length - 1];
   const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];
   const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
-  if (rankA !== rankB) return rankA < rankB ? -1 : 1;
+  if (rankA !== rankB) return rankA <= rankB ? -1 : 1;
 
   const numA = lastA?.number ?? 0;

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:83:31
   const lastB = b[b.length - 1];
   const rankA = SUFFIX_RANK[lastA?.type ?? 'release'];
   const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
-  if (rankA !== rankB) return rankA < rankB ? -1 : 1;
+  if (rankA !== rankB) return true ? -1 : 1;
 
   const numA = lastA?.number ?? 0;

[Survived] OptionalChaining
helpers/version/_gentoo.ts:85:16
   const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
   if (rankA !== rankB) return rankA < rankB ? -1 : 1;
 
-  const numA = lastA?.number ?? 0;
+  const numA = lastA.number ?? 0;
   const numB = lastB?.number ?? 0;
   if (numA !== numB) return numA < numB ? -1 : 1;

[Survived] LogicalOperator
helpers/version/_gentoo.ts:85:16
   const rankB = SUFFIX_RANK[lastB?.type ?? 'release'];
   if (rankA !== rankB) return rankA < rankB ? -1 : 1;
 
-  const numA = lastA?.number ?? 0;
+  const numA = lastA?.number && 0;
   const numB = lastB?.number ?? 0;
   if (numA !== numB) return numA < numB ? -1 : 1;

[Survived] OptionalChaining
helpers/version/_gentoo.ts:86:16
   if (rankA !== rankB) return rankA < rankB ? -1 : 1;
 
   const numA = lastA?.number ?? 0;
-  const numB = lastB?.number ?? 0;
+  const numB = lastB.number ?? 0;
   if (numA !== numB) return numA < numB ? -1 : 1;
   return 0;

[Survived] LogicalOperator
helpers/version/_gentoo.ts:86:16
   if (rankA !== rankB) return rankA < rankB ? -1 : 1;
 
   const numA = lastA?.number ?? 0;
-  const numB = lastB?.number ?? 0;
+  const numB = lastB?.number && 0;
   if (numA !== numB) return numA < numB ? -1 : 1;
   return 0;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:87:7
 
   const numA = lastA?.number ?? 0;
   const numB = lastB?.number ?? 0;
-  if (numA !== numB) return numA < numB ? -1 : 1;
+  if (numA === numB) return numA < numB ? -1 : 1;
   return 0;
 }

[Survived] EqualityOperator
helpers/version/_gentoo.ts:87:29
 
   const numA = lastA?.number ?? 0;
   const numB = lastB?.number ?? 0;
-  if (numA !== numB) return numA < numB ? -1 : 1;
+  if (numA !== numB) return numA >= numB ? -1 : 1;
   return 0;
 }

[Survived] BlockStatement
helpers/version/_gentoo.ts:97:74
  * release, and neither does a `-r` revision, which isn't a suffix segment at all.
  * @ignore
  */
-export function isPrereleaseGentoo(parsed: ParsedGentooVersion): boolean {
-  const last = parsed.suffixes[parsed.suffixes.length - 1];
-  return SUFFIX_RANK[last?.type ?? 'release'] < SUFFIX_RANK.release;
-}
+export function isPrereleaseGentoo(parsed: ParsedGentooVersion): boolean {}
 
 // The four precedence steps, in order, composed via combineSortFns (array/) instead of a

[Survived] ArithmeticOperator
helpers/version/_gentoo.ts:98:32
  * @ignore
  */
 export function isPrereleaseGentoo(parsed: ParsedGentooVersion): boolean {
-  const last = parsed.suffixes[parsed.suffixes.length - 1];
+  const last = parsed.suffixes[parsed.suffixes.length + 1];
   return SUFFIX_RANK[last?.type ?? 'release'] < SUFFIX_RANK.release;
 }

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:99:10
  */
 export function isPrereleaseGentoo(parsed: ParsedGentooVersion): boolean {
   const last = parsed.suffixes[parsed.suffixes.length - 1];
-  return SUFFIX_RANK[last?.type ?? 'release'] < SUFFIX_RANK.release;
+  return false;
 }
 

[Survived] OptionalChaining
helpers/version/_gentoo.ts:99:22
  */
 export function isPrereleaseGentoo(parsed: ParsedGentooVersion): boolean {
   const last = parsed.suffixes[parsed.suffixes.length - 1];
-  return SUFFIX_RANK[last?.type ?? 'release'] < SUFFIX_RANK.release;
+  return SUFFIX_RANK[last.type ?? 'release'] < SUFFIX_RANK.release;
 }
 

[Killed] ArrowFunction
helpers/version/_gentoo.ts:105:58
 // The four precedence steps, in order, composed via combineSortFns (array/) instead of a
 // hand-rolled "if not equal, return" chain — each step is independently readable, and the
 // precedence order is just the argument order rather than implicit in early-return control flow.
-const compareByComponents: SortFn<ParsedGentooVersion> = (a, b) => compareComponents(a.components, b.components);
+const compareByComponents: SortFn<ParsedGentooVersion> = () => undefined;
 const compareByLetter: SortFn<ParsedGentooVersion> = (a, b) => (a.letter === b.letter ? 0 : a.letter < b.letter ? -1 : 1);
 const compareBySuffixes: SortFn<ParsedGentooVersion> = (a, b) => compareSuffixes(a.suffixes, b.suffixes);
killedBy: parse prerelease parsing should parse common prerelease tags
statusReason: expected undefined to be -1 // Object.is equality

[Killed] ArrowFunction
helpers/version/_gentoo.ts:106:54
 // hand-rolled "if not equal, return" chain — each step is independently readable, and the
 // precedence order is just the argument order rather than implicit in early-return control flow.
 const compareByComponents: SortFn<ParsedGentooVersion> = (a, b) => compareComponents(a.components, b.components);
-const compareByLetter: SortFn<ParsedGentooVersion> = (a, b) => (a.letter === b.letter ? 0 : a.letter < b.letter ? -1 : 1);
+const compareByLetter: SortFn<ParsedGentooVersion> = () => undefined;
 const compareBySuffixes: SortFn<ParsedGentooVersion> = (a, b) => compareSuffixes(a.suffixes, b.suffixes);
 const compareByRevision: SortFn<ParsedGentooVersion> = (a, b) => (a.revision === b.revision ? 0 : a.revision < b.revision ? -1 : 1);
killedBy: parse prerelease parsing should parse common prerelease tags
statusReason: expected undefined to be +0 // Object.is equality

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:106:65
 // hand-rolled "if not equal, return" chain — each step is independently readable, and the
 // precedence order is just the argument order rather than implicit in early-return control flow.
 const compareByComponents: SortFn<ParsedGentooVersion> = (a, b) => compareComponents(a.components, b.components);
-const compareByLetter: SortFn<ParsedGentooVersion> = (a, b) => (a.letter === b.letter ? 0 : a.letter < b.letter ? -1 : 1);
+const compareByLetter: SortFn<ParsedGentooVersion> = (a, b) => (true ? 0 : a.letter < b.letter ? -1 : 1);
 const compareBySuffixes: SortFn<ParsedGentooVersion> = (a, b) => compareSuffixes(a.suffixes, b.suffixes);
 const compareByRevision: SortFn<ParsedGentooVersion> = (a, b) => (a.revision === b.revision ? 0 : a.revision < b.revision ? -1 : 1);

[Killed] ArrowFunction
helpers/version/_gentoo.ts:107:56
 // precedence order is just the argument order rather than implicit in early-return control flow.
 const compareByComponents: SortFn<ParsedGentooVersion> = (a, b) => compareComponents(a.components, b.components);
 const compareByLetter: SortFn<ParsedGentooVersion> = (a, b) => (a.letter === b.letter ? 0 : a.letter < b.letter ? -1 : 1);
-const compareBySuffixes: SortFn<ParsedGentooVersion> = (a, b) => compareSuffixes(a.suffixes, b.suffixes);
+const compareBySuffixes: SortFn<ParsedGentooVersion> = () => undefined;
 const compareByRevision: SortFn<ParsedGentooVersion> = (a, b) => (a.revision === b.revision ? 0 : a.revision < b.revision ? -1 : 1);
 
killedBy: compare gentoo scheme a gentoo revision sorts above its base version, unlike a semver prerelease
statusReason: expected undefined to be -1 // Object.is equality

[Killed] ArrowFunction
helpers/version/_gentoo.ts:108:56
 const compareByComponents: SortFn<ParsedGentooVersion> = (a, b) => compareComponents(a.components, b.components);
 const compareByLetter: SortFn<ParsedGentooVersion> = (a, b) => (a.letter === b.letter ? 0 : a.letter < b.letter ? -1 : 1);
 const compareBySuffixes: SortFn<ParsedGentooVersion> = (a, b) => compareSuffixes(a.suffixes, b.suffixes);
-const compareByRevision: SortFn<ParsedGentooVersion> = (a, b) => (a.revision === b.revision ? 0 : a.revision < b.revision ? -1 : 1);
+const compareByRevision: SortFn<ParsedGentooVersion> = () => undefined;
 
 /** @ignore */
killedBy: parse prerelease parsing should parse common prerelease tags
statusReason: expected undefined to be +0 // Object.is equality

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:108:99
 const compareByComponents: SortFn<ParsedGentooVersion> = (a, b) => compareComponents(a.components, b.components);
 const compareByLetter: SortFn<ParsedGentooVersion> = (a, b) => (a.letter === b.letter ? 0 : a.letter < b.letter ? -1 : 1);
 const compareBySuffixes: SortFn<ParsedGentooVersion> = (a, b) => compareSuffixes(a.suffixes, b.suffixes);
-const compareByRevision: SortFn<ParsedGentooVersion> = (a, b) => (a.revision === b.revision ? 0 : a.revision < b.revision ? -1 : 1);
+const compareByRevision: SortFn<ParsedGentooVersion> = (a, b) => (a.revision === b.revision ? 0 : false ? -1 : 1);
 
 /** @ignore */

[Survived] BlockStatement
helpers/version/_gentoo.ts:114:75
 const compareParsedGentoo = combineSortFns<ParsedGentooVersion>(compareByComponents, compareByLetter, compareBySuffixes, compareByRevision);
 
 /** @ignore */
-export function compareGentoo(version1: string, version2: string): number {
-  return compareParsedGentoo(parseGentoo(version1), parseGentoo(version2));
-}
+export function compareGentoo(version1: string, version2: string): number {}
 
 /**

[Survived] BlockStatement
helpers/version/_gentoo.ts:124:70
  * the two are equivalent per the spec, and no real ebuild writes the redundant `0`.
  * @ignore
  */
-export function stringifyGentoo(parsed: ParsedGentooVersion): string {
-  const base = parsed.components.join('.');
-  const suffixes = parsed.suffixes.map((s) => `_${s.type}${s.number > 0 ? s.number : ''}`).join('');
-  const revision = parsed.revision > 0 ? `-r${parsed.revision}` : '';
-  return `${base}${parsed.letter}${suffixes}${revision}`;
-}
+export function stringifyGentoo(parsed: ParsedGentooVersion): string {}
 
 /** @ignore */

[Survived] StringLiteral
helpers/version/_gentoo.ts:125:39
  * @ignore
  */
 export function stringifyGentoo(parsed: ParsedGentooVersion): string {
-  const base = parsed.components.join('.');
+  const base = parsed.components.join("");
   const suffixes = parsed.suffixes.map((s) => `_${s.type}${s.number > 0 ? s.number : ''}`).join('');
   const revision = parsed.revision > 0 ? `-r${parsed.revision}` : '';

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:126:60
  */
 export function stringifyGentoo(parsed: ParsedGentooVersion): string {
   const base = parsed.components.join('.');
-  const suffixes = parsed.suffixes.map((s) => `_${s.type}${s.number > 0 ? s.number : ''}`).join('');
+  const suffixes = parsed.suffixes.map((s) => `_${s.type}${false ? s.number : ''}`).join('');
   const revision = parsed.revision > 0 ? `-r${parsed.revision}` : '';
   return `${base}${parsed.letter}${suffixes}${revision}`;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:126:60
  */
 export function stringifyGentoo(parsed: ParsedGentooVersion): string {
   const base = parsed.components.join('.');
-  const suffixes = parsed.suffixes.map((s) => `_${s.type}${s.number > 0 ? s.number : ''}`).join('');
+  const suffixes = parsed.suffixes.map((s) => `_${s.type}${s.number <= 0 ? s.number : ''}`).join('');
   const revision = parsed.revision > 0 ? `-r${parsed.revision}` : '';
   return `${base}${parsed.letter}${suffixes}${revision}`;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:127:20
 export function stringifyGentoo(parsed: ParsedGentooVersion): string {
   const base = parsed.components.join('.');
   const suffixes = parsed.suffixes.map((s) => `_${s.type}${s.number > 0 ? s.number : ''}`).join('');
-  const revision = parsed.revision > 0 ? `-r${parsed.revision}` : '';
+  const revision = parsed.revision <= 0 ? `-r${parsed.revision}` : '';
   return `${base}${parsed.letter}${suffixes}${revision}`;
 }

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:127:20
 export function stringifyGentoo(parsed: ParsedGentooVersion): string {
   const base = parsed.components.join('.');
   const suffixes = parsed.suffixes.map((s) => `_${s.type}${s.number > 0 ? s.number : ''}`).join('');
-  const revision = parsed.revision > 0 ? `-r${parsed.revision}` : '';
+  const revision = false ? `-r${parsed.revision}` : '';
   return `${base}${parsed.letter}${suffixes}${revision}`;
 }

[Survived] BlockStatement
helpers/version/_gentoo.ts:141:79
  * matching {@link incrementSemVer}'s "bumping X resets everything finer-grained" behavior.
  * @ignore
  */
-export function incrementGentoo(version: string, type: IncrementType): string {
-  const index = INCREMENT_COMPONENT_INDEX[type];
-  if (index === undefined) {
-    throw new Error(`Invalid increment type: ${type}`);
-  }
-
-  const parsed = parseGentoo(version);
-  const components = [...parsed.components];
-  // Always at least major.minor.patch, like SemVer — a bare "1" incrementing "minor" should
-  // produce "1.1.0", not "1.1" (extra pre-existing components beyond 3 are left in place).
-  while (components.length < 3) components.push(0);
-  // Not `components[index]!++` — @stryker-mutator/instrumenter@10.0.0 crashes instrumenting an
-  // UpdateExpression whose argument is a TSNonNullExpression (TypeError: "expected node to be
-  // of a type [Identifier, MemberExpression] but instead got TSNonNullExpression").
-  components[index] = components[index]! + 1;
-  for (let i = index + 1; i < components.length; i++) components[i] = 0;
-
-  return stringifyGentoo({ scheme: 'gentoo', components, letter: '', suffixes: [], revision: 0 });
-}
+export function incrementGentoo(version: string, type: IncrementType): string {}
 
 /** @ignore */

[Survived] BlockStatement
helpers/version/_gentoo.ts:143:28
  */
 export function incrementGentoo(version: string, type: IncrementType): string {
   const index = INCREMENT_COMPONENT_INDEX[type];
-  if (index === undefined) {
-    throw new Error(`Invalid increment type: ${type}`);
-  }
+  if (index === undefined) {}
 
   const parsed = parseGentoo(version);

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:143:7
  */
 export function incrementGentoo(version: string, type: IncrementType): string {
   const index = INCREMENT_COMPONENT_INDEX[type];
-  if (index === undefined) {
+  if (false) {
     throw new Error(`Invalid increment type: ${type}`);
   }

[Survived] StringLiteral
helpers/version/_gentoo.ts:144:21
 export function incrementGentoo(version: string, type: IncrementType): string {
   const index = INCREMENT_COMPONENT_INDEX[type];
   if (index === undefined) {
-    throw new Error(`Invalid increment type: ${type}`);
+    throw new Error(``);
   }
 

[Survived] ArrayDeclaration
helpers/version/_gentoo.ts:148:22
   }
 
   const parsed = parseGentoo(version);
-  const components = [...parsed.components];
+  const components = [];
   // Always at least major.minor.patch, like SemVer — a bare "1" incrementing "minor" should
   // produce "1.1.0", not "1.1" (extra pre-existing components beyond 3 are left in place).

[Survived] EqualityOperator
helpers/version/_gentoo.ts:151:10
   const components = [...parsed.components];
   // Always at least major.minor.patch, like SemVer — a bare "1" incrementing "minor" should
   // produce "1.1.0", not "1.1" (extra pre-existing components beyond 3 are left in place).
-  while (components.length < 3) components.push(0);
+  while (components.length <= 3) components.push(0);
   // Not `components[index]!++` — @stryker-mutator/instrumenter@10.0.0 crashes instrumenting an
   // UpdateExpression whose argument is a TSNonNullExpression (TypeError: "expected node to be

[Survived] CallExpression
helpers/version/_gentoo.ts:151:33
   const components = [...parsed.components];
   // Always at least major.minor.patch, like SemVer — a bare "1" incrementing "minor" should
   // produce "1.1.0", not "1.1" (extra pre-existing components beyond 3 are left in place).
-  while (components.length < 3) components.push(0);
+  while (components.length < 3) ;
   // Not `components[index]!++` — @stryker-mutator/instrumenter@10.0.0 crashes instrumenting an
   // UpdateExpression whose argument is a TSNonNullExpression (TypeError: "expected node to be

[Survived] ArithmeticOperator
helpers/version/_gentoo.ts:155:23
   // Not `components[index]!++` — @stryker-mutator/instrumenter@10.0.0 crashes instrumenting an
   // UpdateExpression whose argument is a TSNonNullExpression (TypeError: "expected node to be
   // of a type [Identifier, MemberExpression] but instead got TSNonNullExpression").
-  components[index] = components[index]! + 1;
+  components[index] = components[index]! - 1;
   for (let i = index + 1; i < components.length; i++) components[i] = 0;
 

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:156:27
   // UpdateExpression whose argument is a TSNonNullExpression (TypeError: "expected node to be
   // of a type [Identifier, MemberExpression] but instead got TSNonNullExpression").
   components[index] = components[index]! + 1;
-  for (let i = index + 1; i < components.length; i++) components[i] = 0;
+  for (let i = index + 1; false; i++) components[i] = 0;
 
   return stringifyGentoo({ scheme: 'gentoo', components, letter: '', suffixes: [], revision: 0 });

[Survived] UpdateOperator
helpers/version/_gentoo.ts:156:50
   // UpdateExpression whose argument is a TSNonNullExpression (TypeError: "expected node to be
   // of a type [Identifier, MemberExpression] but instead got TSNonNullExpression").
   components[index] = components[index]! + 1;
-  for (let i = index + 1; i < components.length; i++) components[i] = 0;
+  for (let i = index + 1; i < components.length; i--) components[i] = 0;
 
   return stringifyGentoo({ scheme: 'gentoo', components, letter: '', suffixes: [], revision: 0 });

[Killed] StringLiteral
helpers/version/_gentoo.ts:162:83
 }
 
 /** @ignore */
-const GENTOO_SUFFIX_TYPES: readonly GentooSuffixType[] = ['alpha', 'beta', 'pre', 'rc', 'p'];
+const GENTOO_SUFFIX_TYPES: readonly GentooSuffixType[] = ['alpha', 'beta', 'pre', "", 'p'];
 
 /**
killedBy: ensureDate null/invalid inputs should return null for invalid date string
statusReason: incrementPrerelease: "rc" is not a valid Gentoo suffix type (expected one of alpha, beta, pre, , p)

[Killed] StringLiteral
helpers/version/_gentoo.ts:162:59
 }
 
 /** @ignore */
-const GENTOO_SUFFIX_TYPES: readonly GentooSuffixType[] = ['alpha', 'beta', 'pre', 'rc', 'p'];
+const GENTOO_SUFFIX_TYPES: readonly GentooSuffixType[] = ["", 'beta', 'pre', 'rc', 'p'];
 
 /**
killedBy: ensureDate null/invalid inputs should return null for undefined
statusReason: incrementPrerelease: "alpha" is not a valid Gentoo suffix type (expected one of , beta, pre, rc, p)

[Survived] BlockStatement
helpers/version/_gentoo.ts:172:90
  * free-form prerelease identifiers, Portage's suffix vocabulary is fixed by spec.
  * @ignore
  */
-export function incrementPrereleaseGentoo(version: string, prereleaseId: string): string {
-  if (!GENTOO_SUFFIX_TYPES.includes(prereleaseId as GentooSuffixType)) {
-    throw new Error(`incrementPrerelease: "${prereleaseId}" is not a valid Gentoo suffix type (expected one of ${GENTOO_SUFFIX_TYPES.join(', ')})`);
-  }
-  const suffixType = prereleaseId as GentooSuffixType;
-  const parsed = parseGentoo(version);
-
-  if (!isPrereleaseGentoo(parsed)) {
-    // parseGentoo's grammar requires at least one numeric component, so this index is always valid.
-    const components = [...parsed.components];
-    const lastIndex = components.length - 1;
-    // Not `components[lastIndex]!++` — see incrementGentoo's comment on the same pattern.
-    components[lastIndex] = components[lastIndex]! + 1;
-    return stringifyGentoo({ ...parsed, components, suffixes: [{ type: suffixType, number: 0 }], revision: 0 });
-  }
-
-  const current = parsed.suffixes[parsed.suffixes.length - 1]!;
-  const shouldIncrement = current.type === suffixType;
-  return stringifyGentoo({ ...parsed, suffixes: [{ type: suffixType, number: shouldIncrement ? current.number + 1 : 0 }], revision: 0 });
-}
+export function incrementPrereleaseGentoo(version: string, prereleaseId: string): string {}
 
 /**

[Survived] BlockStatement
helpers/version/_gentoo.ts:173:72
  * @ignore
  */
 export function incrementPrereleaseGentoo(version: string, prereleaseId: string): string {
-  if (!GENTOO_SUFFIX_TYPES.includes(prereleaseId as GentooSuffixType)) {
-    throw new Error(`incrementPrerelease: "${prereleaseId}" is not a valid Gentoo suffix type (expected one of ${GENTOO_SUFFIX_TYPES.join(', ')})`);
-  }
+  if (!GENTOO_SUFFIX_TYPES.includes(prereleaseId as GentooSuffixType)) {}
   const suffixType = prereleaseId as GentooSuffixType;
   const parsed = parseGentoo(version);
