[Survived] ConditionalExpression
helpers/version/_gentoo.ts:173:7
  * @ignore
  */
 export function incrementPrereleaseGentoo(version: string, prereleaseId: string): string {
-  if (!GENTOO_SUFFIX_TYPES.includes(prereleaseId as GentooSuffixType)) {
+  if (true) {
     throw new Error(`incrementPrerelease: "${prereleaseId}" is not a valid Gentoo suffix type (expected one of ${GENTOO_SUFFIX_TYPES.join(', ')})`);
   }

[Survived] BooleanLiteral
helpers/version/_gentoo.ts:179:7
   const suffixType = prereleaseId as GentooSuffixType;
   const parsed = parseGentoo(version);
 
-  if (!isPrereleaseGentoo(parsed)) {
+  if (isPrereleaseGentoo(parsed)) {
     // parseGentoo's grammar requires at least one numeric component, so this index is always valid.
     const components = [...parsed.components];

[Survived] BlockStatement
helpers/version/_gentoo.ts:179:36
   const suffixType = prereleaseId as GentooSuffixType;
   const parsed = parseGentoo(version);
 
-  if (!isPrereleaseGentoo(parsed)) {
-    // parseGentoo's grammar requires at least one numeric component, so this index is always valid.
-    const components = [...parsed.components];
-    const lastIndex = components.length - 1;
-    // Not `components[lastIndex]!++` — see incrementGentoo's comment on the same pattern.
-    components[lastIndex] = components[lastIndex]! + 1;
-    return stringifyGentoo({ ...parsed, components, suffixes: [{ type: suffixType, number: 0 }], revision: 0 });
-  }
+  if (!isPrereleaseGentoo(parsed)) {}
 
   const current = parsed.suffixes[parsed.suffixes.length - 1]!;

[Survived] ArithmeticOperator
helpers/version/_gentoo.ts:182:23
   if (!isPrereleaseGentoo(parsed)) {
     // parseGentoo's grammar requires at least one numeric component, so this index is always valid.
     const components = [...parsed.components];
-    const lastIndex = components.length - 1;
+    const lastIndex = components.length + 1;
     // Not `components[lastIndex]!++` — see incrementGentoo's comment on the same pattern.
     components[lastIndex] = components[lastIndex]! + 1;

[Survived] ArithmeticOperator
helpers/version/_gentoo.ts:184:29
     const components = [...parsed.components];
     const lastIndex = components.length - 1;
     // Not `components[lastIndex]!++` — see incrementGentoo's comment on the same pattern.
-    components[lastIndex] = components[lastIndex]! + 1;
+    components[lastIndex] = components[lastIndex]! - 1;
     return stringifyGentoo({ ...parsed, components, suffixes: [{ type: suffixType, number: 0 }], revision: 0 });
   }

[Survived] ArrayDeclaration
helpers/version/_gentoo.ts:185:63
     const lastIndex = components.length - 1;
     // Not `components[lastIndex]!++` — see incrementGentoo's comment on the same pattern.
     components[lastIndex] = components[lastIndex]! + 1;
-    return stringifyGentoo({ ...parsed, components, suffixes: [{ type: suffixType, number: 0 }], revision: 0 });
+    return stringifyGentoo({ ...parsed, components, suffixes: [], revision: 0 });
   }
 

[Survived] ArithmeticOperator
helpers/version/_gentoo.ts:188:35
     return stringifyGentoo({ ...parsed, components, suffixes: [{ type: suffixType, number: 0 }], revision: 0 });
   }
 
-  const current = parsed.suffixes[parsed.suffixes.length - 1]!;
+  const current = parsed.suffixes[parsed.suffixes.length + 1]!;
   const shouldIncrement = current.type === suffixType;
   return stringifyGentoo({ ...parsed, suffixes: [{ type: suffixType, number: shouldIncrement ? current.number + 1 : 0 }], revision: 0 });

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:189:27
   }
 
   const current = parsed.suffixes[parsed.suffixes.length - 1]!;
-  const shouldIncrement = current.type === suffixType;
+  const shouldIncrement = false;
   return stringifyGentoo({ ...parsed, suffixes: [{ type: suffixType, number: shouldIncrement ? current.number + 1 : 0 }], revision: 0 });
 }

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:189:27
   }
 
   const current = parsed.suffixes[parsed.suffixes.length - 1]!;
-  const shouldIncrement = current.type === suffixType;
+  const shouldIncrement = true;
   return stringifyGentoo({ ...parsed, suffixes: [{ type: suffixType, number: shouldIncrement ? current.number + 1 : 0 }], revision: 0 });
 }

[Survived] ArithmeticOperator
helpers/version/_gentoo.ts:190:96
 
   const current = parsed.suffixes[parsed.suffixes.length - 1]!;
   const shouldIncrement = current.type === suffixType;
-  return stringifyGentoo({ ...parsed, suffixes: [{ type: suffixType, number: shouldIncrement ? current.number + 1 : 0 }], revision: 0 });
+  return stringifyGentoo({ ...parsed, suffixes: [{ type: suffixType, number: shouldIncrement ? current.number - 1 : 0 }], revision: 0 });
 }
 

[Survived] BlockStatement
helpers/version/_gentoo.ts:200:79
  * them here would be actively misleading rather than merely unsupported.
  * @ignore
  */
-export function satisfiesRangeGentoo(version: string, range: string): boolean {
-  if (range.startsWith('^') || range.startsWith('~')) {
-    throw new Error(`satisfiesRange: '${range[0]}' ranges are SemVer-specific and have no Gentoo/Portage equivalent — use >=, >, <=, <, or an exact version instead`);
-  }
-  if (!/[<>=]/.test(range)) {
-    return compareGentoo(version, range) === 0;
-  }
-  if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
-  if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
-  if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;
-  if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) < 0;
-  return false;
-}
+export function satisfiesRangeGentoo(version: string, range: string): boolean {}
 

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:201:7
  * @ignore
  */
 export function satisfiesRangeGentoo(version: string, range: string): boolean {
-  if (range.startsWith('^') || range.startsWith('~')) {
+  if (true) {
     throw new Error(`satisfiesRange: '${range[0]}' ranges are SemVer-specific and have no Gentoo/Portage equivalent — use >=, >, <=, <, or an exact version instead`);
   }

[Survived] MethodExpression
helpers/version/_gentoo.ts:201:32
  * @ignore
  */
 export function satisfiesRangeGentoo(version: string, range: string): boolean {
-  if (range.startsWith('^') || range.startsWith('~')) {
+  if (range.startsWith('^') || range.endsWith('~')) {
     throw new Error(`satisfiesRange: '${range[0]}' ranges are SemVer-specific and have no Gentoo/Portage equivalent — use >=, >, <=, <, or an exact version instead`);
   }

[Survived] BlockStatement
helpers/version/_gentoo.ts:204:29
   if (range.startsWith('^') || range.startsWith('~')) {
     throw new Error(`satisfiesRange: '${range[0]}' ranges are SemVer-specific and have no Gentoo/Portage equivalent — use >=, >, <=, <, or an exact version instead`);
   }
-  if (!/[<>=]/.test(range)) {
-    return compareGentoo(version, range) === 0;
-  }
+  if (!/[<>=]/.test(range)) {}
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
   if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:204:7
   if (range.startsWith('^') || range.startsWith('~')) {
     throw new Error(`satisfiesRange: '${range[0]}' ranges are SemVer-specific and have no Gentoo/Portage equivalent — use >=, >, <=, <, or an exact version instead`);
   }
-  if (!/[<>=]/.test(range)) {
+  if (true) {
     return compareGentoo(version, range) === 0;
   }

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:205:12
     throw new Error(`satisfiesRange: '${range[0]}' ranges are SemVer-specific and have no Gentoo/Portage equivalent — use >=, >, <=, <, or an exact version instead`);
   }
   if (!/[<>=]/.test(range)) {
-    return compareGentoo(version, range) === 0;
+    return false;
   }
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:205:12
     throw new Error(`satisfiesRange: '${range[0]}' ranges are SemVer-specific and have no Gentoo/Portage equivalent — use >=, >, <=, <, or an exact version instead`);
   }
   if (!/[<>=]/.test(range)) {
-    return compareGentoo(version, range) === 0;
+    return compareGentoo(version, range) !== 0;
   }
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:207:38
   if (!/[<>=]/.test(range)) {
     return compareGentoo(version, range) === 0;
   }
-  if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
+  if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) < 0;
   if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
   if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:207:7
   if (!/[<>=]/.test(range)) {
     return compareGentoo(version, range) === 0;
   }
-  if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
+  if (true) return compareGentoo(version, range.slice(2)) >= 0;
   if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
   if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:208:37
     return compareGentoo(version, range) === 0;
   }
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
-  if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
+  if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) <= 0;
   if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;
   if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) < 0;

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:208:7
     return compareGentoo(version, range) === 0;
   }
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
-  if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
+  if (false) return compareGentoo(version, range.slice(1)) > 0;
   if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;
   if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) < 0;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:209:38
   }
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
   if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
-  if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;
+  if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) < 0;
   if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) < 0;
   return false;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:209:38
   }
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
   if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
-  if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;
+  if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) > 0;
   if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) < 0;
   return false;

[Survived] EqualityOperator
helpers/version/_gentoo.ts:210:37
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
   if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
   if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;
-  if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) < 0;
+  if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) >= 0;
   return false;
 }

[Survived] ConditionalExpression
helpers/version/_gentoo.ts:210:7
   if (range.startsWith('>=')) return compareGentoo(version, range.slice(2)) >= 0;
   if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
   if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;
-  if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) < 0;
+  if (false) return compareGentoo(version, range.slice(1)) < 0;
   return false;
 }

[Survived] BooleanLiteral
helpers/version/_gentoo.ts:211:10
   if (range.startsWith('>')) return compareGentoo(version, range.slice(1)) > 0;
   if (range.startsWith('<=')) return compareGentoo(version, range.slice(2)) <= 0;
   if (range.startsWith('<')) return compareGentoo(version, range.slice(1)) < 0;
-  return false;
+  return true;
 }
 
