[Survived] StringLiteral
helpers/version/incrementPrerelease.ts:61:27
 export function incrementPrerelease(
   version: string | undefined | null,
   prereleaseId: string,
-  scheme: VersionScheme = 'semver',
+  scheme: VersionScheme = "",
 ): string | undefined | null {
   if (version === undefined || version === null) return version;

[Survived] BlockStatement
helpers/version/incrementPrerelease.ts:62:30
   version: string | undefined | null,
   prereleaseId: string,
   scheme: VersionScheme = 'semver',
-): string | undefined | null {
-  if (version === undefined || version === null) return version;
-  switch (scheme) {
-    case 'semver':
-      return incrementPrereleaseSemVer(version, prereleaseId);
-    case 'gentoo':
-      return incrementPrereleaseGentoo(version, prereleaseId);
-    default:
-      return assertNeverScheme(scheme);
-  }
-}
+): string | undefined | null {}
 

[Survived] ConditionalExpression
helpers/version/incrementPrerelease.ts:63:32
   prereleaseId: string,
   scheme: VersionScheme = 'semver',
 ): string | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (version === undefined || false) return version;
   switch (scheme) {
     case 'semver':

[Survived] ConditionalExpression
helpers/version/incrementPrerelease.ts:63:7
   prereleaseId: string,
   scheme: VersionScheme = 'semver',
 ): string | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (false) return version;
   switch (scheme) {
     case 'semver':

[Survived] ConditionalExpression
helpers/version/incrementPrerelease.ts:65:5
 ): string | undefined | null {
   if (version === undefined || version === null) return version;
   switch (scheme) {
-    case 'semver':
-      return incrementPrereleaseSemVer(version, prereleaseId);
+    case 'semver':
     case 'gentoo':
       return incrementPrereleaseGentoo(version, prereleaseId);

[Survived] ConditionalExpression
helpers/version/incrementPrerelease.ts:67:5
   switch (scheme) {
     case 'semver':
       return incrementPrereleaseSemVer(version, prereleaseId);
-    case 'gentoo':
-      return incrementPrereleaseGentoo(version, prereleaseId);
+    case 'gentoo':
     default:
       return assertNeverScheme(scheme);

[Survived] ConditionalExpression
helpers/version/incrementPrerelease.ts:69:5
       return incrementPrereleaseSemVer(version, prereleaseId);
     case 'gentoo':
       return incrementPrereleaseGentoo(version, prereleaseId);
-    default:
-      return assertNeverScheme(scheme);
+    default:
   }
 }
