[Survived] BlockStatement
helpers/version/stringify.ts:36:99
 export function stringify(parsed: AnyParsedVersion): string;
 export function stringify(parsed: undefined): undefined;
 export function stringify(parsed: null): null;
-export function stringify(parsed: AnyParsedVersion | undefined | null): string | undefined | null {
-  if (parsed === undefined || parsed === null) return parsed;
-  switch (parsed.scheme) {
-    case 'semver':
-      return stringifySemVer(parsed);
-    case 'gentoo':
-      return stringifyGentoo(parsed);
-    default:
-      return assertNeverScheme(parsed);
-  }
-}
+export function stringify(parsed: AnyParsedVersion | undefined | null): string | undefined | null {}
 

[Survived] EqualityOperator
helpers/version/stringify.ts:37:7
 export function stringify(parsed: undefined): undefined;
 export function stringify(parsed: null): null;
 export function stringify(parsed: AnyParsedVersion | undefined | null): string | undefined | null {
-  if (parsed === undefined || parsed === null) return parsed;
+  if (parsed !== undefined || parsed === null) return parsed;
   switch (parsed.scheme) {
     case 'semver':

[Survived] ConditionalExpression
helpers/version/stringify.ts:37:31
 export function stringify(parsed: undefined): undefined;
 export function stringify(parsed: null): null;
 export function stringify(parsed: AnyParsedVersion | undefined | null): string | undefined | null {
-  if (parsed === undefined || parsed === null) return parsed;
+  if (parsed === undefined || false) return parsed;
   switch (parsed.scheme) {
     case 'semver':

[Survived] ConditionalExpression
helpers/version/stringify.ts:39:5
 export function stringify(parsed: AnyParsedVersion | undefined | null): string | undefined | null {
   if (parsed === undefined || parsed === null) return parsed;
   switch (parsed.scheme) {
-    case 'semver':
-      return stringifySemVer(parsed);
+    case 'semver':
     case 'gentoo':
       return stringifyGentoo(parsed);

[Survived] StringLiteral
helpers/version/stringify.ts:39:10
 export function stringify(parsed: AnyParsedVersion | undefined | null): string | undefined | null {
   if (parsed === undefined || parsed === null) return parsed;
   switch (parsed.scheme) {
-    case 'semver':
+    case "":
       return stringifySemVer(parsed);
     case 'gentoo':

[Survived] ConditionalExpression
helpers/version/stringify.ts:41:5
   switch (parsed.scheme) {
     case 'semver':
       return stringifySemVer(parsed);
-    case 'gentoo':
-      return stringifyGentoo(parsed);
+    case 'gentoo':
     default:
       return assertNeverScheme(parsed);

[Survived] StringLiteral
helpers/version/stringify.ts:41:10
   switch (parsed.scheme) {
     case 'semver':
       return stringifySemVer(parsed);
-    case 'gentoo':
+    case "":
       return stringifyGentoo(parsed);
     default:

[Survived] ConditionalExpression
helpers/version/stringify.ts:43:5
       return stringifySemVer(parsed);
     case 'gentoo':
       return stringifyGentoo(parsed);
-    default:
-      return assertNeverScheme(parsed);
+    default:
   }
 }
