[Survived] BlockStatement
helpers/_shared/_validatePositiveCount.ts:18:77
  * @throws {RangeError} If `value` is not `>= 1`
  * @ignore
  */
-export function validatePositiveCount(value: number, label: string): number {
-  if (!(value >= 1)) {
-    throw new RangeError(`${label} must be a positive number or Infinity, got ${value}`);
-  }
-  return Math.floor(value);
-}
+export function validatePositiveCount(value: number, label: string): number {}
 

[Survived] EqualityOperator
helpers/_shared/_validatePositiveCount.ts:19:9
  * @ignore
  */
 export function validatePositiveCount(value: number, label: string): number {
-  if (!(value >= 1)) {
+  if (!(value > 1)) {
     throw new RangeError(`${label} must be a positive number or Infinity, got ${value}`);
   }

[Survived] BooleanLiteral
helpers/_shared/_validatePositiveCount.ts:19:7
  * @ignore
  */
 export function validatePositiveCount(value: number, label: string): number {
-  if (!(value >= 1)) {
+  if (value >= 1) {
     throw new RangeError(`${label} must be a positive number or Infinity, got ${value}`);
   }

[Survived] StringLiteral
helpers/_shared/_validatePositiveCount.ts:20:26
  */
 export function validatePositiveCount(value: number, label: string): number {
   if (!(value >= 1)) {
-    throw new RangeError(`${label} must be a positive number or Infinity, got ${value}`);
+    throw new RangeError(``);
   }
   return Math.floor(value);
