[Killed] ArrowFunction
helpers/array/_sortHelpers.ts:21:34
 
 /** Lazy singleton — case- and accent-sensitive (`sensitivity: 'variant'`). @ignore */
 let stringCollatorCache: Intl.Collator | undefined;
-export const getStringCollator = (): Intl.Collator =>
-  (stringCollatorCache ??= new Intl.Collator(undefined, { sensitivity: 'variant' }));
+export const getStringCollator = () => undefined;
 
 /** Lazy singleton — case-insensitive but accent-sensitive (`sensitivity: 'accent'`). @ignore */
killedBy: normalizeTimestamp — contract large ms timestamp → unchanged
statusReason: Cannot read properties of undefined (reading 'compare')

[Survived] AssignmentOperator
helpers/array/_sortHelpers.ts:22:4
 /** Lazy singleton — case- and accent-sensitive (`sensitivity: 'variant'`). @ignore */
 let stringCollatorCache: Intl.Collator | undefined;
 export const getStringCollator = (): Intl.Collator =>
-  (stringCollatorCache ??= new Intl.Collator(undefined, { sensitivity: 'variant' }));
+  (stringCollatorCache &&= new Intl.Collator(undefined, {
+  sensitivity: 'variant'
+}));
 
 /** Lazy singleton — case-insensitive but accent-sensitive (`sensitivity: 'accent'`). @ignore */

[Survived] ObjectLiteral
helpers/array/_sortHelpers.ts:22:57
 /** Lazy singleton — case- and accent-sensitive (`sensitivity: 'variant'`). @ignore */
 let stringCollatorCache: Intl.Collator | undefined;
 export const getStringCollator = (): Intl.Collator =>
-  (stringCollatorCache ??= new Intl.Collator(undefined, { sensitivity: 'variant' }));
+  (stringCollatorCache ??= new Intl.Collator(undefined, {}));
 
 /** Lazy singleton — case-insensitive but accent-sensitive (`sensitivity: 'accent'`). @ignore */

[Killed] ArrowFunction
helpers/array/_sortHelpers.ts:26:45
 
 /** Lazy singleton — case-insensitive but accent-sensitive (`sensitivity: 'accent'`). @ignore */
 let stringCollatorInsensitiveCache: Intl.Collator | undefined;
-export const getStringCollatorInsensitive = (): Intl.Collator =>
-  (stringCollatorInsensitiveCache ??= new Intl.Collator(undefined, { sensitivity: 'accent' }));
+export const getStringCollatorInsensitive = () => undefined;
 
 /**
killedBy: isTimestampInSeconds — contract 9_999_999_999 → true
statusReason: Cannot read properties of undefined (reading 'compare')

[Survived] AssignmentOperator
helpers/array/_sortHelpers.ts:27:4
 /** Lazy singleton — case-insensitive but accent-sensitive (`sensitivity: 'accent'`). @ignore */
 let stringCollatorInsensitiveCache: Intl.Collator | undefined;
 export const getStringCollatorInsensitive = (): Intl.Collator =>
-  (stringCollatorInsensitiveCache ??= new Intl.Collator(undefined, { sensitivity: 'accent' }));
+  (stringCollatorInsensitiveCache &&= new Intl.Collator(undefined, {
+  sensitivity: 'accent'
+}));
 
 /**

[Survived] BlockStatement
helpers/array/_sortHelpers.ts:40:37
  */
 export function normalizePropertyToKeys<T>(
   property: keyof T | readonly (keyof T)[] | undefined,
-): readonly (keyof T)[] | undefined {
-  if (property === undefined) return undefined;
-  if (Array.isArray(property)) return property as readonly (keyof T)[];
-  return [property as keyof T];
-}
+): readonly (keyof T)[] | undefined {}
 
 /**

[Survived] ConditionalExpression
helpers/array/_sortHelpers.ts:41:7
 export function normalizePropertyToKeys<T>(
   property: keyof T | readonly (keyof T)[] | undefined,
 ): readonly (keyof T)[] | undefined {
-  if (property === undefined) return undefined;
+  if (true) return undefined;
   if (Array.isArray(property)) return property as readonly (keyof T)[];
   return [property as keyof T];

[Survived] ConditionalExpression
helpers/array/_sortHelpers.ts:41:7
 export function normalizePropertyToKeys<T>(
   property: keyof T | readonly (keyof T)[] | undefined,
 ): readonly (keyof T)[] | undefined {
-  if (property === undefined) return undefined;
+  if (false) return undefined;
   if (Array.isArray(property)) return property as readonly (keyof T)[];
   return [property as keyof T];

[Survived] ConditionalExpression
helpers/array/_sortHelpers.ts:42:7
   property: keyof T | readonly (keyof T)[] | undefined,
 ): readonly (keyof T)[] | undefined {
   if (property === undefined) return undefined;
-  if (Array.isArray(property)) return property as readonly (keyof T)[];
+  if (true) return property as readonly (keyof T)[];
   return [property as keyof T];
 }

[Survived] ConditionalExpression
helpers/array/_sortHelpers.ts:42:7
   property: keyof T | readonly (keyof T)[] | undefined,
 ): readonly (keyof T)[] | undefined {
   if (property === undefined) return undefined;
-  if (Array.isArray(property)) return property as readonly (keyof T)[];
+  if (false) return property as readonly (keyof T)[];
   return [property as keyof T];
 }

[Survived] ArrayDeclaration
helpers/array/_sortHelpers.ts:43:10
 ): readonly (keyof T)[] | undefined {
   if (property === undefined) return undefined;
   if (Array.isArray(property)) return property as readonly (keyof T)[];
-  return [property as keyof T];
+  return [];
 }
 

[Survived] BlockStatement
helpers/array/_sortHelpers.ts:60:14
 export function buildCollatorCompareFn<T extends Record<string, unknown>>(
   collator: Intl.Collator,
   keys: readonly (keyof T)[] | undefined,
-): SortFn<T> {
-  return (a: T, b: T) => {
-    if (keys !== undefined) {
-      for (const key of keys) {
-        const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));
-        if (cmp !== 0) return cmp;
-      }
-      return 0;
-    }
-    for (const prop of DEFAULT_SORT_STRING_PROPS) {
-      // Object.hasOwn (not `in`) — only own properties trigger auto-detect;
-      // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
-      if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
-        const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
-        if (cmp !== 0) return cmp;
-      }
-    }
-    return 0;
-  };
-}
+): SortFn<T> {}
 

[Survived] BlockStatement
helpers/array/_sortHelpers.ts:61:26
   collator: Intl.Collator,
   keys: readonly (keyof T)[] | undefined,
 ): SortFn<T> {
-  return (a: T, b: T) => {
-    if (keys !== undefined) {
-      for (const key of keys) {
-        const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));
-        if (cmp !== 0) return cmp;
-      }
-      return 0;
-    }
-    for (const prop of DEFAULT_SORT_STRING_PROPS) {
-      // Object.hasOwn (not `in`) — only own properties trigger auto-detect;
-      // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
-      if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
-        const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
-        if (cmp !== 0) return cmp;
-      }
-    }
-    return 0;
-  };
+  return (a: T, b: T) => {};
 }
 

[Survived] BlockStatement
helpers/array/_sortHelpers.ts:62:29
   keys: readonly (keyof T)[] | undefined,
 ): SortFn<T> {
   return (a: T, b: T) => {
-    if (keys !== undefined) {
-      for (const key of keys) {
-        const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));
-        if (cmp !== 0) return cmp;
-      }
-      return 0;
-    }
+    if (keys !== undefined) {}
     for (const prop of DEFAULT_SORT_STRING_PROPS) {
       // Object.hasOwn (not `in`) — only own properties trigger auto-detect;

[Survived] ConditionalExpression
helpers/array/_sortHelpers.ts:62:9
   keys: readonly (keyof T)[] | undefined,
 ): SortFn<T> {
   return (a: T, b: T) => {
-    if (keys !== undefined) {
+    if (false) {
       for (const key of keys) {
         const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));

[Survived] BlockStatement
helpers/array/_sortHelpers.ts:63:31
 ): SortFn<T> {
   return (a: T, b: T) => {
     if (keys !== undefined) {
-      for (const key of keys) {
-        const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));
-        if (cmp !== 0) return cmp;
-      }
+      for (const key of keys) {}
       return 0;
     }

[Survived] LogicalOperator
helpers/array/_sortHelpers.ts:64:67
   return (a: T, b: T) => {
     if (keys !== undefined) {
       for (const key of keys) {
-        const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));
+        const cmp = collator.compare(String(a[key] ?? ''), String(b[key] && ''));
         if (cmp !== 0) return cmp;
       }

[Survived] LogicalOperator
helpers/array/_sortHelpers.ts:64:45
   return (a: T, b: T) => {
     if (keys !== undefined) {
       for (const key of keys) {
-        const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));
+        const cmp = collator.compare(String(a[key] && ''), String(b[key] ?? ''));
         if (cmp !== 0) return cmp;
       }

[Survived] EqualityOperator
helpers/array/_sortHelpers.ts:65:13
     if (keys !== undefined) {
       for (const key of keys) {
         const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));
-        if (cmp !== 0) return cmp;
+        if (cmp === 0) return cmp;
       }
       return 0;

[Survived] ConditionalExpression
helpers/array/_sortHelpers.ts:65:13
     if (keys !== undefined) {
       for (const key of keys) {
         const cmp = collator.compare(String(a[key] ?? ''), String(b[key] ?? ''));
-        if (cmp !== 0) return cmp;
+        if (false) return cmp;
       }
       return 0;

[Survived] BlockStatement
helpers/array/_sortHelpers.ts:69:51
       }
       return 0;
     }
-    for (const prop of DEFAULT_SORT_STRING_PROPS) {
-      // Object.hasOwn (not `in`) — only own properties trigger auto-detect;
-      // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
-      if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
-        const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
-        if (cmp !== 0) return cmp;
-      }
-    }
+    for (const prop of DEFAULT_SORT_STRING_PROPS) {}
     return 0;
   };

[Survived] LogicalOperator
helpers/array/_sortHelpers.ts:72:11
     for (const prop of DEFAULT_SORT_STRING_PROPS) {
       // Object.hasOwn (not `in`) — only own properties trigger auto-detect;
       // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
-      if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
+      if (Object.hasOwn(a, prop) || Object.hasOwn(b, prop)) {
         const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
         if (cmp !== 0) return cmp;

[Survived] ConditionalExpression
helpers/array/_sortHelpers.ts:72:11
     for (const prop of DEFAULT_SORT_STRING_PROPS) {
       // Object.hasOwn (not `in`) — only own properties trigger auto-detect;
       // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
-      if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
+      if (false) {
         const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
         if (cmp !== 0) return cmp;

[Survived] LogicalOperator
helpers/array/_sortHelpers.ts:73:45
       // Object.hasOwn (not `in`) — only own properties trigger auto-detect;
       // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
       if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
-        const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
+        const cmp = collator.compare(String(a[prop as keyof T] && ''), String(b[prop as keyof T] ?? ''));
         if (cmp !== 0) return cmp;
       }

[Survived] LogicalOperator
helpers/array/_sortHelpers.ts:73:79
       // Object.hasOwn (not `in`) — only own properties trigger auto-detect;
       // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
       if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
-        const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
+        const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] && ''));
         if (cmp !== 0) return cmp;
       }

[Survived] ConditionalExpression
helpers/array/_sortHelpers.ts:74:13
       // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
       if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
         const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
-        if (cmp !== 0) return cmp;
+        if (false) return cmp;
       }
     }

[Survived] EqualityOperator
helpers/array/_sortHelpers.ts:74:13
       // inherited value/label/title/description (e.g. Object.create({label:'x'})) are ignored.
       if (Object.hasOwn(a, prop) && Object.hasOwn(b, prop)) {
         const cmp = collator.compare(String(a[prop as keyof T] ?? ''), String(b[prop as keyof T] ?? ''));
-        if (cmp !== 0) return cmp;
+        if (cmp === 0) return cmp;
       }
     }
