[Survived] BlockStatement
helpers/array/compact.ts:21:99
  * compact(undefined) // => []
  * @since 2.0.0
  */
-export function compact<T>(array: readonly (T | Falsy)[] | null | undefined): Exclude<T, Falsy>[] {
-  if (array == null) return [];
-  return array.filter(v => !isFalsy(v)) as Exclude<T, Falsy>[];
-}
+export function compact<T>(array: readonly (T | Falsy)[] | null | undefined): Exclude<T, Falsy>[] {}
 

[Survived] ConditionalExpression
helpers/array/compact.ts:22:7
  * @since 2.0.0
  */
 export function compact<T>(array: readonly (T | Falsy)[] | null | undefined): Exclude<T, Falsy>[] {
-  if (array == null) return [];
+  if (false) return [];
   return array.filter(v => !isFalsy(v)) as Exclude<T, Falsy>[];
 }

[Survived] EqualityOperator
helpers/array/compact.ts:22:7
  * @since 2.0.0
  */
 export function compact<T>(array: readonly (T | Falsy)[] | null | undefined): Exclude<T, Falsy>[] {
-  if (array == null) return [];
+  if (array != null) return [];
   return array.filter(v => !isFalsy(v)) as Exclude<T, Falsy>[];
 }
