[Survived] BlockStatement
helpers/array/filterAsync.ts:30:17
   array: readonly T[],
   predicate: (item: T, index: number) => boolean | Promise<boolean>,
   concurrency?: number,
-): Promise<T[]> {
-  const keep = await runConcurrentMap(array, predicate, concurrency);
-  return array.filter((_, index) => keep[index]);
-}
+): Promise<T[]> {}
 

[Survived] ArrowFunction
helpers/array/filterAsync.ts:32:23
   concurrency?: number,
 ): Promise<T[]> {
   const keep = await runConcurrentMap(array, predicate, concurrency);
-  return array.filter((_, index) => keep[index]);
+  return array.filter(() => undefined);
 }
 

[Survived] MethodExpression
helpers/array/filterAsync.ts:32:10
   concurrency?: number,
 ): Promise<T[]> {
   const keep = await runConcurrentMap(array, predicate, concurrency);
-  return array.filter((_, index) => keep[index]);
+  return array;
 }
 
