[Survived] BlockStatement
helpers/array/intersects.ts:16:112
  * @returns `true` if one item is in common, `false` otherwise.
  * @since 1.0.0
  */
-export function intersects<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): boolean {
-  if (a == null || b == null || a.length === 0 || b.length === 0) return false;
-  const setB = new Set(b);
-  return a.some((i) => setB.has(i));
-}
+export function intersects<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): boolean {}
 

[Survived] LogicalOperator
helpers/array/intersects.ts:17:7
  * @since 1.0.0
  */
 export function intersects<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): boolean {
-  if (a == null || b == null || a.length === 0 || b.length === 0) return false;
+  if ((a == null || b == null) && a.length === 0 || b.length === 0) return false;
   const setB = new Set(b);
   return a.some((i) => setB.has(i));

[Survived] LogicalOperator
helpers/array/intersects.ts:17:7
  * @since 1.0.0
  */
 export function intersects<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): boolean {
-  if (a == null || b == null || a.length === 0 || b.length === 0) return false;
+  if (a == null && b == null || a.length === 0 || b.length === 0) return false;
   const setB = new Set(b);
   return a.some((i) => setB.has(i));

[Survived] MethodExpression
helpers/array/intersects.ts:19:10
 export function intersects<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): boolean {
   if (a == null || b == null || a.length === 0 || b.length === 0) return false;
   const setB = new Set(b);
-  return a.some((i) => setB.has(i));
+  return a.every(i => setB.has(i));
 }
 

[Survived] ArrowFunction
helpers/array/intersects.ts:19:17
 export function intersects<T>(a: readonly T[] | null | undefined, b: readonly T[] | null | undefined): boolean {
   if (a == null || b == null || a.length === 0 || b.length === 0) return false;
   const setB = new Set(b);
-  return a.some((i) => setB.has(i));
+  return a.some(() => undefined);
 }
 
