[Survived] BlockStatement
helpers/array/max.ts:20:86
  * max(null)                // => undefined
  * @since 2.0.2
  */
-export function max(array: readonly number[] | null | undefined): number | undefined {
-  if (array == null || array.length === 0) return undefined;
-  let result = -Infinity;
-  for (const val of array) {
-    if (Number.isNaN(val)) return NaN;
-    if (val > result || (Object.is(val, 0) && Object.is(result, -0))) result = val;
-  }
-  return result;
-}
+export function max(array: readonly number[] | null | undefined): number | undefined {}
 

[Survived] EqualityOperator
helpers/array/max.ts:21:24
  * @since 2.0.2
  */
 export function max(array: readonly number[] | null | undefined): number | undefined {
-  if (array == null || array.length === 0) return undefined;
+  if (array == null || array.length !== 0) return undefined;
   let result = -Infinity;
   for (const val of array) {

[Survived] ConditionalExpression
helpers/array/max.ts:21:24
  * @since 2.0.2
  */
 export function max(array: readonly number[] | null | undefined): number | undefined {
-  if (array == null || array.length === 0) return undefined;
+  if (array == null || false) return undefined;
   let result = -Infinity;
   for (const val of array) {

[Survived] UnaryOperator
helpers/array/max.ts:22:16
  */
 export function max(array: readonly number[] | null | undefined): number | undefined {
   if (array == null || array.length === 0) return undefined;
-  let result = -Infinity;
+  let result = +Infinity;
   for (const val of array) {
     if (Number.isNaN(val)) return NaN;

[Survived] BlockStatement
helpers/array/max.ts:23:28
 export function max(array: readonly number[] | null | undefined): number | undefined {
   if (array == null || array.length === 0) return undefined;
   let result = -Infinity;
-  for (const val of array) {
-    if (Number.isNaN(val)) return NaN;
-    if (val > result || (Object.is(val, 0) && Object.is(result, -0))) result = val;
-  }
+  for (const val of array) {}
   return result;
 }

[Survived] ConditionalExpression
helpers/array/max.ts:24:9
   if (array == null || array.length === 0) return undefined;
   let result = -Infinity;
   for (const val of array) {
-    if (Number.isNaN(val)) return NaN;
+    if (true) return NaN;
     if (val > result || (Object.is(val, 0) && Object.is(result, -0))) result = val;
   }

[Survived] ConditionalExpression
helpers/array/max.ts:24:9
   if (array == null || array.length === 0) return undefined;
   let result = -Infinity;
   for (const val of array) {
-    if (Number.isNaN(val)) return NaN;
+    if (false) return NaN;
     if (val > result || (Object.is(val, 0) && Object.is(result, -0))) result = val;
   }

[Survived] LogicalOperator
helpers/array/max.ts:25:9
   let result = -Infinity;
   for (const val of array) {
     if (Number.isNaN(val)) return NaN;
-    if (val > result || (Object.is(val, 0) && Object.is(result, -0))) result = val;
+    if (val > result && Object.is(val, 0) && Object.is(result, -0)) result = val;
   }
   return result;

[Survived] UnaryOperator
helpers/array/max.ts:25:65
   let result = -Infinity;
   for (const val of array) {
     if (Number.isNaN(val)) return NaN;
-    if (val > result || (Object.is(val, 0) && Object.is(result, -0))) result = val;
+    if (val > result || (Object.is(val, 0) && Object.is(result, +0))) result = val;
   }
   return result;
