[Survived] BlockStatement
helpers/array/median.ts:24:58
  * median([])            // => NaN
  * @since 3.0.3
  */
-export function median(array: readonly number[]): number {
-  return percentile(array, 50);
-}
+export function median(array: readonly number[]): number {}
 
