[Survived] BlockStatement
helpers/array/percentile.ts:19:73
  * percentile([1, 2, 3, 4], 100) // => 4 (the max)
  * @since 3.0.3
  */
-export function percentile(array: readonly number[], p: number): number {
-  if (array.length === 0) return NaN;
-  const sorted = array.toSorted((a, b) => a - b);
-  if (p <= 0) return sorted[0]!;
-  if (p >= 100) return sorted[sorted.length - 1]!;
-
-  const index = (p / 100) * (sorted.length - 1);
-  const lower = Math.floor(index);
-  const upper = Math.ceil(index);
-  if (lower === upper) return sorted[lower]!;
-
-  const fraction = index - lower;
-  return sorted[lower]! + (sorted[upper]! - sorted[lower]!) * fraction;
-}
+export function percentile(array: readonly number[], p: number): number {}
 

[Survived] ConditionalExpression
helpers/array/percentile.ts:20:7
  * @since 3.0.3
  */
 export function percentile(array: readonly number[], p: number): number {
-  if (array.length === 0) return NaN;
+  if (true) return NaN;
   const sorted = array.toSorted((a, b) => a - b);
   if (p <= 0) return sorted[0]!;

[Survived] EqualityOperator
helpers/array/percentile.ts:20:7
  * @since 3.0.3
  */
 export function percentile(array: readonly number[], p: number): number {
-  if (array.length === 0) return NaN;
+  if (array.length !== 0) return NaN;
   const sorted = array.toSorted((a, b) => a - b);
   if (p <= 0) return sorted[0]!;

[Survived] ArithmeticOperator
helpers/array/percentile.ts:21:43
  */
 export function percentile(array: readonly number[], p: number): number {
   if (array.length === 0) return NaN;
-  const sorted = array.toSorted((a, b) => a - b);
+  const sorted = array.toSorted((a, b) => a + b);
   if (p <= 0) return sorted[0]!;
   if (p >= 100) return sorted[sorted.length - 1]!;

[Survived] ArrowFunction
helpers/array/percentile.ts:21:33
  */
 export function percentile(array: readonly number[], p: number): number {
   if (array.length === 0) return NaN;
-  const sorted = array.toSorted((a, b) => a - b);
+  const sorted = array.toSorted(() => undefined);
   if (p <= 0) return sorted[0]!;
   if (p >= 100) return sorted[sorted.length - 1]!;

[Survived] ConditionalExpression
helpers/array/percentile.ts:22:7
 export function percentile(array: readonly number[], p: number): number {
   if (array.length === 0) return NaN;
   const sorted = array.toSorted((a, b) => a - b);
-  if (p <= 0) return sorted[0]!;
+  if (false) return sorted[0]!;
   if (p >= 100) return sorted[sorted.length - 1]!;
 

[Survived] ConditionalExpression
helpers/array/percentile.ts:22:7
 export function percentile(array: readonly number[], p: number): number {
   if (array.length === 0) return NaN;
   const sorted = array.toSorted((a, b) => a - b);
-  if (p <= 0) return sorted[0]!;
+  if (true) return sorted[0]!;
   if (p >= 100) return sorted[sorted.length - 1]!;
 

[Survived] ArithmeticOperator
helpers/array/percentile.ts:23:31
   if (array.length === 0) return NaN;
   const sorted = array.toSorted((a, b) => a - b);
   if (p <= 0) return sorted[0]!;
-  if (p >= 100) return sorted[sorted.length - 1]!;
+  if (p >= 100) return sorted[sorted.length + 1]!;
 
   const index = (p / 100) * (sorted.length - 1);

[Survived] ConditionalExpression
helpers/array/percentile.ts:23:7
   if (array.length === 0) return NaN;
   const sorted = array.toSorted((a, b) => a - b);
   if (p <= 0) return sorted[0]!;
-  if (p >= 100) return sorted[sorted.length - 1]!;
+  if (true) return sorted[sorted.length - 1]!;
 
   const index = (p / 100) * (sorted.length - 1);

[Survived] ArithmeticOperator
helpers/array/percentile.ts:25:30
   if (p <= 0) return sorted[0]!;
   if (p >= 100) return sorted[sorted.length - 1]!;
 
-  const index = (p / 100) * (sorted.length - 1);
+  const index = (p / 100) * (sorted.length + 1);
   const lower = Math.floor(index);
   const upper = Math.ceil(index);

[Survived] ArithmeticOperator
helpers/array/percentile.ts:25:18
   if (p <= 0) return sorted[0]!;
   if (p >= 100) return sorted[sorted.length - 1]!;
 
-  const index = (p / 100) * (sorted.length - 1);
+  const index = (p * 100) * (sorted.length - 1);
   const lower = Math.floor(index);
   const upper = Math.ceil(index);

[Survived] EqualityOperator
helpers/array/percentile.ts:28:7
   const index = (p / 100) * (sorted.length - 1);
   const lower = Math.floor(index);
   const upper = Math.ceil(index);
-  if (lower === upper) return sorted[lower]!;
+  if (lower !== upper) return sorted[lower]!;
 
   const fraction = index - lower;

[Survived] ConditionalExpression
helpers/array/percentile.ts:28:7
   const index = (p / 100) * (sorted.length - 1);
   const lower = Math.floor(index);
   const upper = Math.ceil(index);
-  if (lower === upper) return sorted[lower]!;
+  if (true) return sorted[lower]!;
 
   const fraction = index - lower;

[Survived] ArithmeticOperator
helpers/array/percentile.ts:30:20
   const upper = Math.ceil(index);
   if (lower === upper) return sorted[lower]!;
 
-  const fraction = index - lower;
+  const fraction = index + lower;
   return sorted[lower]! + (sorted[upper]! - sorted[lower]!) * fraction;
 }

[Survived] ArithmeticOperator
helpers/array/percentile.ts:31:27
   if (lower === upper) return sorted[lower]!;
 
   const fraction = index - lower;
-  return sorted[lower]! + (sorted[upper]! - sorted[lower]!) * fraction;
+  return sorted[lower]! + (sorted[upper]! - sorted[lower]!) / fraction;
 }
 

[Survived] ArithmeticOperator
helpers/array/percentile.ts:31:10
   if (lower === upper) return sorted[lower]!;
 
   const fraction = index - lower;
-  return sorted[lower]! + (sorted[upper]! - sorted[lower]!) * fraction;
+  return sorted[lower]! - (sorted[upper]! - sorted[lower]!) * fraction;
 }
 
