[Survived] BooleanLiteral
helpers/array/select.ts:39:58
 export function select<T, U>(
   array: readonly T[] | null | undefined,
   mapper: (item: T, index: number) => U,
-  condition: (item: T, index: number) => boolean = () => true,
+  condition: (item: T, index: number) => boolean = () => false,
 ): U[] {
   const result: U[] = [];

[Survived] ArrowFunction
helpers/array/select.ts:39:52
 export function select<T, U>(
   array: readonly T[] | null | undefined,
   mapper: (item: T, index: number) => U,
-  condition: (item: T, index: number) => boolean = () => true,
+  condition: (item: T, index: number) => boolean = () => undefined,
 ): U[] {
   const result: U[] = [];

[Survived] BlockStatement
helpers/array/select.ts:40:8
   array: readonly T[] | null | undefined,
   mapper: (item: T, index: number) => U,
   condition: (item: T, index: number) => boolean = () => true,
-): U[] {
-  const result: U[] = [];
-  if (array == null) return result;
-  for (let i = 0; i < array.length; i++) {
-    if (condition(array[i], i)) {
-      result.push(mapper(array[i], i));
-    }
-  }
-  return result;
-}
+): U[] {}
 

[Survived] ConditionalExpression
helpers/array/select.ts:42:7
   condition: (item: T, index: number) => boolean = () => true,
 ): U[] {
   const result: U[] = [];
-  if (array == null) return result;
+  if (true) return result;
   for (let i = 0; i < array.length; i++) {
     if (condition(array[i], i)) {

[Survived] ConditionalExpression
helpers/array/select.ts:42:7
   condition: (item: T, index: number) => boolean = () => true,
 ): U[] {
   const result: U[] = [];
-  if (array == null) return result;
+  if (false) return result;
   for (let i = 0; i < array.length; i++) {
     if (condition(array[i], i)) {

[Survived] EqualityOperator
helpers/array/select.ts:43:19
 ): U[] {
   const result: U[] = [];
   if (array == null) return result;
-  for (let i = 0; i < array.length; i++) {
+  for (let i = 0; i <= array.length; i++) {
     if (condition(array[i], i)) {
       result.push(mapper(array[i], i));

[Survived] ConditionalExpression
helpers/array/select.ts:43:19
 ): U[] {
   const result: U[] = [];
   if (array == null) return result;
-  for (let i = 0; i < array.length; i++) {
+  for (let i = 0; false; i++) {
     if (condition(array[i], i)) {
       result.push(mapper(array[i], i));

[Survived] BlockStatement
helpers/array/select.ts:44:33
   const result: U[] = [];
   if (array == null) return result;
   for (let i = 0; i < array.length; i++) {
-    if (condition(array[i], i)) {
-      result.push(mapper(array[i], i));
-    }
+    if (condition(array[i], i)) {}
   }
   return result;

[Survived] ConditionalExpression
helpers/array/select.ts:44:9
   const result: U[] = [];
   if (array == null) return result;
   for (let i = 0; i < array.length; i++) {
-    if (condition(array[i], i)) {
+    if (false) {
       result.push(mapper(array[i], i));
     }

[Survived] CallExpression
helpers/array/select.ts:45:7
   if (array == null) return result;
   for (let i = 0; i < array.length; i++) {
     if (condition(array[i], i)) {
-      result.push(mapper(array[i], i));
+      ;
     }
   }
