[Killed] ArrowFunction
helpers/array/sortNatural.ts:15:28
 let naturalCollatorCache: Intl.Collator | undefined;
 let naturalCollatorInsensitiveCache: Intl.Collator | undefined;
 
-const getNaturalCollator = (): Intl.Collator =>
-  (naturalCollatorCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'variant' }));
+const getNaturalCollator = () => undefined;
 
 const getNaturalCollatorInsensitive = (): Intl.Collator =>
killedBy: isPrerelease — string input stable with build metadata → false
statusReason: Property failed after 1 tests
{ seed: 1517402245, path: "0:3", endOnFailure: true }
Counterexample: [["",""]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BooleanLiteral
helpers/array/sortNatural.ts:16:69
 let naturalCollatorInsensitiveCache: Intl.Collator | undefined;
 
 const getNaturalCollator = (): Intl.Collator =>
-  (naturalCollatorCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'variant' }));
+  (naturalCollatorCache ??= new Intl.Collator(undefined, { numeric: false, sensitivity: 'variant' }));
 
 const getNaturalCollatorInsensitive = (): Intl.Collator =>

[Survived] AssignmentOperator
helpers/array/sortNatural.ts:16:4
 let naturalCollatorInsensitiveCache: Intl.Collator | undefined;
 
 const getNaturalCollator = (): Intl.Collator =>
-  (naturalCollatorCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'variant' }));
+  (naturalCollatorCache &&= new Intl.Collator(undefined, {
+  numeric: true,
+  sensitivity: 'variant'
+}));
 
 const getNaturalCollatorInsensitive = (): Intl.Collator =>

[Killed] ArrowFunction
helpers/array/sortNatural.ts:18:39
 const getNaturalCollator = (): Intl.Collator =>
   (naturalCollatorCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'variant' }));
 
-const getNaturalCollatorInsensitive = (): Intl.Collator =>
-  (naturalCollatorInsensitiveCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'base' }));
+const getNaturalCollatorInsensitive = () => undefined;
 
 /**
killedBy: isPrerelease — ParsedVersion input parse(stable) → false
statusReason: Property failed after 1 tests
{ seed: 2127631479, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [["",""]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] AssignmentOperator
helpers/array/sortNatural.ts:19:4
   (naturalCollatorCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'variant' }));
 
 const getNaturalCollatorInsensitive = (): Intl.Collator =>
-  (naturalCollatorInsensitiveCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'base' }));
+  (naturalCollatorInsensitiveCache &&= new Intl.Collator(undefined, {
+  numeric: true,
+  sensitivity: 'base'
+}));
 
 /**

[Survived] BooleanLiteral
helpers/array/sortNatural.ts:19:80
   (naturalCollatorCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'variant' }));
 
 const getNaturalCollatorInsensitive = (): Intl.Collator =>
-  (naturalCollatorInsensitiveCache ??= new Intl.Collator(undefined, { numeric: true, sensitivity: 'base' }));
+  (naturalCollatorInsensitiveCache ??= new Intl.Collator(undefined, { numeric: false, sensitivity: 'base' }));
 
 /**

[Killed] ArrowFunction
helpers/array/sortNatural.ts:31:55
  * ['W11', 'W2', 'W20'].sort(sortStringNaturalAscFn) // => ['W2', 'W11', 'W20']
  * @since 2.0.2
  */
-export const sortStringNaturalAscFn: SortFn<string> = (a: string, b: string) =>
-  getNaturalCollator().compare(a, b);
+export const sortStringNaturalAscFn: SortFn<string> = () => undefined;
 
 /**
killedBy: isPrerelease — ParsedVersion input parse(alpha) → true
statusReason: Property failed after 1 tests
{ seed: 1691945014, path: "0:3:1:1:1:1:1:1:1:1:1:1:1:3:1:1:3:2", endOnFailure: true }
Counterexample: [[1,0]]
Shrunk 17 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/array/sortNatural.ts:44:56
  * ['W11', 'W2', 'W20'].sort(sortStringNaturalDescFn) // => ['W20', 'W11', 'W2']
  * @since 2.0.2
  */
-export const sortStringNaturalDescFn: SortFn<string> = (a: string, b: string) =>
-  getNaturalCollator().compare(b, a);
+export const sortStringNaturalDescFn: SortFn<string> = () => undefined;
 
 /**
killedBy: timestamp utilities isTimestampInSeconds should identify seconds vs milliseconds
statusReason: expected [ 'W01', 'W2', 'W11', 'W20' ] to deeply equal [ 'W20', 'W11', 'W2', 'W01' ]

[Killed] ArrowFunction
helpers/array/sortNatural.ts:58:66
  * ['W11', 'W2', 'W20'].sort(sortStringNaturalAscInsensitiveFn) // => ['W2', 'W11', 'W20']
  * @since 2.0.2
  */
-export const sortStringNaturalAscInsensitiveFn: SortFn<string> = (a: string, b: string) =>
-  getNaturalCollatorInsensitive().compare(a, b);
+export const sortStringNaturalAscInsensitiveFn: SortFn<string> = () => undefined;
 
 /**
killedBy: isPrerelease — ParsedVersion input parse(stable with build) → false
statusReason: Property failed after 1 tests
{ seed: -1212481320, path: "0:0:0", endOnFailure: true }
Counterexample: ["",""]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/array/sortNatural.ts:72:67
  * ['W11', 'W2', 'W20'].sort(sortStringNaturalDescInsensitiveFn) // => ['W20', 'W11', 'W2']
  * @since 2.0.2
  */
-export const sortStringNaturalDescInsensitiveFn: SortFn<string> = (a: string, b: string) =>
-  getNaturalCollatorInsensitive().compare(b, a);
+export const sortStringNaturalDescInsensitiveFn: SortFn<string> = () => undefined;
 
 /**
killedBy: isPrerelease — ParsedVersion input parse(stable with build) → false
statusReason: Property failed after 1 tests
{ seed: 1085934828, path: "0:0", endOnFailure: true }
Counterexample: ["",""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BlockStatement
helpers/array/sortNatural.ts:96:14
 export function createSortByNaturalFn<T extends Record<string, unknown>>(
   property?: keyof T | readonly (keyof T)[],
   caseInsensitive: boolean = false,
-): SortFn<T> {
-  const collator = caseInsensitive ? getNaturalCollatorInsensitive() : getNaturalCollator();
-  return buildCollatorCompareFn<T>(collator, normalizePropertyToKeys<T>(property));
-}
+): SortFn<T> {}
 
