[Survived] BlockStatement
helpers/array/toggle.ts:34:8
   array: readonly T[] | null | undefined,
   item: T,
   key?: (item: T) => unknown,
-): T[] {
-  const list = array ?? [];
-  const identify = key ?? ((value: T) => value);
-  const itemKey = identify(item);
-  const index = list.findIndex((existing) => identify(existing) === itemKey);
-
-  if (index === -1) return [...list, item];
-  return [...list.slice(0, index), ...list.slice(index + 1)];
-}
+): T[] {}
 

[Survived] ArrowFunction
helpers/array/toggle.ts:36:28
   key?: (item: T) => unknown,
 ): T[] {
   const list = array ?? [];
-  const identify = key ?? ((value: T) => value);
+  const identify = key ?? (() => undefined);
   const itemKey = identify(item);
   const index = list.findIndex((existing) => identify(existing) === itemKey);

[Survived] LogicalOperator
helpers/array/toggle.ts:36:20
   key?: (item: T) => unknown,
 ): T[] {
   const list = array ?? [];
-  const identify = key ?? ((value: T) => value);
+  const identify = key && ((value: T) => value);
   const itemKey = identify(item);
   const index = list.findIndex((existing) => identify(existing) === itemKey);

[Survived] ConditionalExpression
helpers/array/toggle.ts:38:46
   const list = array ?? [];
   const identify = key ?? ((value: T) => value);
   const itemKey = identify(item);
-  const index = list.findIndex((existing) => identify(existing) === itemKey);
+  const index = list.findIndex((existing) => false);
 
   if (index === -1) return [...list, item];

[Survived] EqualityOperator
helpers/array/toggle.ts:38:46
   const list = array ?? [];
   const identify = key ?? ((value: T) => value);
   const itemKey = identify(item);
-  const index = list.findIndex((existing) => identify(existing) === itemKey);
+  const index = list.findIndex((existing) => identify(existing) !== itemKey);
 
   if (index === -1) return [...list, item];

[Survived] UnaryOperator
helpers/array/toggle.ts:40:17
   const itemKey = identify(item);
   const index = list.findIndex((existing) => identify(existing) === itemKey);
 
-  if (index === -1) return [...list, item];
+  if (index === +1) return [...list, item];
   return [...list.slice(0, index), ...list.slice(index + 1)];
 }

[Survived] ArithmeticOperator
helpers/array/toggle.ts:41:50
   const index = list.findIndex((existing) => identify(existing) === itemKey);
 
   if (index === -1) return [...list, item];
-  return [...list.slice(0, index), ...list.slice(index + 1)];
+  return [...list.slice(0, index), ...list.slice(index - 1)];
 }
 

[Survived] MethodExpression
helpers/array/toggle.ts:41:39
   const index = list.findIndex((existing) => identify(existing) === itemKey);
 
   if (index === -1) return [...list, item];
-  return [...list.slice(0, index), ...list.slice(index + 1)];
+  return [...list.slice(0, index), ...list];
 }
 
