[Survived] BlockStatement
helpers/array/without.ts:25:89
  * without(null, 1);                   // []
  * @since 2.0.0
  */
-export function without<T>(array: readonly T[] | null | undefined, ...values: T[]): T[] {
-  if (array == null) return [];
-  const excluded = new Set(values);
-  return array.filter((item) => !excluded.has(item));
-}
+export function without<T>(array: readonly T[] | null | undefined, ...values: T[]): T[] {}
 

[Survived] EqualityOperator
helpers/array/without.ts:26:7
  * @since 2.0.0
  */
 export function without<T>(array: readonly T[] | null | undefined, ...values: T[]): T[] {
-  if (array == null) return [];
+  if (array != null) return [];
   const excluded = new Set(values);
   return array.filter((item) => !excluded.has(item));

[Survived] ConditionalExpression
helpers/array/without.ts:26:7
  * @since 2.0.0
  */
 export function without<T>(array: readonly T[] | null | undefined, ...values: T[]): T[] {
-  if (array == null) return [];
+  if (true) return [];
   const excluded = new Set(values);
   return array.filter((item) => !excluded.has(item));
