[Survived] BlockStatement
helpers/color/hexToRgb.ts:27:49
 
 const HEX_PATTERN = /* @__PURE__ */ new RegExp(`^#?(${HEX_COLOR_DIGITS})$`, 'i');
 
-function expandShortHex(digits: string): string {
-  return digits.length <= 4
-    ? digits
-        .split('')
-        .map((c) => c + c)
-        .join('')
-    : digits;
-}
+function expandShortHex(digits: string): string {}
 
 /**

[Survived] EqualityOperator
helpers/color/hexToRgb.ts:28:10
 const HEX_PATTERN = /* @__PURE__ */ new RegExp(`^#?(${HEX_COLOR_DIGITS})$`, 'i');
 
 function expandShortHex(digits: string): string {
-  return digits.length <= 4
+  return digits.length > 4
     ? digits
         .split('')

[Survived] ConditionalExpression
helpers/color/hexToRgb.ts:28:10
 const HEX_PATTERN = /* @__PURE__ */ new RegExp(`^#?(${HEX_COLOR_DIGITS})$`, 'i');
 
 function expandShortHex(digits: string): string {
-  return digits.length <= 4
+  return false
     ? digits
         .split('')

[Survived] ArithmeticOperator
helpers/color/hexToRgb.ts:31:21
   return digits.length <= 4
     ? digits
         .split('')
-        .map((c) => c + c)
+        .map((c) => c - c)
         .join('')
     : digits;

[Survived] ArrowFunction
helpers/color/hexToRgb.ts:31:14
   return digits.length <= 4
     ? digits
         .split('')
-        .map((c) => c + c)
+        .map(() => undefined)
         .join('')
     : digits;

[Survived] BlockStatement
helpers/color/hexToRgb.ts:48:56
  * hexToRgb('not-a-color') // => null
  * @since 3.0.0
  */
-export function hexToRgb(hex: string): RgbColor | null {
-  const match = HEX_PATTERN.exec(hex.trim());
-  if (!match) return null;
-
-  const digits = expandShortHex(match[1]!);
-  const r = Number.parseInt(digits.slice(0, 2), 16);
-  const g = Number.parseInt(digits.slice(2, 4), 16);
-  const b = Number.parseInt(digits.slice(4, 6), 16);
-  const a = digits.length === 8 ? roundTo(Number.parseInt(digits.slice(6, 8), 16) / 255, 3) : 1;
-
-  return { r, g, b, a };
-}
+export function hexToRgb(hex: string): RgbColor | null {}
 

[Survived] MethodExpression
helpers/color/hexToRgb.ts:49:34
  * @since 3.0.0
  */
 export function hexToRgb(hex: string): RgbColor | null {
-  const match = HEX_PATTERN.exec(hex.trim());
+  const match = HEX_PATTERN.exec(hex);
   if (!match) return null;
 

[Survived] ConditionalExpression
helpers/color/hexToRgb.ts:50:7
  */
 export function hexToRgb(hex: string): RgbColor | null {
   const match = HEX_PATTERN.exec(hex.trim());
-  if (!match) return null;
+  if (false) return null;
 
   const digits = expandShortHex(match[1]!);

[Survived] BooleanLiteral
helpers/color/hexToRgb.ts:50:7
  */
 export function hexToRgb(hex: string): RgbColor | null {
   const match = HEX_PATTERN.exec(hex.trim());
-  if (!match) return null;
+  if (match) return null;
 
   const digits = expandShortHex(match[1]!);

[Survived] MethodExpression
helpers/color/hexToRgb.ts:53:29
   if (!match) return null;
 
   const digits = expandShortHex(match[1]!);
-  const r = Number.parseInt(digits.slice(0, 2), 16);
+  const r = Number.parseInt(digits, 16);
   const g = Number.parseInt(digits.slice(2, 4), 16);
   const b = Number.parseInt(digits.slice(4, 6), 16);

[Survived] MethodExpression
helpers/color/hexToRgb.ts:54:29
 
   const digits = expandShortHex(match[1]!);
   const r = Number.parseInt(digits.slice(0, 2), 16);
-  const g = Number.parseInt(digits.slice(2, 4), 16);
+  const g = Number.parseInt(digits, 16);
   const b = Number.parseInt(digits.slice(4, 6), 16);
   const a = digits.length === 8 ? roundTo(Number.parseInt(digits.slice(6, 8), 16) / 255, 3) : 1;

[Survived] MethodExpression
helpers/color/hexToRgb.ts:55:29
   const digits = expandShortHex(match[1]!);
   const r = Number.parseInt(digits.slice(0, 2), 16);
   const g = Number.parseInt(digits.slice(2, 4), 16);
-  const b = Number.parseInt(digits.slice(4, 6), 16);
+  const b = Number.parseInt(digits, 16);
   const a = digits.length === 8 ? roundTo(Number.parseInt(digits.slice(6, 8), 16) / 255, 3) : 1;
 

[Survived] EqualityOperator
helpers/color/hexToRgb.ts:56:13
   const r = Number.parseInt(digits.slice(0, 2), 16);
   const g = Number.parseInt(digits.slice(2, 4), 16);
   const b = Number.parseInt(digits.slice(4, 6), 16);
-  const a = digits.length === 8 ? roundTo(Number.parseInt(digits.slice(6, 8), 16) / 255, 3) : 1;
+  const a = digits.length !== 8 ? roundTo(Number.parseInt(digits.slice(6, 8), 16) / 255, 3) : 1;
 
   return { r, g, b, a };

[Survived] ConditionalExpression
helpers/color/hexToRgb.ts:56:13
   const r = Number.parseInt(digits.slice(0, 2), 16);
   const g = Number.parseInt(digits.slice(2, 4), 16);
   const b = Number.parseInt(digits.slice(4, 6), 16);
-  const a = digits.length === 8 ? roundTo(Number.parseInt(digits.slice(6, 8), 16) / 255, 3) : 1;
+  const a = true ? roundTo(Number.parseInt(digits.slice(6, 8), 16) / 255, 3) : 1;
 
   return { r, g, b, a };
