[Survived] StringLiteral
helpers/date/difference.ts:58:18
  * @since 2.0.0
  */
 export function difference(dateA: DateLike, dateB: DateLike, options: DateDifferenceOptions = {}): number {
-  const { unit = 'days', absolute = true } = options;
+  const { unit = "", absolute = true } = options;
 
   const a = ensureDate(dateA);

[Survived] ConditionalExpression
helpers/date/difference.ts:63:21
   const a = ensureDate(dateA);
   const b = ensureDate(dateB);
 
-  if (a === null || b === null) {
+  if (a === null || false) {
     return NaN;
   }

[Survived] EqualityOperator
helpers/date/difference.ts:63:7
   const a = ensureDate(dateA);
   const b = ensureDate(dateB);
 
-  if (a === null || b === null) {
+  if (a !== null || b === null) {
     return NaN;
   }

[Survived] ArithmeticOperator
helpers/date/difference.ts:85:26
       break;
     case 'days':
     default:
-      result = diffMs / (1000 * 60 * 60 * 24);
+      result = diffMs / (1000 * 60 * 60 / 24);
       break;
   }
