[Survived] CallExpression
helpers/date/sequence.ts:39:5
   endTime.setHours(0, 0, 0, 0);
 
   while (current.getTime() <= endTime.getTime()) {
-    result.push(new Date(current));
+    ;
     current.setDate(current.getDate() + 1);
   }

[Survived] CallExpression
helpers/date/sequence.ts:74:5
   const endMonth = new Date(e.getFullYear(), e.getMonth(), 1);
 
   while (current.getTime() <= endMonth.getTime()) {
-    result.push(new Date(current));
+    ;
     current.setMonth(current.getMonth() + 1);
   }
