[Survived] CallExpression
helpers/function/returnOrThrowError.ts:19:5
  */
 export function returnOrThrowError<T>(value: T | undefined | null, error: string): T {
   if (isNullish(value)) {
-    throw new Error(error);
+    ;
   }
   return value;
