[Survived] BlockStatement
helpers/guard/isAsyncGeneratorFunction.ts:23:91
  * @see {@link isAsyncGenerator}
  * @since 2.0.3
  */
-export function isAsyncGeneratorFunction(value: unknown): value is AsyncGeneratorFunction {
-  return Object.prototype.toString.call(value) === '[object AsyncGeneratorFunction]';
-}
+export function isAsyncGeneratorFunction(value: unknown): value is AsyncGeneratorFunction {}
 

[Survived] ConditionalExpression
helpers/guard/isAsyncGeneratorFunction.ts:24:10
  * @since 2.0.3
  */
 export function isAsyncGeneratorFunction(value: unknown): value is AsyncGeneratorFunction {
-  return Object.prototype.toString.call(value) === '[object AsyncGeneratorFunction]';
+  return true;
 }
 

[Survived] ConditionalExpression
helpers/guard/isAsyncGeneratorFunction.ts:24:10
  * @since 2.0.3
  */
 export function isAsyncGeneratorFunction(value: unknown): value is AsyncGeneratorFunction {
-  return Object.prototype.toString.call(value) === '[object AsyncGeneratorFunction]';
+  return false;
 }
 
