[Killed] LogicalOperator
helpers/guard/isDefined.ts:34:10
  * @since 2.0.0
  */
 export function isDefined<T>(value: Maybe<T>): value is T {
-  return value !== undefined && value !== null;
+  return value !== undefined || value !== null;
 }
 
killedBy: compare — contract "1.0.0" vs "1.0.1" → -1 (patch)
statusReason: You provided 'null' where a stream was expected. You can provide an Observable, Promise, ReadableStream, Array, AsyncIterable, or Iterable.

[Killed] EqualityOperator
helpers/guard/isDefined.ts:34:33
  * @since 2.0.0
  */
 export function isDefined<T>(value: Maybe<T>): value is T {
-  return value !== undefined && value !== null;
+  return value !== undefined && value === null;
 }
 
killedBy: compare — contract "1.0.0+build1" vs "1.0.0+build2" → 0 (build metadata ignored)
statusReason: expected [] to deeply equal [ 1, 2 ]
