[Survived] BlockStatement
helpers/guard/isJSON.ts:28:57
  * isJSON(42)         // => false (not even a string)
  * @since 3.0.3
  */
-export function isJSON(value: unknown): value is string {
-  if (typeof value !== 'string') return false;
-  return safeJsonParse(value, PARSE_FAILED) !== PARSE_FAILED;
-}
+export function isJSON(value: unknown): value is string {}
 

[Survived] ConditionalExpression
helpers/guard/isJSON.ts:29:7
  * @since 3.0.3
  */
 export function isJSON(value: unknown): value is string {
-  if (typeof value !== 'string') return false;
+  if (true) return false;
   return safeJsonParse(value, PARSE_FAILED) !== PARSE_FAILED;
 }

[Survived] EqualityOperator
helpers/guard/isJSON.ts:29:7
  * @since 3.0.3
  */
 export function isJSON(value: unknown): value is string {
-  if (typeof value !== 'string') return false;
+  if (typeof value === 'string') return false;
   return safeJsonParse(value, PARSE_FAILED) !== PARSE_FAILED;
 }

[Survived] ConditionalExpression
helpers/guard/isJSON.ts:30:10
  */
 export function isJSON(value: unknown): value is string {
   if (typeof value !== 'string') return false;
-  return safeJsonParse(value, PARSE_FAILED) !== PARSE_FAILED;
+  return false;
 }
 

[Survived] ConditionalExpression
helpers/guard/isJSON.ts:30:10
  */
 export function isJSON(value: unknown): value is string {
   if (typeof value !== 'string') return false;
-  return safeJsonParse(value, PARSE_FAILED) !== PARSE_FAILED;
+  return true;
 }
 
