[Survived] BlockStatement
helpers/guard/isLength.ts:20:59
  * isLength('3')    // => false
  * @since 3.0.3
  */
-export function isLength(value: unknown): value is number {
-  return (
-    typeof value === 'number' &&
-    Number.isInteger(value) &&
-    value >= 0 &&
-    value <= Number.MAX_SAFE_INTEGER
-  );
-}
+export function isLength(value: unknown): value is number {}
 

[Survived] ConditionalExpression
helpers/guard/isLength.ts:22:5
  */
 export function isLength(value: unknown): value is number {
   return (
-    typeof value === 'number' &&
-    Number.isInteger(value) &&
-    value >= 0 &&
-    value <= Number.MAX_SAFE_INTEGER
+    false
   );
 }

[Survived] EqualityOperator
helpers/guard/isLength.ts:22:5
  */
 export function isLength(value: unknown): value is number {
   return (
-    typeof value === 'number' &&
+    typeof value !== 'number' &&
     Number.isInteger(value) &&
     value >= 0 &&

[Survived] EqualityOperator
helpers/guard/isLength.ts:24:5
   return (
     typeof value === 'number' &&
     Number.isInteger(value) &&
-    value >= 0 &&
+    value < 0 &&
     value <= Number.MAX_SAFE_INTEGER
   );

[Survived] EqualityOperator
helpers/guard/isLength.ts:24:5
   return (
     typeof value === 'number' &&
     Number.isInteger(value) &&
-    value >= 0 &&
+    value > 0 &&
     value <= Number.MAX_SAFE_INTEGER
   );

[Survived] EqualityOperator
helpers/guard/isLength.ts:25:5
     typeof value === 'number' &&
     Number.isInteger(value) &&
     value >= 0 &&
-    value <= Number.MAX_SAFE_INTEGER
+    value > Number.MAX_SAFE_INTEGER
   );
 }

[Survived] EqualityOperator
helpers/guard/isLength.ts:25:5
     typeof value === 'number' &&
     Number.isInteger(value) &&
     value >= 0 &&
-    value <= Number.MAX_SAFE_INTEGER
+    value < Number.MAX_SAFE_INTEGER
   );
 }
