[Survived] EqualityOperator
helpers/guard/isNullish.ts:22:28
  * @since 2.0.0
  */
 export function isNullish(value: unknown): value is null | undefined {
-  return value === null || value === undefined;
+  return value === null || value !== undefined;
 }
 

[Survived] ConditionalExpression
helpers/guard/isNullish.ts:22:10
  * @since 2.0.0
  */
 export function isNullish(value: unknown): value is null | undefined {
-  return value === null || value === undefined;
+  return false;
 }
 
