[Survived] LogicalOperator
helpers/guard/isPromise.ts:24:5
  */
 export function isPromise(value: unknown): value is PromiseLike<unknown> {
   return (
-    value !== null &&
-    typeof value === 'object' &&
+    value !== null || typeof value === 'object' &&
     typeof (value as PromiseLike<unknown>).then === 'function' &&
     typeof (value as Record<string, unknown>).catch === 'function'
