[Survived] BlockStatement
helpers/guard/isSet.ts:17:62
  * isSet([])                // => false
  * @since 3.0.0
  */
-export function isSet(value: unknown): value is Set<unknown> {
-  return value instanceof Set;
-}
+export function isSet(value: unknown): value is Set<unknown> {}
 
