[Survived] BlockStatement
helpers/guard/isTemporalDuration.ts:22:40
  * @since 2.0.0
  */
 export function isTemporalDuration(value: unknown): value is Temporal.Duration {
-  if (typeof Temporal !== 'undefined') {
-    return value instanceof Temporal.Duration;
-  }
+  if (typeof Temporal !== 'undefined') {}
   return (
     typeof value === 'object' &&

[Survived] ConditionalExpression
helpers/guard/isTemporalDuration.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalDuration(value: unknown): value is Temporal.Duration {
-  if (typeof Temporal !== 'undefined') {
+  if (false) {
     return value instanceof Temporal.Duration;
   }

[Survived] ConditionalExpression
helpers/guard/isTemporalDuration.ts:26:5
     return value instanceof Temporal.Duration;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.Duration'
+    true
   );
 }
