[Survived] ConditionalExpression
helpers/guard/isTemporalPlainTime.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalPlainTime(value: unknown): value is Temporal.PlainTime {
-  if (typeof Temporal !== 'undefined') {
+  if (false) {
     return value instanceof Temporal.PlainTime;
   }
