[Survived] BlockStatement
helpers/guard/isWeakSet.ts:16:69
  * isWeakSet(new Set())      // => false
  * @since 3.0.0
  */
-export function isWeakSet(value: unknown): value is WeakSet<object> {
-  return value instanceof WeakSet;
-}
+export function isWeakSet(value: unknown): value is WeakSet<object> {}
 
