[Killed] ArrayDeclaration
helpers/license/families.ts:12:8
 // Longest/most specific alias keys first within a family so a substring match never lets a
 // shorter, less specific alias shadow a longer one that also matches the same input.
 const FAMILY_ALIASES: Record<string, readonly string[]> = {
-  mit: ['mit-0', 'mit'],
+  mit: [],
   gpl: [
     'gpl-3.0-or-later', 'gpl-3.0-only', 'gpl-2.0-or-later', 'gpl-2.0-only',
killedBy: template handles data with null values as empty string
statusReason: expected Set{ 'unknown' } to deeply equal Set{ 'unknown', 'mit' }

[Killed] StringLiteral
helpers/license/families.ts:15:37
   mit: ['mit-0', 'mit'],
   gpl: [
     'gpl-3.0-or-later', 'gpl-3.0-only', 'gpl-2.0-or-later', 'gpl-2.0-only',
-    'gpl-1.0-or-later', 'gpl-3.0+', 'gpl-2.0+', 'gpl-3.0', 'gpl-2.0',
+    'gpl-1.0-or-later', 'gpl-3.0+', "", 'gpl-3.0', 'gpl-2.0',
     'gplv3', 'gplv2', 'gpl3+', 'gpl3', 'gpl2', 'gpl-3', 'gpl-2', 'gpl',
   ],
killedBy: satisfiesRange — property-based if satisfiesRange(v, ">=X.Y.Z") is true then compare(v, X.Y.Z) >= 0
statusReason: expected Set{ 'unknown', 'gfdl' } to deeply equal Set{ 'gpl', 'gfdl' }

[Survived] StringLiteral
helpers/license/families.ts:15:60
   mit: ['mit-0', 'mit'],
   gpl: [
     'gpl-3.0-or-later', 'gpl-3.0-only', 'gpl-2.0-or-later', 'gpl-2.0-only',
-    'gpl-1.0-or-later', 'gpl-3.0+', 'gpl-2.0+', 'gpl-3.0', 'gpl-2.0',
+    'gpl-1.0-or-later', 'gpl-3.0+', 'gpl-2.0+', 'gpl-3.0', "",
     'gplv3', 'gplv2', 'gpl3+', 'gpl3', 'gpl2', 'gpl-3', 'gpl-2', 'gpl',
   ],

[Killed] StringLiteral
helpers/license/families.ts:16:32
   gpl: [
     'gpl-3.0-or-later', 'gpl-3.0-only', 'gpl-2.0-or-later', 'gpl-2.0-only',
     'gpl-1.0-or-later', 'gpl-3.0+', 'gpl-2.0+', 'gpl-3.0', 'gpl-2.0',
-    'gplv3', 'gplv2', 'gpl3+', 'gpl3', 'gpl2', 'gpl-3', 'gpl-2', 'gpl',
+    'gplv3', 'gplv2', 'gpl3+', "", 'gpl2', 'gpl-3', 'gpl-2', 'gpl',
   ],
   lgpl: [
killedBy: once reset() allows the function to be called again after reset
statusReason: expected Set{ 'unknown' } to deeply equal Set{ 'gpl' }

[Killed] StringLiteral
helpers/license/families.ts:16:5
   gpl: [
     'gpl-3.0-or-later', 'gpl-3.0-only', 'gpl-2.0-or-later', 'gpl-2.0-only',
     'gpl-1.0-or-later', 'gpl-3.0+', 'gpl-2.0+', 'gpl-3.0', 'gpl-2.0',
-    'gplv3', 'gplv2', 'gpl3+', 'gpl3', 'gpl2', 'gpl-3', 'gpl-2', 'gpl',
+    "", 'gplv2', 'gpl3+', 'gpl3', 'gpl2', 'gpl-3', 'gpl-2', 'gpl',
   ],
   lgpl: [
killedBy: once reset() allows the function to be called again after reset
statusReason: expected Set{ 'unknown' } to deeply equal Set{ 'gpl' }

[Killed] StringLiteral
helpers/license/families.ts:19:26
     'gplv3', 'gplv2', 'gpl3+', 'gpl3', 'gpl2', 'gpl-3', 'gpl-2', 'gpl',
   ],
   lgpl: [
-    'lgpl-3.0-or-later', 'lgpl-3.0-only', 'lgpl-2.1-or-later', 'lgpl-2.1-only',
+    'lgpl-3.0-or-later', "", 'lgpl-2.1-or-later', 'lgpl-2.1-only',
     'lgpl-2.0-or-later', 'lgpl-2.0-only', 'lgpl-3.0+', 'lgpl-2.1+', 'lgpl-3.0', 'lgpl-2.1',
     'lgplv3', 'lgplv2.1', 'lgpl3', 'lgpl2.1', 'lgpl2', 'lgpl',
killedBy: once reset() multiple resets work correctly
statusReason: expected Set{ 'unknown' } to deeply equal Set{ 'lgpl' }

[Survived] StringLiteral
helpers/license/families.ts:19:64
     'gplv3', 'gplv2', 'gpl3+', 'gpl3', 'gpl2', 'gpl-3', 'gpl-2', 'gpl',
   ],
   lgpl: [
-    'lgpl-3.0-or-later', 'lgpl-3.0-only', 'lgpl-2.1-or-later', 'lgpl-2.1-only',
+    'lgpl-3.0-or-later', 'lgpl-3.0-only', 'lgpl-2.1-or-later', "",
     'lgpl-2.0-or-later', 'lgpl-2.0-only', 'lgpl-3.0+', 'lgpl-2.1+', 'lgpl-3.0', 'lgpl-2.1',
     'lgplv3', 'lgplv2.1', 'lgpl3', 'lgpl2.1', 'lgpl2', 'lgpl',

[Killed] StringLiteral
helpers/license/families.ts:20:43
   ],
   lgpl: [
     'lgpl-3.0-or-later', 'lgpl-3.0-only', 'lgpl-2.1-or-later', 'lgpl-2.1-only',
-    'lgpl-2.0-or-later', 'lgpl-2.0-only', 'lgpl-3.0+', 'lgpl-2.1+', 'lgpl-3.0', 'lgpl-2.1',
+    'lgpl-2.0-or-later', 'lgpl-2.0-only', "", 'lgpl-2.1+', 'lgpl-3.0', 'lgpl-2.1',
     'lgplv3', 'lgplv2.1', 'lgpl3', 'lgpl2.1', 'lgpl2', 'lgpl',
   ],
killedBy: satisfiesRange — property-based if satisfiesRange(v, ">1.0.0") is true then compare(v, "1.0.0") > 0
statusReason: expected Set{ 'gpl', 'unknown' } to deeply equal Set{ 'gpl', 'lgpl' }

[Survived] StringLiteral
helpers/license/families.ts:20:56
   ],
   lgpl: [
     'lgpl-3.0-or-later', 'lgpl-3.0-only', 'lgpl-2.1-or-later', 'lgpl-2.1-only',
-    'lgpl-2.0-or-later', 'lgpl-2.0-only', 'lgpl-3.0+', 'lgpl-2.1+', 'lgpl-3.0', 'lgpl-2.1',
+    'lgpl-2.0-or-later', 'lgpl-2.0-only', 'lgpl-3.0+', "", 'lgpl-3.0', 'lgpl-2.1',
     'lgplv3', 'lgplv2.1', 'lgpl3', 'lgpl2.1', 'lgpl2', 'lgpl',
   ],

[Survived] StringLiteral
helpers/license/families.ts:21:47
   lgpl: [
     'lgpl-3.0-or-later', 'lgpl-3.0-only', 'lgpl-2.1-or-later', 'lgpl-2.1-only',
     'lgpl-2.0-or-later', 'lgpl-2.0-only', 'lgpl-3.0+', 'lgpl-2.1+', 'lgpl-3.0', 'lgpl-2.1',
-    'lgplv3', 'lgplv2.1', 'lgpl3', 'lgpl2.1', 'lgpl2', 'lgpl',
+    'lgplv3', 'lgplv2.1', 'lgpl3', 'lgpl2.1', "", 'lgpl',
   ],
   agpl: ['agpl-3.0-or-later', 'agpl-3.0-only', 'agpl-3.0', 'agplv3', 'agpl3', 'agpl'],

[Survived] StringLiteral
helpers/license/families.ts:23:79
     'lgpl-2.0-or-later', 'lgpl-2.0-only', 'lgpl-3.0+', 'lgpl-2.1+', 'lgpl-3.0', 'lgpl-2.1',
     'lgplv3', 'lgplv2.1', 'lgpl3', 'lgpl2.1', 'lgpl2', 'lgpl',
   ],
-  agpl: ['agpl-3.0-or-later', 'agpl-3.0-only', 'agpl-3.0', 'agplv3', 'agpl3', 'agpl'],
+  agpl: ['agpl-3.0-or-later', 'agpl-3.0-only', 'agpl-3.0', 'agplv3', 'agpl3', ""],
   bsd: [
     'bsd-3-clause', 'bsd-2-clause', '0bsd', 'bsd3', 'bsd 3-clause',

[Survived] StringLiteral
helpers/license/families.ts:26:5
   agpl: ['agpl-3.0-or-later', 'agpl-3.0-only', 'agpl-3.0', 'agplv3', 'agpl3', 'agpl'],
   bsd: [
     'bsd-3-clause', 'bsd-2-clause', '0bsd', 'bsd3', 'bsd 3-clause',
-    'bsd 2-clause', 'bsd-3', 'bsd',
+    "", 'bsd-3', 'bsd',
   ],
   apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],

[Survived] StringLiteral
helpers/license/families.ts:28:79
     'bsd-3-clause', 'bsd-2-clause', '0bsd', 'bsd3', 'bsd 3-clause',
     'bsd 2-clause', 'bsd-3', 'bsd',
   ],
-  apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],
+  apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', "", 'apache 2.0', 'apache'],
   mpl: ['mpl-2.0', 'mpl2', 'mpl'],
   artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],

[Survived] StringLiteral
helpers/license/families.ts:28:104
     'bsd-3-clause', 'bsd-2-clause', '0bsd', 'bsd3', 'bsd 3-clause',
     'bsd 2-clause', 'bsd-3', 'bsd',
   ],
-  apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],
+  apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', ""],
   mpl: ['mpl-2.0', 'mpl2', 'mpl'],
   artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],

[Survived] StringLiteral
helpers/license/families.ts:29:20
     'bsd 2-clause', 'bsd-3', 'bsd',
   ],
   apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],
-  mpl: ['mpl-2.0', 'mpl2', 'mpl'],
+  mpl: ['mpl-2.0', "", 'mpl'],
   artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],
   isc: ['isc'],

[Survived] ArrayDeclaration
helpers/license/families.ts:29:8
     'bsd 2-clause', 'bsd-3', 'bsd',
   ],
   apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],
-  mpl: ['mpl-2.0', 'mpl2', 'mpl'],
+  mpl: [],
   artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],
   isc: ['isc'],

[Survived] StringLiteral
helpers/license/families.ts:30:30
   ],
   apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],
   mpl: ['mpl-2.0', 'mpl2', 'mpl'],
-  artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],
+  artistic: ['artistic-2.0', "", 'perlartistic', 'artistic'],
   isc: ['isc'],
   unlicense: ['unlicense'],

[Survived] StringLiteral
helpers/license/families.ts:30:45
   ],
   apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],
   mpl: ['mpl-2.0', 'mpl2', 'mpl'],
-  artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],
+  artistic: ['artistic-2.0', 'artistic2.0', "", 'artistic'],
   isc: ['isc'],
   unlicense: ['unlicense'],

[Survived] StringLiteral
helpers/license/families.ts:31:9
   apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],
   mpl: ['mpl-2.0', 'mpl2', 'mpl'],
   artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],
-  isc: ['isc'],
+  isc: [""],
   unlicense: ['unlicense'],
   zlib: ['zlib'],

[Survived] ArrayDeclaration
helpers/license/families.ts:31:8
   apache: ['apache-2.0', 'apache license 2.0', 'apache license, version 2.0', 'apache2', 'apache 2.0', 'apache'],
   mpl: ['mpl-2.0', 'mpl2', 'mpl'],
   artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],
-  isc: ['isc'],
+  isc: [],
   unlicense: ['unlicense'],
   zlib: ['zlib'],

[Survived] StringLiteral
helpers/license/families.ts:33:10
   artistic: ['artistic-2.0', 'artistic2.0', 'perlartistic', 'artistic'],
   isc: ['isc'],
   unlicense: ['unlicense'],
-  zlib: ['zlib'],
+  zlib: [""],
   wtfpl: ['wtfpl'],
   php: ['php'],

[Survived] ArrayDeclaration
helpers/license/families.ts:35:8
   unlicense: ['unlicense'],
   zlib: ['zlib'],
   wtfpl: ['wtfpl'],
-  php: ['php'],
+  php: [],
   epl: ['epl'],
   cc: ['cc0-1.0', 'cc0', 'cc-by-sa-4.0', 'cc-by-nc-sa-4.0', 'cc-by-sa', 'ccpl'],

[Survived] StringLiteral
helpers/license/families.ts:37:73
   wtfpl: ['wtfpl'],
   php: ['php'],
   epl: ['epl'],
-  cc: ['cc0-1.0', 'cc0', 'cc-by-sa-4.0', 'cc-by-nc-sa-4.0', 'cc-by-sa', 'ccpl'],
+  cc: ['cc0-1.0', 'cc0', 'cc-by-sa-4.0', 'cc-by-nc-sa-4.0', 'cc-by-sa', ""],
   'public-domain': ['public domain'],
   boost: ['bsl-1.0', 'boost'],

[Survived] StringLiteral
helpers/license/families.ts:37:19
   wtfpl: ['wtfpl'],
   php: ['php'],
   epl: ['epl'],
-  cc: ['cc0-1.0', 'cc0', 'cc-by-sa-4.0', 'cc-by-nc-sa-4.0', 'cc-by-sa', 'ccpl'],
+  cc: ['cc0-1.0', "", 'cc-by-sa-4.0', 'cc-by-nc-sa-4.0', 'cc-by-sa', 'ccpl'],
   'public-domain': ['public domain'],
   boost: ['bsl-1.0', 'boost'],

[Survived] StringLiteral
helpers/license/families.ts:39:22
   epl: ['epl'],
   cc: ['cc0-1.0', 'cc0', 'cc-by-sa-4.0', 'cc-by-nc-sa-4.0', 'cc-by-sa', 'ccpl'],
   'public-domain': ['public domain'],
-  boost: ['bsl-1.0', 'boost'],
+  boost: ['bsl-1.0', ""],
   eupl: ['eupl-1.2', 'eupl'],
   postgresql: ['postgresql'],

[Survived] StringLiteral
helpers/license/families.ts:39:11
   epl: ['epl'],
   cc: ['cc0-1.0', 'cc0', 'cc-by-sa-4.0', 'cc-by-nc-sa-4.0', 'cc-by-sa', 'ccpl'],
   'public-domain': ['public domain'],
-  boost: ['bsl-1.0', 'boost'],
+  boost: ["", 'boost'],
   eupl: ['eupl-1.2', 'eupl'],
   postgresql: ['postgresql'],

[Survived] StringLiteral
helpers/license/families.ts:42:20
   boost: ['bsl-1.0', 'boost'],
   eupl: ['eupl-1.2', 'eupl'],
   postgresql: ['postgresql'],
-  psf: ['psf-2.0', 'psf'],
+  psf: ['psf-2.0', ""],
   gfdl: ['gfdl-1.3', 'gfdl'],
   sspl: ['sspl-1.0', 'sspl'],

[Survived] ArrayDeclaration
helpers/license/families.ts:42:8
   boost: ['bsl-1.0', 'boost'],
   eupl: ['eupl-1.2', 'eupl'],
   postgresql: ['postgresql'],
-  psf: ['psf-2.0', 'psf'],
+  psf: [],
   gfdl: ['gfdl-1.3', 'gfdl'],
   sspl: ['sspl-1.0', 'sspl'],

[Survived] StringLiteral
helpers/license/families.ts:44:10
   postgresql: ['postgresql'],
   psf: ['psf-2.0', 'psf'],
   gfdl: ['gfdl-1.3', 'gfdl'],
-  sspl: ['sspl-1.0', 'sspl'],
+  sspl: ["", 'sspl'],
   busl: ['busl-1.1', 'busl'],
 };

[Survived] ArrayDeclaration
helpers/license/families.ts:44:9
   postgresql: ['postgresql'],
   psf: ['psf-2.0', 'psf'],
   gfdl: ['gfdl-1.3', 'gfdl'],
-  sspl: ['sspl-1.0', 'sspl'],
+  sspl: [],
   busl: ['busl-1.1', 'busl'],
 };

[Survived] Regex
helpers/license/families.ts:54:40
 // UNKNOWN_FAMILY rather than incorrectly matching MIT's alias substring — a `custom:<...>`
 // convention names the *vendor's own license text*, not necessarily the SPDX license the name
 // resembles.
-const UNKNOWN_PATTERNS = [/^custom\b/, /^licenseref-/, /unknown/, /^none$/, /^various$/, /^unknow$/];
+const UNKNOWN_PATTERNS = [/^custom\b/, /licenseref-/, /unknown/, /^none$/, /^various$/, /^unknow$/];
 
 function matchAlias(normalized: string): string | undefined {

[Survived] BlockStatement
helpers/license/families.ts:56:61
 // resembles.
 const UNKNOWN_PATTERNS = [/^custom\b/, /^licenseref-/, /unknown/, /^none$/, /^various$/, /^unknow$/];
 
-function matchAlias(normalized: string): string | undefined {
-  for (const [family, aliases] of Object.entries(FAMILY_ALIASES)) {
-    if (aliases.includes(normalized)) return family;
-  }
-  return undefined;
-}
+function matchAlias(normalized: string): string | undefined {}
 
 // Splits an SPDX-ish compound expression ("GPL-3.0+ AND LGPL-3.0+", or a lowercase "GPL-2.0+ and

[Survived] BlockStatement
helpers/license/families.ts:57:67
 const UNKNOWN_PATTERNS = [/^custom\b/, /^licenseref-/, /unknown/, /^none$/, /^various$/, /^unknow$/];
 
 function matchAlias(normalized: string): string | undefined {
-  for (const [family, aliases] of Object.entries(FAMILY_ALIASES)) {
-    if (aliases.includes(normalized)) return family;
-  }
+  for (const [family, aliases] of Object.entries(FAMILY_ALIASES)) {}
   return undefined;
 }

[Survived] ConditionalExpression
helpers/license/families.ts:58:9
 
 function matchAlias(normalized: string): string | undefined {
   for (const [family, aliases] of Object.entries(FAMILY_ALIASES)) {
-    if (aliases.includes(normalized)) return family;
+    if (true) return family;
   }
   return undefined;

[Survived] ConditionalExpression
helpers/license/families.ts:58:9
 
 function matchAlias(normalized: string): string | undefined {
   for (const [family, aliases] of Object.entries(FAMILY_ALIASES)) {
-    if (aliases.includes(normalized)) return family;
+    if (false) return family;
   }
   return undefined;

[Survived] BlockStatement
helpers/license/families.ts:68:45
 // LLVM-exception") are dropped entirely — the exception clause never itself resembles a distinct
 // license family, so it would otherwise either land in UNKNOWN_FAMILY for no reason or dilute the
 // comparison with a token that isn't really a separate license claim.
-function splitTokens(raw: string): string[] {
-  return raw
-    .split(/\s+(?:and|or)\s+/i)
-    .map((token) => token.split(/\s+with\s+/i)[0].trim())
-    .filter((token) => token.length > 0);
-}
+function splitTokens(raw: string): string[] {}
 
 /**

[Survived] MethodExpression
helpers/license/families.ts:69:10
 // license family, so it would otherwise either land in UNKNOWN_FAMILY for no reason or dilute the
 // comparison with a token that isn't really a separate license claim.
 function splitTokens(raw: string): string[] {
-  return raw
-    .split(/\s+(?:and|or)\s+/i)
-    .map((token) => token.split(/\s+with\s+/i)[0].trim())
-    .filter((token) => token.length > 0);
+  return raw.split(/\s+(?:and|or)\s+/i).map(token => token.split(/\s+with\s+/i)[0].trim());
 }
 

[Survived] Regex
helpers/license/families.ts:70:12
 // comparison with a token that isn't really a separate license claim.
 function splitTokens(raw: string): string[] {
   return raw
-    .split(/\s+(?:and|or)\s+/i)
+    .split(/\s+(?:and|or)\S+/i)
     .map((token) => token.split(/\s+with\s+/i)[0].trim())
     .filter((token) => token.length > 0);

[Survived] MethodExpression
helpers/license/families.ts:71:21
 function splitTokens(raw: string): string[] {
   return raw
     .split(/\s+(?:and|or)\s+/i)
-    .map((token) => token.split(/\s+with\s+/i)[0].trim())
+    .map((token) => token.split(/\s+with\s+/i)[0])
     .filter((token) => token.length > 0);
 }

[Survived] ArrowFunction
helpers/license/families.ts:71:10
 function splitTokens(raw: string): string[] {
   return raw
     .split(/\s+(?:and|or)\s+/i)
-    .map((token) => token.split(/\s+with\s+/i)[0].trim())
+    .map(() => undefined)
     .filter((token) => token.length > 0);
 }

[Survived] EqualityOperator
helpers/license/families.ts:72:24
   return raw
     .split(/\s+(?:and|or)\s+/i)
     .map((token) => token.split(/\s+with\s+/i)[0].trim())
-    .filter((token) => token.length > 0);
+    .filter((token) => token.length >= 0);
 }
 

[Survived] ConditionalExpression
helpers/license/families.ts:72:24
   return raw
     .split(/\s+(?:and|or)\s+/i)
     .map((token) => token.split(/\s+with\s+/i)[0].trim())
-    .filter((token) => token.length > 0);
+    .filter((token) => true);
 }
 

[Survived] BlockStatement
helpers/license/families.ts:98:52
  * // => Set(1) { 'unknown' }
  * @since 3.1.2
  */
-export function families(raw: string): Set<string> {
-  const result = new Set<string>();
-  for (const token of splitTokens(raw)) {
-    const normalized = token.toLowerCase();
-    if (UNKNOWN_PATTERNS.some((pattern) => pattern.test(normalized))) {
-      result.add(UNKNOWN_FAMILY);
-      continue;
-    }
-    result.add(matchAlias(normalized) ?? UNKNOWN_FAMILY);
-  }
-  return result;
-}
+export function families(raw: string): Set<string> {}
 

[Survived] BlockStatement
helpers/license/families.ts:100:41
  */
 export function families(raw: string): Set<string> {
   const result = new Set<string>();
-  for (const token of splitTokens(raw)) {
-    const normalized = token.toLowerCase();
-    if (UNKNOWN_PATTERNS.some((pattern) => pattern.test(normalized))) {
-      result.add(UNKNOWN_FAMILY);
-      continue;
-    }
-    result.add(matchAlias(normalized) ?? UNKNOWN_FAMILY);
-  }
+  for (const token of splitTokens(raw)) {}
   return result;
 }

[Survived] MethodExpression
helpers/license/families.ts:101:24
 export function families(raw: string): Set<string> {
   const result = new Set<string>();
   for (const token of splitTokens(raw)) {
-    const normalized = token.toLowerCase();
+    const normalized = token.toUpperCase();
     if (UNKNOWN_PATTERNS.some((pattern) => pattern.test(normalized))) {
       result.add(UNKNOWN_FAMILY);

[Survived] BlockStatement
helpers/license/families.ts:102:71
   const result = new Set<string>();
   for (const token of splitTokens(raw)) {
     const normalized = token.toLowerCase();
-    if (UNKNOWN_PATTERNS.some((pattern) => pattern.test(normalized))) {
-      result.add(UNKNOWN_FAMILY);
-      continue;
-    }
+    if (UNKNOWN_PATTERNS.some((pattern) => pattern.test(normalized))) {}
     result.add(matchAlias(normalized) ?? UNKNOWN_FAMILY);
   }

[Survived] MethodExpression
helpers/license/families.ts:102:9
   const result = new Set<string>();
   for (const token of splitTokens(raw)) {
     const normalized = token.toLowerCase();
-    if (UNKNOWN_PATTERNS.some((pattern) => pattern.test(normalized))) {
+    if (UNKNOWN_PATTERNS.every(pattern => pattern.test(normalized))) {
       result.add(UNKNOWN_FAMILY);
       continue;

[Survived] CallExpression
helpers/license/families.ts:103:7
   for (const token of splitTokens(raw)) {
     const normalized = token.toLowerCase();
     if (UNKNOWN_PATTERNS.some((pattern) => pattern.test(normalized))) {
-      result.add(UNKNOWN_FAMILY);
+      ;
       continue;
     }

[Survived] LogicalOperator
helpers/license/families.ts:106:16
       result.add(UNKNOWN_FAMILY);
       continue;
     }
-    result.add(matchAlias(normalized) ?? UNKNOWN_FAMILY);
+    result.add(matchAlias(normalized) && UNKNOWN_FAMILY);
   }
   return result;
