[Survived] BlockStatement
helpers/map/filter.ts:20:14
 export function filter<K, V>(
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
-): Map<K, V> {
-  const result = new Map<K, V>();
-  for (const [key, value] of map) {
-    if (predicate(value, key)) {
-      result.set(key, value);
-    }
-  }
-  return result;
-}
+): Map<K, V> {}
 

[Survived] BlockStatement
helpers/map/filter.ts:22:35
   predicate: (value: V, key: K) => boolean,
 ): Map<K, V> {
   const result = new Map<K, V>();
-  for (const [key, value] of map) {
-    if (predicate(value, key)) {
-      result.set(key, value);
-    }
-  }
+  for (const [key, value] of map) {}
   return result;
 }

[Survived] BlockStatement
helpers/map/filter.ts:23:32
 ): Map<K, V> {
   const result = new Map<K, V>();
   for (const [key, value] of map) {
-    if (predicate(value, key)) {
-      result.set(key, value);
-    }
+    if (predicate(value, key)) {}
   }
   return result;

[Survived] ConditionalExpression
helpers/map/filter.ts:23:9
 ): Map<K, V> {
   const result = new Map<K, V>();
   for (const [key, value] of map) {
-    if (predicate(value, key)) {
+    if (false) {
       result.set(key, value);
     }

[Survived] CallExpression
helpers/map/filter.ts:24:7
   const result = new Map<K, V>();
   for (const [key, value] of map) {
     if (predicate(value, key)) {
-      result.set(key, value);
+      ;
     }
   }
