[Survived] BlockStatement
helpers/map/mapKeys.ts:21:14
 export function mapKeys<K, V, R>(
   map: ReadonlyMap<K, V>,
   fn: (key: K, value: V) => R,
-): Map<R, V> {
-  const result = new Map<R, V>();
-  for (const [key, value] of map) {
-    result.set(fn(key, value), value);
-  }
-  return result;
-}
+): Map<R, V> {}
 

[Survived] BlockStatement
helpers/map/mapKeys.ts:23:35
   fn: (key: K, value: V) => R,
 ): Map<R, V> {
   const result = new Map<R, V>();
-  for (const [key, value] of map) {
-    result.set(fn(key, value), value);
-  }
+  for (const [key, value] of map) {}
   return result;
 }

[Survived] CallExpression
helpers/map/mapKeys.ts:24:5
 ): Map<R, V> {
   const result = new Map<R, V>();
   for (const [key, value] of map) {
-    result.set(fn(key, value), value);
+    ;
   }
   return result;
