[Survived] BlockStatement
helpers/map/toMapByKey.ts:22:85
  * // => Map(2) { 'a' => { id: 'a', n: 1 }, 'b' => { id: 'b', n: 2 } }
  * @since 3.0.3
  */
-export function toMapByKey<T, K>(items: Iterable<T>, fn: (item: T) => K): Map<K, T> {
-  const result = new Map<K, T>();
-  for (const item of items) {
-    result.set(fn(item), item);
-  }
-  return result;
-}
+export function toMapByKey<T, K>(items: Iterable<T>, fn: (item: T) => K): Map<K, T> {}
 

[Survived] BlockStatement
helpers/map/toMapByKey.ts:24:29
  */
 export function toMapByKey<T, K>(items: Iterable<T>, fn: (item: T) => K): Map<K, T> {
   const result = new Map<K, T>();
-  for (const item of items) {
-    result.set(fn(item), item);
-  }
+  for (const item of items) {}
   return result;
 }

[Survived] CallExpression
helpers/map/toMapByKey.ts:25:5
 export function toMapByKey<T, K>(items: Iterable<T>, fn: (item: T) => K): Map<K, T> {
   const result = new Map<K, T>();
   for (const item of items) {
-    result.set(fn(item), item);
+    ;
   }
   return result;
