[Survived] BlockStatement
helpers/node/isNodeStream.ts:23:98
  * isNodeStream(null)           // => false
  * @since 2.0.3
  */
-export function isNodeStream(value: unknown): value is { pipe: (...args: unknown[]) => unknown } {
-  return (
-    // Intentionally `object`-only, unlike `isPromiseLike` (see type/isPromiseLike.ts):
-    // a callable function exposing `.pipe()` would be an unusual, contrived stream shape.
-    value !== null &&
-    typeof value === 'object' &&
-    typeof (value as Record<string, unknown>)['pipe'] === 'function'
-  );
-}
+export function isNodeStream(value: unknown): value is { pipe: (...args: unknown[]) => unknown } {}
 

[Survived] EqualityOperator
helpers/node/isNodeStream.ts:27:5
   return (
     // Intentionally `object`-only, unlike `isPromiseLike` (see type/isPromiseLike.ts):
     // a callable function exposing `.pipe()` would be an unusual, contrived stream shape.
-    value !== null &&
+    value === null &&
     typeof value === 'object' &&
     typeof (value as Record<string, unknown>)['pipe'] === 'function'

[Survived] ConditionalExpression
helpers/node/isNodeStream.ts:27:5
   return (
     // Intentionally `object`-only, unlike `isPromiseLike` (see type/isPromiseLike.ts):
     // a callable function exposing `.pipe()` would be an unusual, contrived stream shape.
-    value !== null &&
-    typeof value === 'object' &&
-    typeof (value as Record<string, unknown>)['pipe'] === 'function'
+    true
   );
 }

[Survived] ConditionalExpression
helpers/node/isNodeStream.ts:29:5
     // a callable function exposing `.pipe()` would be an unusual, contrived stream shape.
     value !== null &&
     typeof value === 'object' &&
-    typeof (value as Record<string, unknown>)['pipe'] === 'function'
+    true
   );
 }

[Survived] EqualityOperator
helpers/node/isNodeStream.ts:29:5
     // a callable function exposing `.pipe()` would be an unusual, contrived stream shape.
     value !== null &&
     typeof value === 'object' &&
-    typeof (value as Record<string, unknown>)['pipe'] === 'function'
+    typeof (value as Record<string, unknown>)['pipe'] !== 'function'
   );
 }
