[Survived] BlockStatement
helpers/number/formatSize.ts:51:84
  * formatSize(512, { unitSeparator: ' ', integerBelowFirstUnit: true })   // '512 B'
  * @since 2.0.0
  */
-export function formatSize(bytes: number, options: FormatSizeOptions = {}): string {
-  const { unitSeparator = '', integerBelowFirstUnit = false } = options;
-  let size = bytes;
-  let unitIndex = 0;
-
-  while (size >= 1024 && unitIndex < UNITS.length - 1) {
-    size /= 1024;
-    unitIndex++;
-  }
-
-  const formattedSize = unitIndex === 0 && integerBelowFirstUnit ? `${size}` : size.toFixed(1);
-  return `${formattedSize}${unitSeparator}${UNITS[unitIndex]}`;
-}
+export function formatSize(bytes: number, options: FormatSizeOptions = {}): string {}
 

[Survived] BooleanLiteral
helpers/number/formatSize.ts:52:55
  * @since 2.0.0
  */
 export function formatSize(bytes: number, options: FormatSizeOptions = {}): string {
-  const { unitSeparator = '', integerBelowFirstUnit = false } = options;
+  const { unitSeparator = '', integerBelowFirstUnit = true } = options;
   let size = bytes;
   let unitIndex = 0;

[Survived] BlockStatement
helpers/number/formatSize.ts:56:56
   let size = bytes;
   let unitIndex = 0;
 
-  while (size >= 1024 && unitIndex < UNITS.length - 1) {
-    size /= 1024;
-    unitIndex++;
-  }
+  while (size >= 1024 && unitIndex < UNITS.length - 1) {}
 
   const formattedSize = unitIndex === 0 && integerBelowFirstUnit ? `${size}` : size.toFixed(1);

[Survived] LogicalOperator
helpers/number/formatSize.ts:61:25
     unitIndex++;
   }
 
-  const formattedSize = unitIndex === 0 && integerBelowFirstUnit ? `${size}` : size.toFixed(1);
+  const formattedSize = unitIndex === 0 || integerBelowFirstUnit ? `${size}` : size.toFixed(1);
   return `${formattedSize}${unitSeparator}${UNITS[unitIndex]}`;
 }

[Survived] ConditionalExpression
helpers/number/formatSize.ts:61:25
     unitIndex++;
   }
 
-  const formattedSize = unitIndex === 0 && integerBelowFirstUnit ? `${size}` : size.toFixed(1);
+  const formattedSize = false ? `${size}` : size.toFixed(1);
   return `${formattedSize}${unitSeparator}${UNITS[unitIndex]}`;
 }
