[Survived] BlockStatement
helpers/number/isOdd.ts:23:56
  * isOdd('3')  // => false
  * @since 2.0.3
  */
-export function isOdd(value: unknown): value is number {
-  return typeof value === 'number' && Number.isInteger(value) && value % 2 !== 0;
-}
+export function isOdd(value: unknown): value is number {}
 

[Survived] ConditionalExpression
helpers/number/isOdd.ts:24:10
  * @since 2.0.3
  */
 export function isOdd(value: unknown): value is number {
-  return typeof value === 'number' && Number.isInteger(value) && value % 2 !== 0;
+  return false;
 }
 

[Survived] ArithmeticOperator
helpers/number/isOdd.ts:24:66
  * @since 2.0.3
  */
 export function isOdd(value: unknown): value is number {
-  return typeof value === 'number' && Number.isInteger(value) && value % 2 !== 0;
+  return typeof value === 'number' && Number.isInteger(value) && value * 2 !== 0;
 }
 
