[Survived] BlockStatement
helpers/object/cloneDeep.ts:34:41
  * cloneDeep(null) // => null
  * @since 1.9.0
  */
-export function cloneDeep<T>(obj: T): T {
-  if (obj === null || typeof obj !== 'object') {
-    return obj;
-  }
-
-  if (obj instanceof Date) {
-    return new Date(obj.getTime()) as T;
-  }
-
-  if (Array.isArray(obj)) {
-    return obj.map(item => cloneDeep(item)) as T;
-  }
-
-  const cloned = {} as T;
-  for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
-      cloned[key] = cloneDeep(obj[key]);
-    }
-  }
-
-  return cloned;
-}
+export function cloneDeep<T>(obj: T): T {}
 

[Survived] ConditionalExpression
helpers/object/cloneDeep.ts:35:7
  * @since 1.9.0
  */
 export function cloneDeep<T>(obj: T): T {
-  if (obj === null || typeof obj !== 'object') {
+  if (false) {
     return obj;
   }

[Survived] ConditionalExpression
helpers/object/cloneDeep.ts:35:7
  * @since 1.9.0
  */
 export function cloneDeep<T>(obj: T): T {
-  if (obj === null || typeof obj !== 'object') {
+  if (false || typeof obj !== 'object') {
     return obj;
   }

[Survived] BlockStatement
helpers/object/cloneDeep.ts:48:26
   }
 
   const cloned = {} as T;
-  for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
-      cloned[key] = cloneDeep(obj[key]);
-    }
-  }
+  for (const key in obj) {}
 
   return cloned;

[Survived] BlockStatement
helpers/object/cloneDeep.ts:49:82
 
   const cloned = {} as T;
   for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
-      cloned[key] = cloneDeep(obj[key]);
-    }
+    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {}
   }
 

[Survived] ConditionalExpression
helpers/object/cloneDeep.ts:49:9
 
   const cloned = {} as T;
   for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
+    if (true) {
       cloned[key] = cloneDeep(obj[key]);
     }
