[Survived] BlockStatement
helpers/object/invert.ts:29:117
  * // => {}
  * @since 2.0.0
  */
-export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V> | null | undefined): Record<V, K> {
-  const result = {} as Record<V, K>;
-  if (obj == null) return result;
-  for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
-      const val = obj[key as K];
-      if (typeof val === 'string' && UNSAFE_KEYS.has(val)) continue;
-      result[val] = key as unknown as K;
-    }
-  }
-  return result;
-}
+export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V> | null | undefined): Record<V, K> {}
 

[Survived] ConditionalExpression
helpers/object/invert.ts:31:7
  */
 export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V> | null | undefined): Record<V, K> {
   const result = {} as Record<V, K>;
-  if (obj == null) return result;
+  if (false) return result;
   for (const key in obj) {
     if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {

[Survived] ConditionalExpression
helpers/object/invert.ts:31:7
  */
 export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V> | null | undefined): Record<V, K> {
   const result = {} as Record<V, K>;
-  if (obj == null) return result;
+  if (true) return result;
   for (const key in obj) {
     if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {

[Survived] BlockStatement
helpers/object/invert.ts:32:26
 export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V> | null | undefined): Record<V, K> {
   const result = {} as Record<V, K>;
   if (obj == null) return result;
-  for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
-      const val = obj[key as K];
-      if (typeof val === 'string' && UNSAFE_KEYS.has(val)) continue;
-      result[val] = key as unknown as K;
-    }
-  }
+  for (const key in obj) {}
   return result;
 }

[Survived] BooleanLiteral
helpers/object/invert.ts:33:59
   const result = {} as Record<V, K>;
   if (obj == null) return result;
   for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
+    if (Object.prototype.hasOwnProperty.call(obj, key) && UNSAFE_KEYS.has(key)) {
       const val = obj[key as K];
       if (typeof val === 'string' && UNSAFE_KEYS.has(val)) continue;

[Survived] LogicalOperator
helpers/object/invert.ts:35:11
   for (const key in obj) {
     if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
       const val = obj[key as K];
-      if (typeof val === 'string' && UNSAFE_KEYS.has(val)) continue;
+      if (typeof val === 'string' || UNSAFE_KEYS.has(val)) continue;
       result[val] = key as unknown as K;
     }

[Survived] ConditionalExpression
helpers/object/invert.ts:35:11
   for (const key in obj) {
     if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
       const val = obj[key as K];
-      if (typeof val === 'string' && UNSAFE_KEYS.has(val)) continue;
+      if (true) continue;
       result[val] = key as unknown as K;
     }
