[Survived] BlockStatement
helpers/object/map.ts:45:23
   obj: TObj | null | undefined,
   mapValue?: (value: TObj[keyof TObj], key: keyof TObj) => TVal,
   mapKey?: (key: keyof TObj, value: TObj[keyof TObj]) => TKey
-): Record<TKey, TVal> {
-  const result = {} as Record<TKey, TVal>;
-  if (obj == null) return result;
-  for (const key of Object.keys(obj) as (keyof TObj)[]) {
-    const value = obj[key];
-    const newKey = mapKey ? mapKey(key, value) : (key as unknown as TKey);
-    if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
-    const newVal = mapValue ? mapValue(value, key) : (value as unknown as TVal);
-    result[newKey] = newVal;
-  }
-  return result;
-}
+): Record<TKey, TVal> {}
 

[Survived] EqualityOperator
helpers/object/map.ts:47:7
   mapKey?: (key: keyof TObj, value: TObj[keyof TObj]) => TKey
 ): Record<TKey, TVal> {
   const result = {} as Record<TKey, TVal>;
-  if (obj == null) return result;
+  if (obj != null) return result;
   for (const key of Object.keys(obj) as (keyof TObj)[]) {
     const value = obj[key];

[Survived] ConditionalExpression
helpers/object/map.ts:47:7
   mapKey?: (key: keyof TObj, value: TObj[keyof TObj]) => TKey
 ): Record<TKey, TVal> {
   const result = {} as Record<TKey, TVal>;
-  if (obj == null) return result;
+  if (false) return result;
   for (const key of Object.keys(obj) as (keyof TObj)[]) {
     const value = obj[key];

[Survived] BlockStatement
helpers/object/map.ts:48:57
 ): Record<TKey, TVal> {
   const result = {} as Record<TKey, TVal>;
   if (obj == null) return result;
-  for (const key of Object.keys(obj) as (keyof TObj)[]) {
-    const value = obj[key];
-    const newKey = mapKey ? mapKey(key, value) : (key as unknown as TKey);
-    if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
-    const newVal = mapValue ? mapValue(value, key) : (value as unknown as TVal);
-    result[newKey] = newVal;
-  }
+  for (const key of Object.keys(obj) as (keyof TObj)[]) {}
   return result;
 }

[Survived] ConditionalExpression
helpers/object/map.ts:51:9
   for (const key of Object.keys(obj) as (keyof TObj)[]) {
     const value = obj[key];
     const newKey = mapKey ? mapKey(key, value) : (key as unknown as TKey);
-    if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
+    if (true) continue;
     const newVal = mapValue ? mapValue(value, key) : (value as unknown as TVal);
     result[newKey] = newVal;

[Survived] ConditionalExpression
helpers/object/map.ts:51:9
   for (const key of Object.keys(obj) as (keyof TObj)[]) {
     const value = obj[key];
     const newKey = mapKey ? mapKey(key, value) : (key as unknown as TKey);
-    if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
+    if (true && UNSAFE_KEYS.has(newKey)) continue;
     const newVal = mapValue ? mapValue(value, key) : (value as unknown as TVal);
     result[newKey] = newVal;
