[Survived] BlockStatement
helpers/object/omitBy.ts:25:34
 export function omitBy<T extends Record<string, unknown>>(
   obj: T | undefined | null,
   predicate: (value: T[keyof T], key: keyof T) => boolean,
-): Partial<T> | undefined | null {
-  if (obj == null) return obj;
-  const result: Record<string, unknown> = {};
-  for (const key of Object.keys(obj)) {
-    const typedKey = key as keyof T;
-    if (!predicate(obj[typedKey], typedKey)) {
-      result[key] = obj[typedKey];
-    }
-  }
-  return result as Partial<T>;
-}
+): Partial<T> | undefined | null {}
 

[Survived] EqualityOperator
helpers/object/omitBy.ts:26:7
   obj: T | undefined | null,
   predicate: (value: T[keyof T], key: keyof T) => boolean,
 ): Partial<T> | undefined | null {
-  if (obj == null) return obj;
+  if (obj != null) return obj;
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(obj)) {

[Survived] ConditionalExpression
helpers/object/omitBy.ts:26:7
   obj: T | undefined | null,
   predicate: (value: T[keyof T], key: keyof T) => boolean,
 ): Partial<T> | undefined | null {
-  if (obj == null) return obj;
+  if (true) return obj;
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(obj)) {

[Survived] BlockStatement
helpers/object/omitBy.ts:28:39
 ): Partial<T> | undefined | null {
   if (obj == null) return obj;
   const result: Record<string, unknown> = {};
-  for (const key of Object.keys(obj)) {
-    const typedKey = key as keyof T;
-    if (!predicate(obj[typedKey], typedKey)) {
-      result[key] = obj[typedKey];
-    }
-  }
+  for (const key of Object.keys(obj)) {}
   return result as Partial<T>;
 }

[Survived] ConditionalExpression
helpers/object/omitBy.ts:30:9
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(obj)) {
     const typedKey = key as keyof T;
-    if (!predicate(obj[typedKey], typedKey)) {
+    if (false) {
       result[key] = obj[typedKey];
     }

[Survived] BlockStatement
helpers/object/omitBy.ts:30:46
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(obj)) {
     const typedKey = key as keyof T;
-    if (!predicate(obj[typedKey], typedKey)) {
-      result[key] = obj[typedKey];
-    }
+    if (!predicate(obj[typedKey], typedKey)) {}
   }
   return result as Partial<T>;
