[Survived] BlockStatement
helpers/object/pickBy.ts:27:34
 export function pickBy<T extends Record<string, unknown>>(
   obj: T | undefined | null,
   predicate: (value: T[keyof T], key: keyof T) => boolean,
-): Partial<T> | undefined | null {
-  if (obj == null) return obj;
-  const result: Record<string, unknown> = {};
-  for (const key of Object.keys(obj)) {
-    if (UNSAFE_KEYS.has(key)) continue;
-    const typedKey = key as keyof T;
-    if (predicate(obj[typedKey], typedKey)) {
-      result[key] = obj[typedKey];
-    }
-  }
-  return result as Partial<T>;
-}
+): Partial<T> | undefined | null {}
 

[Survived] ConditionalExpression
helpers/object/pickBy.ts:28:7
   obj: T | undefined | null,
   predicate: (value: T[keyof T], key: keyof T) => boolean,
 ): Partial<T> | undefined | null {
-  if (obj == null) return obj;
+  if (false) return obj;
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(obj)) {

[Survived] BlockStatement
helpers/object/pickBy.ts:30:39
 ): Partial<T> | undefined | null {
   if (obj == null) return obj;
   const result: Record<string, unknown> = {};
-  for (const key of Object.keys(obj)) {
-    if (UNSAFE_KEYS.has(key)) continue;
-    const typedKey = key as keyof T;
-    if (predicate(obj[typedKey], typedKey)) {
-      result[key] = obj[typedKey];
-    }
-  }
+  for (const key of Object.keys(obj)) {}
   return result as Partial<T>;
 }

[Survived] ConditionalExpression
helpers/object/pickBy.ts:31:9
   if (obj == null) return obj;
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(obj)) {
-    if (UNSAFE_KEYS.has(key)) continue;
+    if (false) continue;
     const typedKey = key as keyof T;
     if (predicate(obj[typedKey], typedKey)) {

[Survived] ConditionalExpression
helpers/object/pickBy.ts:31:9
   if (obj == null) return obj;
   const result: Record<string, unknown> = {};
   for (const key of Object.keys(obj)) {
-    if (UNSAFE_KEYS.has(key)) continue;
+    if (true) continue;
     const typedKey = key as keyof T;
     if (predicate(obj[typedKey], typedKey)) {

[Survived] ConditionalExpression
helpers/object/pickBy.ts:33:9
   for (const key of Object.keys(obj)) {
     if (UNSAFE_KEYS.has(key)) continue;
     const typedKey = key as keyof T;
-    if (predicate(obj[typedKey], typedKey)) {
+    if (false) {
       result[key] = obj[typedKey];
     }

[Survived] BlockStatement
helpers/object/pickBy.ts:33:45
   for (const key of Object.keys(obj)) {
     if (UNSAFE_KEYS.has(key)) continue;
     const typedKey = key as keyof T;
-    if (predicate(obj[typedKey], typedKey)) {
-      result[key] = obj[typedKey];
-    }
+    if (predicate(obj[typedKey], typedKey)) {}
   }
   return result as Partial<T>;
