[Survived] BlockStatement
helpers/object/snakeCaseKeys.ts:24:47
  * // => { user_name: 'Alice', home_address: { zip_code: '12345' } }
  * @since 3.0.3
  */
-export function snakeCaseKeys<T>(value: T): T {
-  return mapDeep(value, undefined, snakeCase);
-}
+export function snakeCaseKeys<T>(value: T): T {}
 
