[Survived] BlockStatement
helpers/object/unset.ts:32:91
  * // => { a: 1 }
  * @since 3.0.0
  */
-export function unset<T extends object>(obj: T, path: string | readonly PropertyKey[]): T {
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
-
-  if (keys.length === 0) return obj;
-  if (keys.some((key) => typeof key === 'string' && UNSAFE_KEYS.has(key))) return obj;
-
-  let current: unknown = obj;
-  for (let i = 0; i < keys.length - 1; i++) {
-    if (current == null || typeof current !== 'object') return obj;
-    current = (current as Record<PropertyKey, unknown>)[keys[i]];
-  }
-
-  if (current != null && typeof current === 'object') {
-    delete (current as Record<PropertyKey, unknown>)[keys[keys.length - 1]];
-  }
-
-  return obj;
-}
+export function unset<T extends object>(obj: T, path: string | readonly PropertyKey[]): T {}
 

[Survived] EqualityOperator
helpers/object/unset.ts:33:40
  * @since 3.0.0
  */
 export function unset<T extends object>(obj: T, path: string | readonly PropertyKey[]): T {
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
+  const keys: readonly PropertyKey[] = typeof path !== 'string' ? parsePropertyPath(path) : path;
 
   if (keys.length === 0) return obj;

[Survived] ConditionalExpression
helpers/object/unset.ts:33:40
  * @since 3.0.0
  */
 export function unset<T extends object>(obj: T, path: string | readonly PropertyKey[]): T {
-  const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
+  const keys: readonly PropertyKey[] = true ? parsePropertyPath(path) : path;
 
   if (keys.length === 0) return obj;

[Survived] ConditionalExpression
helpers/object/unset.ts:35:7
 export function unset<T extends object>(obj: T, path: string | readonly PropertyKey[]): T {
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
 
-  if (keys.length === 0) return obj;
+  if (true) return obj;
   if (keys.some((key) => typeof key === 'string' && UNSAFE_KEYS.has(key))) return obj;
 

[Survived] LogicalOperator
helpers/object/unset.ts:36:26
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
 
   if (keys.length === 0) return obj;
-  if (keys.some((key) => typeof key === 'string' && UNSAFE_KEYS.has(key))) return obj;
+  if (keys.some((key) => typeof key === 'string' || UNSAFE_KEYS.has(key))) return obj;
 
   let current: unknown = obj;

[Survived] EqualityOperator
helpers/object/unset.ts:36:26
   const keys: readonly PropertyKey[] = typeof path === 'string' ? parsePropertyPath(path) : path;
 
   if (keys.length === 0) return obj;
-  if (keys.some((key) => typeof key === 'string' && UNSAFE_KEYS.has(key))) return obj;
+  if (keys.some((key) => typeof key !== 'string' && UNSAFE_KEYS.has(key))) return obj;
 
   let current: unknown = obj;

[Survived] EqualityOperator
helpers/object/unset.ts:39:19
   if (keys.some((key) => typeof key === 'string' && UNSAFE_KEYS.has(key))) return obj;
 
   let current: unknown = obj;
-  for (let i = 0; i < keys.length - 1; i++) {
+  for (let i = 0; i <= keys.length - 1; i++) {
     if (current == null || typeof current !== 'object') return obj;
     current = (current as Record<PropertyKey, unknown>)[keys[i]];

[Survived] BlockStatement
helpers/object/unset.ts:39:45
   if (keys.some((key) => typeof key === 'string' && UNSAFE_KEYS.has(key))) return obj;
 
   let current: unknown = obj;
-  for (let i = 0; i < keys.length - 1; i++) {
-    if (current == null || typeof current !== 'object') return obj;
-    current = (current as Record<PropertyKey, unknown>)[keys[i]];
-  }
+  for (let i = 0; i < keys.length - 1; i++) {}
 
   if (current != null && typeof current === 'object') {

[Survived] ConditionalExpression
helpers/object/unset.ts:40:9
 
   let current: unknown = obj;
   for (let i = 0; i < keys.length - 1; i++) {
-    if (current == null || typeof current !== 'object') return obj;
+    if (false) return obj;
     current = (current as Record<PropertyKey, unknown>)[keys[i]];
   }

[Survived] ConditionalExpression
helpers/object/unset.ts:40:9
 
   let current: unknown = obj;
   for (let i = 0; i < keys.length - 1; i++) {
-    if (current == null || typeof current !== 'object') return obj;
+    if (false || typeof current !== 'object') return obj;
     current = (current as Record<PropertyKey, unknown>)[keys[i]];
   }

[Survived] ConditionalExpression
helpers/object/unset.ts:44:7
     current = (current as Record<PropertyKey, unknown>)[keys[i]];
   }
 
-  if (current != null && typeof current === 'object') {
+  if (false) {
     delete (current as Record<PropertyKey, unknown>)[keys[keys.length - 1]];
   }

[Survived] LogicalOperator
helpers/object/unset.ts:44:7
     current = (current as Record<PropertyKey, unknown>)[keys[i]];
   }
 
-  if (current != null && typeof current === 'object') {
+  if (current != null || typeof current === 'object') {
     delete (current as Record<PropertyKey, unknown>)[keys[keys.length - 1]];
   }

[Survived] ArithmeticOperator
helpers/object/unset.ts:45:59
   }
 
   if (current != null && typeof current === 'object') {
-    delete (current as Record<PropertyKey, unknown>)[keys[keys.length - 1]];
+    delete (current as Record<PropertyKey, unknown>)[keys[keys.length + 1]];
   }
 
