[Survived] BlockStatement
helpers/observable/isObservable.ts:26:76
  * isObservable({})                // => false
  * @since 2.0.3
  */
-export function isObservable(value: unknown): value is Observable<unknown> {
-  return (
-    // Intentionally `object`-only, unlike `isPromiseLike` (see type/isPromiseLike.ts):
-    // a callable function exposing `.subscribe()`/`.pipe()` would be an unusual,
-    // contrived observable shape.
-    value !== null &&
-    typeof value === 'object' &&
-    typeof (value as Record<string, unknown>)['subscribe'] === 'function' &&
-    typeof (value as Record<string, unknown>)['pipe'] === 'function'
-  );
-}
+export function isObservable(value: unknown): value is Observable<unknown> {}
 

[Survived] LogicalOperator
helpers/observable/isObservable.ts:31:5
     // Intentionally `object`-only, unlike `isPromiseLike` (see type/isPromiseLike.ts):
     // a callable function exposing `.subscribe()`/`.pipe()` would be an unusual,
     // contrived observable shape.
-    value !== null &&
-    typeof value === 'object' &&
+    value !== null || typeof value === 'object' &&
     typeof (value as Record<string, unknown>)['subscribe'] === 'function' &&
     typeof (value as Record<string, unknown>)['pipe'] === 'function'

[Survived] ConditionalExpression
helpers/observable/isObservable.ts:31:5
     // Intentionally `object`-only, unlike `isPromiseLike` (see type/isPromiseLike.ts):
     // a callable function exposing `.subscribe()`/`.pipe()` would be an unusual,
     // contrived observable shape.
-    value !== null &&
-    typeof value === 'object' &&
-    typeof (value as Record<string, unknown>)['subscribe'] === 'function' &&
-    typeof (value as Record<string, unknown>)['pipe'] === 'function'
+    true
   );
 }

[Survived] ConditionalExpression
helpers/observable/isObservable.ts:33:5
     // contrived observable shape.
     value !== null &&
     typeof value === 'object' &&
-    typeof (value as Record<string, unknown>)['subscribe'] === 'function' &&
+    true &&
     typeof (value as Record<string, unknown>)['pipe'] === 'function'
   );

[Survived] EqualityOperator
helpers/observable/isObservable.ts:33:5
     // contrived observable shape.
     value !== null &&
     typeof value === 'object' &&
-    typeof (value as Record<string, unknown>)['subscribe'] === 'function' &&
+    typeof (value as Record<string, unknown>)['subscribe'] !== 'function' &&
     typeof (value as Record<string, unknown>)['pipe'] === 'function'
   );

[Survived] EqualityOperator
helpers/observable/isObservable.ts:34:5
     value !== null &&
     typeof value === 'object' &&
     typeof (value as Record<string, unknown>)['subscribe'] === 'function' &&
-    typeof (value as Record<string, unknown>)['pipe'] === 'function'
+    typeof (value as Record<string, unknown>)['pipe'] !== 'function'
   );
 }

[Survived] ConditionalExpression
helpers/observable/isObservable.ts:34:5
     value !== null &&
     typeof value === 'object' &&
     typeof (value as Record<string, unknown>)['subscribe'] === 'function' &&
-    typeof (value as Record<string, unknown>)['pipe'] === 'function'
+    true
   );
 }
