[Survived] CallExpression
helpers/promise/defer.ts:43:5
 ): Promise<T> {
   const callbacks: DeferCallback[] = [];
   const addDefer = (cb: DeferCallback): void => {
-    callbacks.push(cb);
+    ;
   };
 
