[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:16:27
  */
 export function meaningPromiseOrThrow<T>(
   error: string
-): (data: T) => T | never {
-  return (data: T) => {
-    if (isMeaningless(data)) {
-      throw new Error(error); // eslint-disable-line functional/no-throw-statement
-    }
-    return data;
-  };
-}
+): (data: T) => T | never {}
 
 function isMeaningless(value: unknown): boolean {
killedBy: unset is a no-op when the direct parent of the final key resolves to null
statusReason: expected undefined to be 'My custom error message' // Object.is equality

[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:17:23
 export function meaningPromiseOrThrow<T>(
   error: string
 ): (data: T) => T | never {
-  return (data: T) => {
-    if (isMeaningless(data)) {
-      throw new Error(error); // eslint-disable-line functional/no-throw-statement
-    }
-    return data;
-  };
+  return (data: T) => {};
 }
 
killedBy: unset is a no-op when the direct parent of the final key resolves to null
statusReason: expected undefined to be 'My custom error message' // Object.is equality

[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:18:30
   error: string
 ): (data: T) => T | never {
   return (data: T) => {
-    if (isMeaningless(data)) {
-      throw new Error(error); // eslint-disable-line functional/no-throw-statement
-    }
+    if (isMeaningless(data)) {}
     return data;
   };
killedBy: unset is a no-op when the direct parent of the final key resolves to null
statusReason: expected undefined to be 'My custom error message' // Object.is equality

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:18:9
   error: string
 ): (data: T) => T | never {
   return (data: T) => {
-    if (isMeaningless(data)) {
+    if (true) {
       throw new Error(error); // eslint-disable-line functional/no-throw-statement
     }
killedBy: unset actually deletes the key rather than setting it to undefined
statusReason: expected 'My custom error message' to be 'some string' // Object.is equality

[Killed] CallExpression
helpers/promise/meaningPromiseOrThrow.ts:19:7
 ): (data: T) => T | never {
   return (data: T) => {
     if (isMeaningless(data)) {
-      throw new Error(error); // eslint-disable-line functional/no-throw-statement
+      ; // eslint-disable-line functional/no-throw-statement
     }
     return data;
killedBy: unset is a no-op when the direct parent of the final key resolves to null
statusReason: expected undefined to be 'My custom error message' // Object.is equality

[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:25:49
   };
 }
 
-function isMeaningless(value: unknown): boolean {
-  if (value === undefined || value === null || value === '') return true;
-  if (Array.isArray(value)) return value.length === 0;
-  if (typeof value === 'object') {
-    return Object.keys(value).length === 0 && Object.getPrototypeOf(value) === Object.prototype;
-  }
-  return false;
-}
+function isMeaningless(value: unknown): boolean {}
 
killedBy: unset is a no-op when the direct parent of the final key resolves to null
statusReason: expected undefined to be 'My custom error message' // Object.is equality

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:26:30
 }
 
 function isMeaningless(value: unknown): boolean {
-  if (value === undefined || value === null || value === '') return true;
+  if (value === undefined || false || value === '') return true;
   if (Array.isArray(value)) return value.length === 0;
   if (typeof value === 'object') {
killedBy: unset is a no-op for an empty path
statusReason: expected 'Cannot convert undefined or null to o…' to be 'My custom error message' // Object.is equality

[Killed] EqualityOperator
helpers/promise/meaningPromiseOrThrow.ts:26:30
 }
 
 function isMeaningless(value: unknown): boolean {
-  if (value === undefined || value === null || value === '') return true;
+  if (value === undefined || value !== null || value === '') return true;
   if (Array.isArray(value)) return value.length === 0;
   if (typeof value === 'object') {
killedBy: unset is a no-op for an empty path
statusReason: expected 'Cannot convert undefined or null to o…' to be 'My custom error message' // Object.is equality

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:27:7
 
 function isMeaningless(value: unknown): boolean {
   if (value === undefined || value === null || value === '') return true;
-  if (Array.isArray(value)) return value.length === 0;
+  if (false) return value.length === 0;
   if (typeof value === 'object') {
     return Object.keys(value).length === 0 && Object.getPrototypeOf(value) === Object.prototype;
killedBy: unset accepts an explicit PropertyKey[] path
statusReason: expected [] to be 'My custom error message' // Object.is equality

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:27:7
 
 function isMeaningless(value: unknown): boolean {
   if (value === undefined || value === null || value === '') return true;
-  if (Array.isArray(value)) return value.length === 0;
+  if (true) return value.length === 0;
   if (typeof value === 'object') {
     return Object.keys(value).length === 0 && Object.getPrototypeOf(value) === Object.prototype;
killedBy: unset accepts symbol keys via PropertyKey[] path
statusReason: expected {} to be 'My custom error message' // Object.is equality

[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:28:34
 function isMeaningless(value: unknown): boolean {
   if (value === undefined || value === null || value === '') return true;
   if (Array.isArray(value)) return value.length === 0;
-  if (typeof value === 'object') {
-    return Object.keys(value).length === 0 && Object.getPrototypeOf(value) === Object.prototype;
-  }
+  if (typeof value === 'object') {}
   return false;
 }
killedBy: unset accepts symbol keys via PropertyKey[] path
statusReason: expected {} to be 'My custom error message' // Object.is equality

[Killed] EqualityOperator
helpers/promise/meaningPromiseOrThrow.ts:28:7
 function isMeaningless(value: unknown): boolean {
   if (value === undefined || value === null || value === '') return true;
   if (Array.isArray(value)) return value.length === 0;
-  if (typeof value === 'object') {
+  if (typeof value !== 'object') {
     return Object.keys(value).length === 0 && Object.getPrototypeOf(value) === Object.prototype;
   }
killedBy: unset accepts symbol keys via PropertyKey[] path
statusReason: expected {} to be 'My custom error message' // Object.is equality

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:29:47
   if (value === undefined || value === null || value === '') return true;
   if (Array.isArray(value)) return value.length === 0;
   if (typeof value === 'object') {
-    return Object.keys(value).length === 0 && Object.getPrototypeOf(value) === Object.prototype;
+    return Object.keys(value).length === 0 && true;
   }
   return false;
killedBy: parallel — contract empty array returns []
statusReason: should not throw

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:29:12
   if (value === undefined || value === null || value === '') return true;
   if (Array.isArray(value)) return value.length === 0;
   if (typeof value === 'object') {
-    return Object.keys(value).length === 0 && Object.getPrototypeOf(value) === Object.prototype;
+    return true;
   }
   return false;
killedBy: parallel — property-based all functions are executed
statusReason: expected 'My custom error message' to be { prop: 42 } // Object.is equality
