[Killed] BlockStatement
helpers/promise/truthyPromiseOrThrow.ts:13:80
  * @returns A function that returns the data if truthy, or throws
  * @since 1.0.0
  */
-export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {
-  return (data: T) => {
-    if (data) {
-      return data;
-    }
-    throw new Error(error); // eslint-disable-line functional/no-throw-statement
-  };
-}
+export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {}
 
killedBy: mapAsync — contract empty array resolves to []
statusReason: expected undefined to be 'My custom error message' // Object.is equality

[Killed] BlockStatement
helpers/promise/truthyPromiseOrThrow.ts:14:23
  * @since 1.0.0
  */
 export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {
-  return (data: T) => {
-    if (data) {
-      return data;
-    }
-    throw new Error(error); // eslint-disable-line functional/no-throw-statement
-  };
+  return (data: T) => {};
 }
 
killedBy: mapAsync — contract empty array resolves to []
statusReason: expected undefined to be 'My custom error message' // Object.is equality

[Killed] BlockStatement
helpers/promise/truthyPromiseOrThrow.ts:15:15
  */
 export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {
   return (data: T) => {
-    if (data) {
-      return data;
-    }
+    if (data) {}
     throw new Error(error); // eslint-disable-line functional/no-throw-statement
   };
killedBy: isNegative — contract -Infinity → true
statusReason: expected 'My custom error message' to be 'some string' // Object.is equality

[Killed] ConditionalExpression
helpers/promise/truthyPromiseOrThrow.ts:15:9
  */
 export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {
   return (data: T) => {
-    if (data) {
+    if (false) {
       return data;
     }
killedBy: isSpecialObject — contract undefined → false
statusReason: Property failed after 1 tests
{ seed: -449168022, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] CallExpression
helpers/promise/truthyPromiseOrThrow.ts:18:5
     if (data) {
       return data;
     }
-    throw new Error(error); // eslint-disable-line functional/no-throw-statement
+    ; // eslint-disable-line functional/no-throw-statement
   };
 }
killedBy: mapAsync — contract empty array resolves to []
statusReason: expected undefined to be 'My custom error message' // Object.is equality
