[Survived] BlockStatement
helpers/set/map.ts:18:77
  * // => Set(3) { 10, 20, 30 }
  * @since 3.0.3
  */
-export function map<T, R>(set: ReadonlySet<T>, fn: (value: T) => R): Set<R> {
-  const result = new Set<R>();
-  for (const value of set) {
-    result.add(fn(value));
-  }
-  return result;
-}
+export function map<T, R>(set: ReadonlySet<T>, fn: (value: T) => R): Set<R> {}
 

[Survived] BlockStatement
helpers/set/map.ts:20:28
  */
 export function map<T, R>(set: ReadonlySet<T>, fn: (value: T) => R): Set<R> {
   const result = new Set<R>();
-  for (const value of set) {
-    result.add(fn(value));
-  }
+  for (const value of set) {}
   return result;
 }

[Survived] CallExpression
helpers/set/map.ts:21:5
 export function map<T, R>(set: ReadonlySet<T>, fn: (value: T) => R): Set<R> {
   const result = new Set<R>();
   for (const value of set) {
-    result.add(fn(value));
+    ;
   }
   return result;
