[Survived] BlockStatement
helpers/string/excerpt.ts:39:82
  * // => 'This description has no…'
  * @since 3.1.2
  */
-export function excerpt(text: string, maxLength: number, ellipsis = '…'): string {
-  const collapsed = text.trim().replace(/\s+/g, ' ');
-  if (collapsed.length <= maxLength) return collapsed;
-
-  const window = collapsed.slice(0, maxLength);
-  const sentenceEnd = window.search(/[.!?](?=\s|$)/);
-  if (sentenceEnd !== -1) {
-    return collapsed.slice(0, sentenceEnd + 1);
-  }
-
-  // No sentence boundary within range — cut at the last whole word instead, reserving room for
-  // the ellipsis so the result never exceeds maxLength.
-  const budget = Math.max(0, maxLength - ellipsis.length);
-  const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
-  if (lastSpace > 0) {
-    return `${collapsed.slice(0, lastSpace).trimEnd()}${ellipsis}`;
-  }
-
-  // No word boundary at all within budget (one giant unbroken run of characters) — delegate to
-  // truncate() for grapheme-cluster-safe cutting instead of naively slicing mid-character.
-  return truncate(collapsed, maxLength, ellipsis);
-}
+export function excerpt(text: string, maxLength: number, ellipsis = '…'): string {}
 

[Survived] MethodExpression
helpers/string/excerpt.ts:40:21
  * @since 3.1.2
  */
 export function excerpt(text: string, maxLength: number, ellipsis = '…'): string {
-  const collapsed = text.trim().replace(/\s+/g, ' ');
+  const collapsed = text.replace(/\s+/g, ' ');
   if (collapsed.length <= maxLength) return collapsed;
 

[Survived] Regex
helpers/string/excerpt.ts:40:41
  * @since 3.1.2
  */
 export function excerpt(text: string, maxLength: number, ellipsis = '…'): string {
-  const collapsed = text.trim().replace(/\s+/g, ' ');
+  const collapsed = text.trim().replace(/\s/g, ' ');
   if (collapsed.length <= maxLength) return collapsed;
 

[Survived] EqualityOperator
helpers/string/excerpt.ts:41:7
  */
 export function excerpt(text: string, maxLength: number, ellipsis = '…'): string {
   const collapsed = text.trim().replace(/\s+/g, ' ');
-  if (collapsed.length <= maxLength) return collapsed;
+  if (collapsed.length > maxLength) return collapsed;
 
   const window = collapsed.slice(0, maxLength);

[Survived] ConditionalExpression
helpers/string/excerpt.ts:41:7
  */
 export function excerpt(text: string, maxLength: number, ellipsis = '…'): string {
   const collapsed = text.trim().replace(/\s+/g, ' ');
-  if (collapsed.length <= maxLength) return collapsed;
+  if (false) return collapsed;
 
   const window = collapsed.slice(0, maxLength);

[Survived] MethodExpression
helpers/string/excerpt.ts:43:18
   const collapsed = text.trim().replace(/\s+/g, ' ');
   if (collapsed.length <= maxLength) return collapsed;
 
-  const window = collapsed.slice(0, maxLength);
+  const window = collapsed;
   const sentenceEnd = window.search(/[.!?](?=\s|$)/);
   if (sentenceEnd !== -1) {

[Survived] ConditionalExpression
helpers/string/excerpt.ts:45:7
 
   const window = collapsed.slice(0, maxLength);
   const sentenceEnd = window.search(/[.!?](?=\s|$)/);
-  if (sentenceEnd !== -1) {
+  if (false) {
     return collapsed.slice(0, sentenceEnd + 1);
   }

[Survived] BlockStatement
helpers/string/excerpt.ts:45:27
 
   const window = collapsed.slice(0, maxLength);
   const sentenceEnd = window.search(/[.!?](?=\s|$)/);
-  if (sentenceEnd !== -1) {
-    return collapsed.slice(0, sentenceEnd + 1);
-  }
+  if (sentenceEnd !== -1) {}
 
   // No sentence boundary within range — cut at the last whole word instead, reserving room for

[Survived] ArithmeticOperator
helpers/string/excerpt.ts:46:31
   const window = collapsed.slice(0, maxLength);
   const sentenceEnd = window.search(/[.!?](?=\s|$)/);
   if (sentenceEnd !== -1) {
-    return collapsed.slice(0, sentenceEnd + 1);
+    return collapsed.slice(0, sentenceEnd - 1);
   }
 

[Survived] MethodExpression
helpers/string/excerpt.ts:46:12
   const window = collapsed.slice(0, maxLength);
   const sentenceEnd = window.search(/[.!?](?=\s|$)/);
   if (sentenceEnd !== -1) {
-    return collapsed.slice(0, sentenceEnd + 1);
+    return collapsed;
   }
 

[Survived] ArithmeticOperator
helpers/string/excerpt.ts:51:30
 
   // No sentence boundary within range — cut at the last whole word instead, reserving room for
   // the ellipsis so the result never exceeds maxLength.
-  const budget = Math.max(0, maxLength - ellipsis.length);
+  const budget = Math.max(0, maxLength + ellipsis.length);
   const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
   if (lastSpace > 0) {

[Survived] MethodExpression
helpers/string/excerpt.ts:51:18
 
   // No sentence boundary within range — cut at the last whole word instead, reserving room for
   // the ellipsis so the result never exceeds maxLength.
-  const budget = Math.max(0, maxLength - ellipsis.length);
+  const budget = Math.min(0, maxLength - ellipsis.length);
   const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
   if (lastSpace > 0) {

[Survived] ArithmeticOperator
helpers/string/excerpt.ts:52:40
   // No sentence boundary within range — cut at the last whole word instead, reserving room for
   // the ellipsis so the result never exceeds maxLength.
   const budget = Math.max(0, maxLength - ellipsis.length);
-  const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
+  const lastSpace = collapsed.slice(0, budget - 1).lastIndexOf(' ');
   if (lastSpace > 0) {
     return `${collapsed.slice(0, lastSpace).trimEnd()}${ellipsis}`;

[Survived] MethodExpression
helpers/string/excerpt.ts:52:21
   // No sentence boundary within range — cut at the last whole word instead, reserving room for
   // the ellipsis so the result never exceeds maxLength.
   const budget = Math.max(0, maxLength - ellipsis.length);
-  const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
+  const lastSpace = collapsed.lastIndexOf(' ');
   if (lastSpace > 0) {
     return `${collapsed.slice(0, lastSpace).trimEnd()}${ellipsis}`;

[Survived] EqualityOperator
helpers/string/excerpt.ts:53:7
   // the ellipsis so the result never exceeds maxLength.
   const budget = Math.max(0, maxLength - ellipsis.length);
   const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
-  if (lastSpace > 0) {
+  if (lastSpace <= 0) {
     return `${collapsed.slice(0, lastSpace).trimEnd()}${ellipsis}`;
   }

[Survived] ConditionalExpression
helpers/string/excerpt.ts:53:7
   // the ellipsis so the result never exceeds maxLength.
   const budget = Math.max(0, maxLength - ellipsis.length);
   const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
-  if (lastSpace > 0) {
+  if (true) {
     return `${collapsed.slice(0, lastSpace).trimEnd()}${ellipsis}`;
   }

[Survived] MethodExpression
helpers/string/excerpt.ts:54:15
   const budget = Math.max(0, maxLength - ellipsis.length);
   const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
   if (lastSpace > 0) {
-    return `${collapsed.slice(0, lastSpace).trimEnd()}${ellipsis}`;
+    return `${collapsed.slice(0, lastSpace).trimStart()}${ellipsis}`;
   }
 

[Survived] MethodExpression
helpers/string/excerpt.ts:54:15
   const budget = Math.max(0, maxLength - ellipsis.length);
   const lastSpace = collapsed.slice(0, budget + 1).lastIndexOf(' ');
   if (lastSpace > 0) {
-    return `${collapsed.slice(0, lastSpace).trimEnd()}${ellipsis}`;
+    return `${collapsed.trimEnd()}${ellipsis}`;
   }
 
