[Survived] CallExpression
helpers/string/injectWordBreaks.ts:98:5
     if (match.index > lastIndex) {
       result.push(text.slice(lastIndex, match.index));
     }
-    result.push(match[0]);
+    ;
     lastIndex = match.index + match[0].length;
   }

[Survived] CallExpression
helpers/string/injectWordBreaks.ts:170:9
           text: result[prev].text + g.text,
           kind: result[prev].kind,
         };
-        result.splice(i, 1);
+        ;
         continue; // re-check same position
       }

[Survived] CallExpression
helpers/string/injectWordBreaks.ts:279:7
   const afterP1: Group[] = [];
   for (const g of d0Groups) {
     if (g.kind !== 'regular') {
-      afterP1.push(g);
+      ;
     } else {
       const atomics = splitGroups(g.text, ATOMIC_REGEX, 'atomic', 'regular');

[Survived] CallExpression
helpers/string/injectWordBreaks.ts:283:9
     } else {
       const atomics = splitGroups(g.text, ATOMIC_REGEX, 'atomic', 'regular');
       for (const a of atomics) {
-        afterP1.push(a);
+        ;
       }
     }

[Survived] CallExpression
helpers/string/injectWordBreaks.ts:292:7
   const afterP234: Group[] = [];
   for (const g of afterP1) {
     if (g.kind !== 'regular') {
-      afterP234.push(g);
+      ;
       continue;
     }

[Survived] CallExpression
helpers/string/injectWordBreaks.ts:325:5
   // string reallocation when building the output.
   const parts: string[] = [];
   for (let i = 0; i < finalGroups.length; i++) {
-    parts.push(finalGroups[i].text);
+    ;
     if (i < finalGroups.length - 1) {
       const curr = finalGroups[i];

[Survived] CallExpression
helpers/string/injectWordBreaks.ts:335:9
         curr.kind !== 'd0' &&
         next.kind !== 'd0'
       ) {
-        parts.push(ZWS);
+        ;
       }
     }
