[Survived] BlockStatement
helpers/string/isNotBlank.ts:28:71
  * isNotBlank(undefined) // => false
  * @since 2.0.3
  */
-export function isNotBlank(value: string | null | undefined): boolean {
-  return value != null && value.trim() !== '';
-}
+export function isNotBlank(value: string | null | undefined): boolean {}
 

[Survived] EqualityOperator
helpers/string/isNotBlank.ts:29:27
  * @since 2.0.3
  */
 export function isNotBlank(value: string | null | undefined): boolean {
-  return value != null && value.trim() !== '';
+  return value != null && value.trim() === '';
 }
 

[Survived] LogicalOperator
helpers/string/isNotBlank.ts:29:10
  * @since 2.0.3
  */
 export function isNotBlank(value: string | null | undefined): boolean {
-  return value != null && value.trim() !== '';
+  return value != null || value.trim() !== '';
 }
 
