[Survived] BlockStatement
helpers/string/levenshteinSimilarity.ts:25:91
  * // => 1
  * @since 3.1.1
  */
-export function levenshteinSimilarity(a: string, b: string, caseSensitive = true): number {
-  // Fold case first, then measure — case-folding a Turkish dotted capital I ('İ', U+0130) via
-  // the default (non-Turkish) locale mapping expands it to two code units ('i' + combining dot
-  // above), so computing maxLength from the raw a/b would be measuring a different string than
-  // the one levenshteinDistance actually compares, letting distance/maxLength exceed 1.
-  const s = caseSensitive ? a : a.toLowerCase();
-  const t = caseSensitive ? b : b.toLowerCase();
-  const maxLength = Math.max(s.length, t.length);
-  if (maxLength === 0) return 1;
-  return 1 - levenshteinDistance(s, t) / maxLength;
-}
+export function levenshteinSimilarity(a: string, b: string, caseSensitive = true): number {}
 

[Survived] BooleanLiteral
helpers/string/levenshteinSimilarity.ts:25:77
  * // => 1
  * @since 3.1.1
  */
-export function levenshteinSimilarity(a: string, b: string, caseSensitive = true): number {
+export function levenshteinSimilarity(a: string, b: string, caseSensitive = false): number {
   // Fold case first, then measure — case-folding a Turkish dotted capital I ('İ', U+0130) via
   // the default (non-Turkish) locale mapping expands it to two code units ('i' + combining dot

[Survived] MethodExpression
helpers/string/levenshteinSimilarity.ts:30:33
   // the default (non-Turkish) locale mapping expands it to two code units ('i' + combining dot
   // above), so computing maxLength from the raw a/b would be measuring a different string than
   // the one levenshteinDistance actually compares, letting distance/maxLength exceed 1.
-  const s = caseSensitive ? a : a.toLowerCase();
+  const s = caseSensitive ? a : a.toUpperCase();
   const t = caseSensitive ? b : b.toLowerCase();
   const maxLength = Math.max(s.length, t.length);

[Survived] MethodExpression
helpers/string/levenshteinSimilarity.ts:32:21
   // the one levenshteinDistance actually compares, letting distance/maxLength exceed 1.
   const s = caseSensitive ? a : a.toLowerCase();
   const t = caseSensitive ? b : b.toLowerCase();
-  const maxLength = Math.max(s.length, t.length);
+  const maxLength = Math.min(s.length, t.length);
   if (maxLength === 0) return 1;
   return 1 - levenshteinDistance(s, t) / maxLength;

[Survived] ConditionalExpression
helpers/string/levenshteinSimilarity.ts:33:7
   const s = caseSensitive ? a : a.toLowerCase();
   const t = caseSensitive ? b : b.toLowerCase();
   const maxLength = Math.max(s.length, t.length);
-  if (maxLength === 0) return 1;
+  if (false) return 1;
   return 1 - levenshteinDistance(s, t) / maxLength;
 }

[Survived] ConditionalExpression
helpers/string/levenshteinSimilarity.ts:33:7
   const s = caseSensitive ? a : a.toLowerCase();
   const t = caseSensitive ? b : b.toLowerCase();
   const maxLength = Math.max(s.length, t.length);
-  if (maxLength === 0) return 1;
+  if (true) return 1;
   return 1 - levenshteinDistance(s, t) / maxLength;
 }

[Survived] ArithmeticOperator
helpers/string/levenshteinSimilarity.ts:34:14
   const t = caseSensitive ? b : b.toLowerCase();
   const maxLength = Math.max(s.length, t.length);
   if (maxLength === 0) return 1;
-  return 1 - levenshteinDistance(s, t) / maxLength;
+  return 1 - levenshteinDistance(s, t) * maxLength;
 }
 

[Survived] ArithmeticOperator
helpers/string/levenshteinSimilarity.ts:34:10
   const t = caseSensitive ? b : b.toLowerCase();
   const maxLength = Math.max(s.length, t.length);
   if (maxLength === 0) return 1;
-  return 1 - levenshteinDistance(s, t) / maxLength;
+  return 1 + levenshteinDistance(s, t) / maxLength;
 }
 
