[Survived] BlockStatement
helpers/string/trimEnd.ts:46:30
 export function trimEnd(
   input: string | null | undefined,
   mode: TrimMode = 'whitespace',
-): string | null | undefined {
-  if (input == null) return input;
-  if (mode === 'whitespace') return input.trimEnd();
-  assertValidTrimMode(mode, 'trimEnd');
-  return input.replace(TRIM_END_REGEX[mode], '');
-}
+): string | null | undefined {}
 

[Survived] EqualityOperator
helpers/string/trimEnd.ts:48:7
   mode: TrimMode = 'whitespace',
 ): string | null | undefined {
   if (input == null) return input;
-  if (mode === 'whitespace') return input.trimEnd();
+  if (mode !== 'whitespace') return input.trimEnd();
   assertValidTrimMode(mode, 'trimEnd');
   return input.replace(TRIM_END_REGEX[mode], '');

[Survived] ConditionalExpression
helpers/string/trimEnd.ts:48:7
   mode: TrimMode = 'whitespace',
 ): string | null | undefined {
   if (input == null) return input;
-  if (mode === 'whitespace') return input.trimEnd();
+  if (true) return input.trimEnd();
   assertValidTrimMode(mode, 'trimEnd');
   return input.replace(TRIM_END_REGEX[mode], '');
