[Survived] BlockStatement
helpers/string/unorderedPairKey.ts:24:81
  * // => true
  * @since 3.1.1
  */
-export function unorderedPairKey(a: string, b: string, separator = '|'): string {
-  return a < b ? `${a}${separator}${b}` : `${b}${separator}${a}`;
-}
+export function unorderedPairKey(a: string, b: string, separator = '|'): string {}
 

[Survived] ConditionalExpression
helpers/string/unorderedPairKey.ts:25:10
  * @since 3.1.1
  */
 export function unorderedPairKey(a: string, b: string, separator = '|'): string {
-  return a < b ? `${a}${separator}${b}` : `${b}${separator}${a}`;
+  return false ? `${a}${separator}${b}` : `${b}${separator}${a}`;
 }
 

[Survived] EqualityOperator
helpers/string/unorderedPairKey.ts:25:10
  * @since 3.1.1
  */
 export function unorderedPairKey(a: string, b: string, separator = '|'): string {
-  return a < b ? `${a}${separator}${b}` : `${b}${separator}${a}`;
+  return a >= b ? `${a}${separator}${b}` : `${b}${separator}${a}`;
 }
 
