[Survived] BlockStatement
helpers/version/_semver.ts:16:67
 import type { IncrementType, ParsedSemVerVersion } from './types';
 
 /** @ignore */
-export function parseSemVer(version: string): ParsedSemVerVersion {
-  // Remove optional 'v' prefix
-  const normalized = version.replace(/^v/, '');
-
-  // Split build metadata first (everything after +)
-  const [versionWithPrerelease, buildString] = normalized.split('+');
-  const build = buildString ? buildString.split('.') : [];
-
-  // Split prerelease (everything after -)
-  const [coreVersion, prereleaseString] = versionWithPrerelease.split('-');
-  const prerelease = prereleaseString ? prereleaseString.split('.') : [];
-
-  // Parse core version
-  const parts = coreVersion.split('.').map(Number);
-
-  return {
-    scheme: 'semver',
-    major: parts[0] || 0,
-    minor: parts[1] || 0,
-    patch: parts[2] || 0,
-    prerelease,
-    build,
-  };
-}
+export function parseSemVer(version: string): ParsedSemVerVersion {}
 
 /**

[Survived] StringLiteral
helpers/version/_semver.ts:21:65
   const normalized = version.replace(/^v/, '');
 
   // Split build metadata first (everything after +)
-  const [versionWithPrerelease, buildString] = normalized.split('+');
+  const [versionWithPrerelease, buildString] = normalized.split("");
   const build = buildString ? buildString.split('.') : [];
 

[Survived] ArrayDeclaration
helpers/version/_semver.ts:22:56
 
   // Split build metadata first (everything after +)
   const [versionWithPrerelease, buildString] = normalized.split('+');
-  const build = buildString ? buildString.split('.') : [];
+  const build = buildString ? buildString.split('.') : ["Stryker was here"];
 
   // Split prerelease (everything after -)

[Survived] StringLiteral
helpers/version/_semver.ts:22:49
 
   // Split build metadata first (everything after +)
   const [versionWithPrerelease, buildString] = normalized.split('+');
-  const build = buildString ? buildString.split('.') : [];
+  const build = buildString ? buildString.split("") : [];
 
   // Split prerelease (everything after -)

[Survived] ConditionalExpression
helpers/version/_semver.ts:33:12
 
   return {
     scheme: 'semver',
-    major: parts[0] || 0,
+    major: true,
     minor: parts[1] || 0,
     patch: parts[2] || 0,

[Survived] ConditionalExpression
helpers/version/_semver.ts:33:12
 
   return {
     scheme: 'semver',
-    major: parts[0] || 0,
+    major: false,
     minor: parts[1] || 0,
     patch: parts[2] || 0,

[Survived] LogicalOperator
helpers/version/_semver.ts:34:12
   return {
     scheme: 'semver',
     major: parts[0] || 0,
-    minor: parts[1] || 0,
+    minor: parts[1] && 0,
     patch: parts[2] || 0,
     prerelease,

[Survived] ConditionalExpression
helpers/version/_semver.ts:35:12
     scheme: 'semver',
     major: parts[0] || 0,
     minor: parts[1] || 0,
-    patch: parts[2] || 0,
+    patch: true,
     prerelease,
     build,

[Survived] EqualityOperator
helpers/version/_semver.ts:53:7
 function comparePrerelease(pre1: string[], pre2: string[]): number {
   // No prerelease has higher precedence than prerelease
   // e.g., 1.0.0 > 1.0.0-alpha
-  if (pre1.length === 0 && pre2.length === 0) return 0;
+  if (pre1.length !== 0 && pre2.length === 0) return 0;
   if (pre1.length === 0) return 1; // No prerelease > prerelease
   if (pre2.length === 0) return -1; // prerelease < no prerelease

[Survived] EqualityOperator
helpers/version/_semver.ts:54:7
   // No prerelease has higher precedence than prerelease
   // e.g., 1.0.0 > 1.0.0-alpha
   if (pre1.length === 0 && pre2.length === 0) return 0;
-  if (pre1.length === 0) return 1; // No prerelease > prerelease
+  if (pre1.length !== 0) return 1; // No prerelease > prerelease
   if (pre2.length === 0) return -1; // prerelease < no prerelease
 

[Survived] ConditionalExpression
helpers/version/_semver.ts:55:7
   // e.g., 1.0.0 > 1.0.0-alpha
   if (pre1.length === 0 && pre2.length === 0) return 0;
   if (pre1.length === 0) return 1; // No prerelease > prerelease
-  if (pre2.length === 0) return -1; // prerelease < no prerelease
+  if (true) return -1; // prerelease < no prerelease
 
   const maxLength = Math.max(pre1.length, pre2.length);

[Survived] UpdateOperator
helpers/version/_semver.ts:59:34
 
   const maxLength = Math.max(pre1.length, pre2.length);
 
-  for (let i = 0; i < maxLength; i++) {
+  for (let i = 0; i < maxLength; i--) {
     // A larger set has higher precedence if all preceding are equal
     if (i >= pre1.length) return -1;

[Survived] EqualityOperator
helpers/version/_semver.ts:61:9
 
   for (let i = 0; i < maxLength; i++) {
     // A larger set has higher precedence if all preceding are equal
-    if (i >= pre1.length) return -1;
+    if (i < pre1.length) return -1;
     if (i >= pre2.length) return 1;
 

[Survived] ConditionalExpression
helpers/version/_semver.ts:62:9
   for (let i = 0; i < maxLength; i++) {
     // A larger set has higher precedence if all preceding are equal
     if (i >= pre1.length) return -1;
-    if (i >= pre2.length) return 1;
+    if (true) return 1;
 
     const id1 = pre1[i];

[Survived] Regex
helpers/version/_semver.ts:68:20
     const id2 = pre2[i];
 
     const isNum1 = /^\d+$/.test(id1);
-    const isNum2 = /^\d+$/.test(id2);
+    const isNum2 = /^\D+$/.test(id2);
 
     // Both numeric: compare as integers

[Survived] UnaryOperator
helpers/version/_semver.ts:74:31
     if (isNum1 && isNum2) {
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
-      if (num1 < num2) return -1;
+      if (num1 < num2) return +1;
       if (num1 > num2) return 1;
       // num1 === num2, continue to next identifier

[Survived] ConditionalExpression
helpers/version/_semver.ts:75:11
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
       if (num1 < num2) return -1;
-      if (num1 > num2) return 1;
+      if (true) return 1;
       // num1 === num2, continue to next identifier
     }

[Survived] EqualityOperator
helpers/version/_semver.ts:75:11
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
       if (num1 < num2) return -1;
-      if (num1 > num2) return 1;
+      if (num1 >= num2) return 1;
       // num1 === num2, continue to next identifier
     }

[Survived] ConditionalExpression
helpers/version/_semver.ts:81:16
     // Numeric has lower precedence than alphanumeric
     else if (isNum1) {
       return -1;
-    } else if (isNum2) {
+    } else if (false) {
       return 1;
     }

[Survived] ConditionalExpression
helpers/version/_semver.ts:86:11
     }
     // Both alphanumeric: compare lexically (ASCII sort)
     else {
-      if (id1 < id2) return -1;
+      if (true) return -1;
       if (id1 > id2) return 1;
       // id1 === id2, continue to next identifier

[Survived] ConditionalExpression
helpers/version/_semver.ts:87:11
     // Both alphanumeric: compare lexically (ASCII sort)
     else {
       if (id1 < id2) return -1;
-      if (id1 > id2) return 1;
+      if (false) return 1;
       // id1 === id2, continue to next identifier
     }

[Killed] ArrowFunction
helpers/version/_semver.ts:98:53
 // The four precedence steps, in order, composed via combineSortFns (array/) instead of a
 // hand-rolled "if not equal, return" chain — matches the same pattern _gentoo.ts's
 // compareGentoo uses. Build metadata is ignored per SemVer spec, so it isn't a step here.
-const compareByMajor: SortFn<ParsedSemVerVersion> = (a, b) => (a.major === b.major ? 0 : a.major < b.major ? -1 : 1);
+const compareByMajor: SortFn<ParsedSemVerVersion> = () => undefined;
 const compareByMinor: SortFn<ParsedSemVerVersion> = (a, b) => (a.minor === b.minor ? 0 : a.minor < b.minor ? -1 : 1);
 const compareByPatch: SortFn<ParsedSemVerVersion> = (a, b) => (a.patch === b.patch ? 0 : a.patch < b.patch ? -1 : 1);
killedBy: ensureDate — contract undefined → null
statusReason: Property failed after 1 tests
{ seed: 2128311357, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
helpers/version/_semver.ts:98:90
 // The four precedence steps, in order, composed via combineSortFns (array/) instead of a
 // hand-rolled "if not equal, return" chain — matches the same pattern _gentoo.ts's
 // compareGentoo uses. Build metadata is ignored per SemVer spec, so it isn't a step here.
-const compareByMajor: SortFn<ParsedSemVerVersion> = (a, b) => (a.major === b.major ? 0 : a.major < b.major ? -1 : 1);
+const compareByMajor: SortFn<ParsedSemVerVersion> = (a, b) => (a.major === b.major ? 0 : true ? -1 : 1);
 const compareByMinor: SortFn<ParsedSemVerVersion> = (a, b) => (a.minor === b.minor ? 0 : a.minor < b.minor ? -1 : 1);
 const compareByPatch: SortFn<ParsedSemVerVersion> = (a, b) => (a.patch === b.patch ? 0 : a.patch < b.patch ? -1 : 1);

[Killed] ArrowFunction
helpers/version/_semver.ts:99:53
 // hand-rolled "if not equal, return" chain — matches the same pattern _gentoo.ts's
 // compareGentoo uses. Build metadata is ignored per SemVer spec, so it isn't a step here.
 const compareByMajor: SortFn<ParsedSemVerVersion> = (a, b) => (a.major === b.major ? 0 : a.major < b.major ? -1 : 1);
-const compareByMinor: SortFn<ParsedSemVerVersion> = (a, b) => (a.minor === b.minor ? 0 : a.minor < b.minor ? -1 : 1);
+const compareByMinor: SortFn<ParsedSemVerVersion> = () => undefined;
 const compareByPatch: SortFn<ParsedSemVerVersion> = (a, b) => (a.patch === b.patch ? 0 : a.patch < b.patch ? -1 : 1);
 const compareByPrerelease: SortFn<ParsedSemVerVersion> = (a, b) => comparePrerelease(a.prerelease, b.prerelease);
killedBy: compare core version comparison should return 0 for equal versions
statusReason: expected undefined to be +0 // Object.is equality

[Survived] ConditionalExpression
helpers/version/_semver.ts:99:64
 // hand-rolled "if not equal, return" chain — matches the same pattern _gentoo.ts's
 // compareGentoo uses. Build metadata is ignored per SemVer spec, so it isn't a step here.
 const compareByMajor: SortFn<ParsedSemVerVersion> = (a, b) => (a.major === b.major ? 0 : a.major < b.major ? -1 : 1);
-const compareByMinor: SortFn<ParsedSemVerVersion> = (a, b) => (a.minor === b.minor ? 0 : a.minor < b.minor ? -1 : 1);
+const compareByMinor: SortFn<ParsedSemVerVersion> = (a, b) => (false ? 0 : a.minor < b.minor ? -1 : 1);
 const compareByPatch: SortFn<ParsedSemVerVersion> = (a, b) => (a.patch === b.patch ? 0 : a.patch < b.patch ? -1 : 1);
 const compareByPrerelease: SortFn<ParsedSemVerVersion> = (a, b) => comparePrerelease(a.prerelease, b.prerelease);

[Killed] ArrowFunction
helpers/version/_semver.ts:100:53
 // compareGentoo uses. Build metadata is ignored per SemVer spec, so it isn't a step here.
 const compareByMajor: SortFn<ParsedSemVerVersion> = (a, b) => (a.major === b.major ? 0 : a.major < b.major ? -1 : 1);
 const compareByMinor: SortFn<ParsedSemVerVersion> = (a, b) => (a.minor === b.minor ? 0 : a.minor < b.minor ? -1 : 1);
-const compareByPatch: SortFn<ParsedSemVerVersion> = (a, b) => (a.patch === b.patch ? 0 : a.patch < b.patch ? -1 : 1);
+const compareByPatch: SortFn<ParsedSemVerVersion> = () => undefined;
 const compareByPrerelease: SortFn<ParsedSemVerVersion> = (a, b) => comparePrerelease(a.prerelease, b.prerelease);
 
killedBy: compare core version comparison should return 0 for equal versions
statusReason: expected undefined to be +0 // Object.is equality

[Survived] EqualityOperator
helpers/version/_semver.ts:100:90
 // compareGentoo uses. Build metadata is ignored per SemVer spec, so it isn't a step here.
 const compareByMajor: SortFn<ParsedSemVerVersion> = (a, b) => (a.major === b.major ? 0 : a.major < b.major ? -1 : 1);
 const compareByMinor: SortFn<ParsedSemVerVersion> = (a, b) => (a.minor === b.minor ? 0 : a.minor < b.minor ? -1 : 1);
-const compareByPatch: SortFn<ParsedSemVerVersion> = (a, b) => (a.patch === b.patch ? 0 : a.patch < b.patch ? -1 : 1);
+const compareByPatch: SortFn<ParsedSemVerVersion> = (a, b) => (a.patch === b.patch ? 0 : a.patch >= b.patch ? -1 : 1);
 const compareByPrerelease: SortFn<ParsedSemVerVersion> = (a, b) => comparePrerelease(a.prerelease, b.prerelease);
 

[Killed] ArrowFunction
helpers/version/_semver.ts:101:58
 const compareByMajor: SortFn<ParsedSemVerVersion> = (a, b) => (a.major === b.major ? 0 : a.major < b.major ? -1 : 1);
 const compareByMinor: SortFn<ParsedSemVerVersion> = (a, b) => (a.minor === b.minor ? 0 : a.minor < b.minor ? -1 : 1);
 const compareByPatch: SortFn<ParsedSemVerVersion> = (a, b) => (a.patch === b.patch ? 0 : a.patch < b.patch ? -1 : 1);
-const compareByPrerelease: SortFn<ParsedSemVerVersion> = (a, b) => comparePrerelease(a.prerelease, b.prerelease);
+const compareByPrerelease: SortFn<ParsedSemVerVersion> = () => undefined;
 
 /** @ignore */
killedBy: compare core version comparison should return 0 for equal versions
statusReason: expected undefined to be +0 // Object.is equality

[Survived] BlockStatement
helpers/version/_semver.ts:107:75
 const compareParsedSemVer = combineSortFns<ParsedSemVerVersion>(compareByMajor, compareByMinor, compareByPatch, compareByPrerelease);
 
 /** @ignore */
-export function compareSemVer(version1: string, version2: string): number {
-  return compareParsedSemVer(parseSemVer(version1), parseSemVer(version2));
-}
+export function compareSemVer(version1: string, version2: string): number {}
 
 /** @ignore */

[Survived] BlockStatement
helpers/version/_semver.ts:112:70
 }
 
 /** @ignore */
-export function stringifySemVer(parsed: ParsedSemVerVersion): string {
-  const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
-  const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
-  const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';
-  return `${base}${prerelease}${build}`;
-}
+export function stringifySemVer(parsed: ParsedSemVerVersion): string {}
 
 /** @ignore */

[Survived] StringLiteral
helpers/version/_semver.ts:113:16
 
 /** @ignore */
 export function stringifySemVer(parsed: ParsedSemVerVersion): string {
-  const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
+  const base = ``;
   const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
   const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';

[Survived] EqualityOperator
helpers/version/_semver.ts:115:17
 export function stringifySemVer(parsed: ParsedSemVerVersion): string {
   const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
   const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
-  const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';
+  const build = parsed.build.length >= 0 ? `+${parsed.build.join('.')}` : '';
   return `${base}${prerelease}${build}`;
 }

[Survived] BlockStatement
helpers/version/_semver.ts:120:79
 }
 
 /** @ignore */
-export function incrementSemVer(version: string, type: IncrementType): string {
-  const hasV = version.startsWith('v');
-  let { major, minor, patch } = parseSemVer(version);
-
-  switch (type) {
-    case 'major':
-      major++;
-      minor = 0;
-      patch = 0;
-      break;
-    case 'minor':
-      minor++;
-      patch = 0;
-      break;
-    case 'patch':
-      patch++;
-      break;
-    default:
-      throw new Error(`Invalid increment type: ${type}`);
-  }
-
-  const result = stringifySemVer({ scheme: 'semver', major, minor, patch, prerelease: [], build: [] });
-  return hasV ? `v${result}` : result;
-}
+export function incrementSemVer(version: string, type: IncrementType): string {}
 
 /**

[Survived] MethodExpression
helpers/version/_semver.ts:121:16
 
 /** @ignore */
 export function incrementSemVer(version: string, type: IncrementType): string {
-  const hasV = version.startsWith('v');
+  const hasV = version.endsWith('v');
   let { major, minor, patch } = parseSemVer(version);
 

[Survived] StringLiteral
helpers/version/_semver.ts:121:35
 
 /** @ignore */
 export function incrementSemVer(version: string, type: IncrementType): string {
-  const hasV = version.startsWith('v');
+  const hasV = version.startsWith("");
   let { major, minor, patch } = parseSemVer(version);
 

[Survived] StringLiteral
helpers/version/_semver.ts:134:10
       minor++;
       patch = 0;
       break;
-    case 'patch':
+    case "":
       patch++;
       break;

[Survived] BlockStatement
helpers/version/_semver.ts:152:90
  * the specific build that produced the input version, not the new one.
  * @ignore
  */
-export function incrementPrereleaseSemVer(version: string, prereleaseId: string): string {
-  const hasV = version.startsWith('v');
-  const parsed = parseSemVer(version);
-  const [currentId, currentNum] = parsed.prerelease;
-
-  const shouldIncrement = currentId === prereleaseId && typeof currentNum === 'string' && currentNum !== '' && Number.isFinite(Number(currentNum));
-
-  const result =
-    parsed.prerelease.length === 0
-      ? stringifySemVer({ ...parsed, patch: parsed.patch + 1, prerelease: [prereleaseId, '0'], build: [] })
-      : stringifySemVer({ ...parsed, prerelease: [prereleaseId, shouldIncrement ? String(Number(currentNum) + 1) : '0'], build: [] });
-
-  return hasV ? `v${result}` : result;
-}
+export function incrementPrereleaseSemVer(version: string, prereleaseId: string): string {}
 
 /**

[Survived] MethodExpression
helpers/version/_semver.ts:153:16
  * @ignore
  */
 export function incrementPrereleaseSemVer(version: string, prereleaseId: string): string {
-  const hasV = version.startsWith('v');
+  const hasV = version.endsWith('v');
   const parsed = parseSemVer(version);
   const [currentId, currentNum] = parsed.prerelease;

[Survived] ConditionalExpression
helpers/version/_semver.ts:157:27
   const parsed = parseSemVer(version);
   const [currentId, currentNum] = parsed.prerelease;
 
-  const shouldIncrement = currentId === prereleaseId && typeof currentNum === 'string' && currentNum !== '' && Number.isFinite(Number(currentNum));
+  const shouldIncrement = true;
 
   const result =

[Survived] ConditionalExpression
helpers/version/_semver.ts:157:27
   const parsed = parseSemVer(version);
   const [currentId, currentNum] = parsed.prerelease;
 
-  const shouldIncrement = currentId === prereleaseId && typeof currentNum === 'string' && currentNum !== '' && Number.isFinite(Number(currentNum));
+  const shouldIncrement = true && Number.isFinite(Number(currentNum));
 
   const result =

[Survived] ConditionalExpression
helpers/version/_semver.ts:160:5
   const shouldIncrement = currentId === prereleaseId && typeof currentNum === 'string' && currentNum !== '' && Number.isFinite(Number(currentNum));
 
   const result =
-    parsed.prerelease.length === 0
+    false
       ? stringifySemVer({ ...parsed, patch: parsed.patch + 1, prerelease: [prereleaseId, '0'], build: [] })
       : stringifySemVer({ ...parsed, prerelease: [prereleaseId, shouldIncrement ? String(Number(currentNum) + 1) : '0'], build: [] });

[Survived] ConditionalExpression
helpers/version/_semver.ts:160:5
   const shouldIncrement = currentId === prereleaseId && typeof currentNum === 'string' && currentNum !== '' && Number.isFinite(Number(currentNum));
 
   const result =
-    parsed.prerelease.length === 0
+    true
       ? stringifySemVer({ ...parsed, patch: parsed.patch + 1, prerelease: [prereleaseId, '0'], build: [] })
       : stringifySemVer({ ...parsed, prerelease: [prereleaseId, shouldIncrement ? String(Number(currentNum) + 1) : '0'], build: [] });

[Survived] ArithmeticOperator
helpers/version/_semver.ts:161:45
 
   const result =
     parsed.prerelease.length === 0
-      ? stringifySemVer({ ...parsed, patch: parsed.patch + 1, prerelease: [prereleaseId, '0'], build: [] })
+      ? stringifySemVer({ ...parsed, patch: parsed.patch - 1, prerelease: [prereleaseId, '0'], build: [] })
       : stringifySemVer({ ...parsed, prerelease: [prereleaseId, shouldIncrement ? String(Number(currentNum) + 1) : '0'], build: [] });
 

[Survived] StringLiteral
helpers/version/_semver.ts:161:90
 
   const result =
     parsed.prerelease.length === 0
-      ? stringifySemVer({ ...parsed, patch: parsed.patch + 1, prerelease: [prereleaseId, '0'], build: [] })
+      ? stringifySemVer({ ...parsed, patch: parsed.patch + 1, prerelease: [prereleaseId, ""], build: [] })
       : stringifySemVer({ ...parsed, prerelease: [prereleaseId, shouldIncrement ? String(Number(currentNum) + 1) : '0'], build: [] });
 

[Survived] ArithmeticOperator
helpers/version/_semver.ts:162:90
   const result =
     parsed.prerelease.length === 0
       ? stringifySemVer({ ...parsed, patch: parsed.patch + 1, prerelease: [prereleaseId, '0'], build: [] })
-      : stringifySemVer({ ...parsed, prerelease: [prereleaseId, shouldIncrement ? String(Number(currentNum) + 1) : '0'], build: [] });
+      : stringifySemVer({ ...parsed, prerelease: [prereleaseId, shouldIncrement ? String(Number(currentNum) - 1) : '0'], build: [] });
 
   return hasV ? `v${result}` : result;

[Survived] ObjectLiteral
helpers/version/_semver.ts:162:25
   const result =
     parsed.prerelease.length === 0
       ? stringifySemVer({ ...parsed, patch: parsed.patch + 1, prerelease: [prereleaseId, '0'], build: [] })
-      : stringifySemVer({ ...parsed, prerelease: [prereleaseId, shouldIncrement ? String(Number(currentNum) + 1) : '0'], build: [] });
+      : stringifySemVer({});
 
   return hasV ? `v${result}` : result;

[Survived] StringLiteral
helpers/version/_semver.ts:174:51
  * @ignore
  */
 export function satisfiesRangeSemVer(version: string, range: string): boolean {
-  const normalizedVersion = version.replace(/^v/, '');
+  const normalizedVersion = version.replace(/^v/, "Stryker was here!");
 
   if (!range.match(/[~^<>=]/)) {

[Survived] BooleanLiteral
helpers/version/_semver.ts:176:7
 export function satisfiesRangeSemVer(version: string, range: string): boolean {
   const normalizedVersion = version.replace(/^v/, '');
 
-  if (!range.match(/[~^<>=]/)) {
+  if (range.match(/[~^<>=]/)) {
     return normalizedVersion === range.replace(/^v/, '');
   }

[Survived] ConditionalExpression
helpers/version/_semver.ts:176:7
 export function satisfiesRangeSemVer(version: string, range: string): boolean {
   const normalizedVersion = version.replace(/^v/, '');
 
-  if (!range.match(/[~^<>=]/)) {
+  if (false) {
     return normalizedVersion === range.replace(/^v/, '');
   }

[Survived] ConditionalExpression
helpers/version/_semver.ts:177:12
   const normalizedVersion = version.replace(/^v/, '');
 
   if (!range.match(/[~^<>=]/)) {
-    return normalizedVersion === range.replace(/^v/, '');
+    return true;
   }
 

[Survived] ConditionalExpression
helpers/version/_semver.ts:180:7
     return normalizedVersion === range.replace(/^v/, '');
   }
 
-  if (range.startsWith('>=')) {
+  if (true) {
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) >= 0;
   }

[Survived] MethodExpression
helpers/version/_semver.ts:180:7
     return normalizedVersion === range.replace(/^v/, '');
   }
 
-  if (range.startsWith('>=')) {
+  if (range.endsWith('>=')) {
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) >= 0;
   }

[Survived] ConditionalExpression
helpers/version/_semver.ts:181:12
   }
 
   if (range.startsWith('>=')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) >= 0;
+    return false;
   }
   if (range.startsWith('>')) {

[Survived] EqualityOperator
helpers/version/_semver.ts:181:12
   }
 
   if (range.startsWith('>=')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) >= 0;
+    return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) < 0;
   }
   if (range.startsWith('>')) {

[Survived] ConditionalExpression
helpers/version/_semver.ts:183:7
   if (range.startsWith('>=')) {
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) >= 0;
   }
-  if (range.startsWith('>')) {
+  if (true) {
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) > 0;
   }

[Survived] MethodExpression
helpers/version/_semver.ts:183:7
   if (range.startsWith('>=')) {
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) >= 0;
   }
-  if (range.startsWith('>')) {
+  if (range.endsWith('>')) {
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) > 0;
   }

[Survived] EqualityOperator
helpers/version/_semver.ts:184:12
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) >= 0;
   }
   if (range.startsWith('>')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) > 0;
+    return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) >= 0;
   }
   if (range.startsWith('<=')) {

[Survived] ConditionalExpression
helpers/version/_semver.ts:184:12
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) >= 0;
   }
   if (range.startsWith('>')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) > 0;
+    return true;
   }
   if (range.startsWith('<=')) {

[Survived] BlockStatement
helpers/version/_semver.ts:186:31
   if (range.startsWith('>')) {
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) > 0;
   }
-  if (range.startsWith('<=')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) <= 0;
-  }
+  if (range.startsWith('<=')) {}
   if (range.startsWith('<')) {
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) < 0;

[Survived] ConditionalExpression
helpers/version/_semver.ts:186:7
   if (range.startsWith('>')) {
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) > 0;
   }
-  if (range.startsWith('<=')) {
+  if (false) {
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) <= 0;
   }

[Survived] ConditionalExpression
helpers/version/_semver.ts:187:12
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) > 0;
   }
   if (range.startsWith('<=')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) <= 0;
+    return false;
   }
   if (range.startsWith('<')) {

[Survived] ConditionalExpression
helpers/version/_semver.ts:187:12
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) > 0;
   }
   if (range.startsWith('<=')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) <= 0;
+    return true;
   }
   if (range.startsWith('<')) {

[Survived] ConditionalExpression
helpers/version/_semver.ts:189:7
   if (range.startsWith('<=')) {
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) <= 0;
   }
-  if (range.startsWith('<')) {
+  if (false) {
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) < 0;
   }

[Survived] MethodExpression
helpers/version/_semver.ts:189:7
   if (range.startsWith('<=')) {
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) <= 0;
   }
-  if (range.startsWith('<')) {
+  if (range.endsWith('<')) {
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) < 0;
   }

[Survived] EqualityOperator
helpers/version/_semver.ts:190:12
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) <= 0;
   }
   if (range.startsWith('<')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) < 0;
+    return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) >= 0;
   }
 

[Survived] ConditionalExpression
helpers/version/_semver.ts:190:12
     return compareVersionsSimple(normalizedVersion, range.slice(2).replace(/^v/, '')) <= 0;
   }
   if (range.startsWith('<')) {
-    return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) < 0;
+    return false;
   }
 

[Survived] ConditionalExpression
helpers/version/_semver.ts:193:7
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) < 0;
   }
 
-  if (range.startsWith('^')) {
+  if (false) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor] = targetVersion.split('.').map(Number);

[Survived] MethodExpression
helpers/version/_semver.ts:193:7
     return compareVersionsSimple(normalizedVersion, range.slice(1).replace(/^v/, '')) < 0;
   }
 
-  if (range.startsWith('^')) {
+  if (range.endsWith('^')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor] = targetVersion.split('.').map(Number);

[Survived] EqualityOperator
helpers/version/_semver.ts:197:44
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor] = targetVersion.split('.').map(Number);
     const [versionMajor] = normalizedVersion.split('.').map(Number);
-    return versionMajor === targetMajor && compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+    return versionMajor === targetMajor && compareVersionsSimple(normalizedVersion, targetVersion) > 0;
   }
 

[Survived] ConditionalExpression
helpers/version/_semver.ts:197:12
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor] = targetVersion.split('.').map(Number);
     const [versionMajor] = normalizedVersion.split('.').map(Number);
-    return versionMajor === targetMajor && compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+    return false;
   }
 
