[Survived] ConditionalExpression
helpers/version/_semver.ts:200:7
     return versionMajor === targetMajor && compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   }
 
-  if (range.startsWith('~')) {
+  if (false) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);

[Survived] ConditionalExpression
helpers/version/_semver.ts:200:7
     return versionMajor === targetMajor && compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   }
 
-  if (range.startsWith('~')) {
+  if (true) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);

[Survived] StringLiteral
helpers/version/_semver.ts:202:60
 
   if (range.startsWith('~')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
-    const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
+    const [targetMajor, targetMinor] = targetVersion.split("").map(Number);
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
     return versionMajor === targetMajor && versionMinor === targetMinor && compareVersionsSimple(normalizedVersion, targetVersion) >= 0;

[Survived] ConditionalExpression
helpers/version/_semver.ts:204:12
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
-    return versionMajor === targetMajor && versionMinor === targetMinor && compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+    return false;
   }
 

[Survived] EqualityOperator
helpers/version/_semver.ts:204:76
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
-    return versionMajor === targetMajor && versionMinor === targetMinor && compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+    return versionMajor === targetMajor && versionMinor === targetMinor && compareVersionsSimple(normalizedVersion, targetVersion) > 0;
   }
 

[Survived] BlockStatement
helpers/version/_semver.ts:211:76
 }
 
 /** @ignore */
-function compareVersionsSimple(version1: string, version2: string): number {
-  const parts1 = version1.split('.').map(Number);
-  const parts2 = version2.split('.').map(Number);
-  const maxLength = Math.max(parts1.length, parts2.length);
-
-  for (let i = 0; i < maxLength; i++) {
-    const part1 = parts1[i] || 0;
-    const part2 = parts2[i] || 0;
-    if (part1 < part2) return -1;
-    if (part1 > part2) return 1;
-  }
-
-  return 0;
-}
+function compareVersionsSimple(version1: string, version2: string): number {}
 

[Survived] MethodExpression
helpers/version/_semver.ts:214:21
 function compareVersionsSimple(version1: string, version2: string): number {
   const parts1 = version1.split('.').map(Number);
   const parts2 = version2.split('.').map(Number);
-  const maxLength = Math.max(parts1.length, parts2.length);
+  const maxLength = Math.min(parts1.length, parts2.length);
 
   for (let i = 0; i < maxLength; i++) {

[Survived] ConditionalExpression
helpers/version/_semver.ts:218:19
 
   for (let i = 0; i < maxLength; i++) {
     const part1 = parts1[i] || 0;
-    const part2 = parts2[i] || 0;
+    const part2 = true;
     if (part1 < part2) return -1;
     if (part1 > part2) return 1;

[Survived] ConditionalExpression
helpers/version/_semver.ts:219:9
   for (let i = 0; i < maxLength; i++) {
     const part1 = parts1[i] || 0;
     const part2 = parts2[i] || 0;
-    if (part1 < part2) return -1;
+    if (false) return -1;
     if (part1 > part2) return 1;
   }

[Survived] ConditionalExpression
helpers/version/_semver.ts:219:9
   for (let i = 0; i < maxLength; i++) {
     const part1 = parts1[i] || 0;
     const part2 = parts2[i] || 0;
-    if (part1 < part2) return -1;
+    if (true) return -1;
     if (part1 > part2) return 1;
   }

[Survived] ConditionalExpression
helpers/version/_semver.ts:220:9
     const part1 = parts1[i] || 0;
     const part2 = parts2[i] || 0;
     if (part1 < part2) return -1;
-    if (part1 > part2) return 1;
+    if (false) return 1;
   }
 
