[Survived] BlockStatement
helpers/version/isPrerelease.ts:51:147
 export function isPrerelease(version: AnyParsedVersion): boolean;
 export function isPrerelease(version: undefined): undefined;
 export function isPrerelease(version: null): null;
-export function isPrerelease(version: string | AnyParsedVersion | undefined | null, scheme: VersionScheme = 'semver'): boolean | undefined | null {
-  if (version === undefined || version === null) return version;
-
-  // Normalize to a parsed object first so there's exactly one switch on `.scheme` below,
-  // instead of two independent ones (string-input and object-input) that would each need
-  // their own case added for every future scheme.
-  const parsed = typeof version === 'string' ? parse(version, scheme) : version;
-
-  switch (parsed.scheme) {
-    case 'semver':
-      return parsed.prerelease.length > 0;
-    case 'gentoo':
-      return isPrereleaseGentoo(parsed);
-    default:
-      return assertNeverScheme(parsed);
-  }
-}
+export function isPrerelease(version: string | AnyParsedVersion | undefined | null, scheme: VersionScheme = 'semver'): boolean | undefined | null {}
 

[Survived] ConditionalExpression
helpers/version/isPrerelease.ts:52:7
 export function isPrerelease(version: undefined): undefined;
 export function isPrerelease(version: null): null;
 export function isPrerelease(version: string | AnyParsedVersion | undefined | null, scheme: VersionScheme = 'semver'): boolean | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (false) return version;
 
   // Normalize to a parsed object first so there's exactly one switch on `.scheme` below,

[Survived] ConditionalExpression
helpers/version/isPrerelease.ts:52:7
 export function isPrerelease(version: undefined): undefined;
 export function isPrerelease(version: null): null;
 export function isPrerelease(version: string | AnyParsedVersion | undefined | null, scheme: VersionScheme = 'semver'): boolean | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (false || version === null) return version;
 
   // Normalize to a parsed object first so there's exactly one switch on `.scheme` below,

[Survived] ConditionalExpression
helpers/version/isPrerelease.ts:57:18
   // Normalize to a parsed object first so there's exactly one switch on `.scheme` below,
   // instead of two independent ones (string-input and object-input) that would each need
   // their own case added for every future scheme.
-  const parsed = typeof version === 'string' ? parse(version, scheme) : version;
+  const parsed = false ? parse(version, scheme) : version;
 
   switch (parsed.scheme) {

[Survived] EqualityOperator
helpers/version/isPrerelease.ts:57:18
   // Normalize to a parsed object first so there's exactly one switch on `.scheme` below,
   // instead of two independent ones (string-input and object-input) that would each need
   // their own case added for every future scheme.
-  const parsed = typeof version === 'string' ? parse(version, scheme) : version;
+  const parsed = typeof version !== 'string' ? parse(version, scheme) : version;
 
   switch (parsed.scheme) {

[Survived] ConditionalExpression
helpers/version/isPrerelease.ts:60:5
   const parsed = typeof version === 'string' ? parse(version, scheme) : version;
 
   switch (parsed.scheme) {
-    case 'semver':
-      return parsed.prerelease.length > 0;
+    case 'semver':
     case 'gentoo':
       return isPrereleaseGentoo(parsed);

[Survived] ConditionalExpression
helpers/version/isPrerelease.ts:61:14
 
   switch (parsed.scheme) {
     case 'semver':
-      return parsed.prerelease.length > 0;
+      return true;
     case 'gentoo':
       return isPrereleaseGentoo(parsed);

[Survived] EqualityOperator
helpers/version/isPrerelease.ts:61:14
 
   switch (parsed.scheme) {
     case 'semver':
-      return parsed.prerelease.length > 0;
+      return parsed.prerelease.length >= 0;
     case 'gentoo':
       return isPrereleaseGentoo(parsed);

[Survived] ConditionalExpression
helpers/version/isPrerelease.ts:62:5
   switch (parsed.scheme) {
     case 'semver':
       return parsed.prerelease.length > 0;
-    case 'gentoo':
-      return isPrereleaseGentoo(parsed);
+    case 'gentoo':
     default:
       return assertNeverScheme(parsed);

[Survived] StringLiteral
helpers/version/isPrerelease.ts:62:10
   switch (parsed.scheme) {
     case 'semver':
       return parsed.prerelease.length > 0;
-    case 'gentoo':
+    case "":
       return isPrereleaseGentoo(parsed);
     default:

[Survived] ConditionalExpression
helpers/version/isPrerelease.ts:64:5
       return parsed.prerelease.length > 0;
     case 'gentoo':
       return isPrereleaseGentoo(parsed);
-    default:
-      return assertNeverScheme(parsed);
+    default:
   }
 }
