[Survived] BlockStatement
helpers/_shared/_walkPropertyPath.ts:18:89
  * this specific piece.
  * @ignore
  */
-export function walkPropertyPath(value: unknown, keys: readonly PropertyKey[]): unknown {
-  let result = value;
-  for (const key of keys) {
-    if (result == null || typeof result !== 'object') {
-      return undefined;
-    }
-    result = (result as Record<PropertyKey, unknown>)[key];
-  }
-  return result;
-}
+export function walkPropertyPath(value: unknown, keys: readonly PropertyKey[]): unknown {}
 

[Survived] BlockStatement
helpers/_shared/_walkPropertyPath.ts:20:27
  */
 export function walkPropertyPath(value: unknown, keys: readonly PropertyKey[]): unknown {
   let result = value;
-  for (const key of keys) {
-    if (result == null || typeof result !== 'object') {
-      return undefined;
-    }
-    result = (result as Record<PropertyKey, unknown>)[key];
-  }
+  for (const key of keys) {}
   return result;
 }

[Survived] BlockStatement
helpers/_shared/_walkPropertyPath.ts:21:55
 export function walkPropertyPath(value: unknown, keys: readonly PropertyKey[]): unknown {
   let result = value;
   for (const key of keys) {
-    if (result == null || typeof result !== 'object') {
-      return undefined;
-    }
+    if (result == null || typeof result !== 'object') {}
     result = (result as Record<PropertyKey, unknown>)[key];
   }

[Survived] ConditionalExpression
helpers/_shared/_walkPropertyPath.ts:21:9
 export function walkPropertyPath(value: unknown, keys: readonly PropertyKey[]): unknown {
   let result = value;
   for (const key of keys) {
-    if (result == null || typeof result !== 'object') {
+    if (false) {
       return undefined;
     }
