[Survived] BlockStatement
helpers/array/countBy.ts:32:51
 export function countBy<T, K extends PropertyKey>(
   array: readonly T[] | null | undefined,
   keyFn: (item: T) => K,
-): Partial<Record<Exclude<K, UnsafeKey>, number>> {
-  const result: Partial<Record<K, number>> = {};
-  if (array == null) return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
-  for (const item of array) {
-    const key = keyFn(item);
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    result[key] = (result[key] ?? 0) + 1;
-  }
-  return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
-}
+): Partial<Record<Exclude<K, UnsafeKey>, number>> {}
 

[Survived] EqualityOperator
helpers/array/countBy.ts:34:7
   keyFn: (item: T) => K,
 ): Partial<Record<Exclude<K, UnsafeKey>, number>> {
   const result: Partial<Record<K, number>> = {};
-  if (array == null) return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
+  if (array != null) return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
   for (const item of array) {
     const key = keyFn(item);

[Survived] ConditionalExpression
helpers/array/countBy.ts:34:7
   keyFn: (item: T) => K,
 ): Partial<Record<Exclude<K, UnsafeKey>, number>> {
   const result: Partial<Record<K, number>> = {};
-  if (array == null) return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
+  if (true) return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
   for (const item of array) {
     const key = keyFn(item);

[Survived] BlockStatement
helpers/array/countBy.ts:35:29
 ): Partial<Record<Exclude<K, UnsafeKey>, number>> {
   const result: Partial<Record<K, number>> = {};
   if (array == null) return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
-  for (const item of array) {
-    const key = keyFn(item);
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    result[key] = (result[key] ?? 0) + 1;
-  }
+  for (const item of array) {}
   return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
 }

[Survived] ConditionalExpression
helpers/array/countBy.ts:37:9
   if (array == null) return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
   for (const item of array) {
     const key = keyFn(item);
-    if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
+    if (true && UNSAFE_KEYS.has(key)) continue;
     result[key] = (result[key] ?? 0) + 1;
   }

[Survived] ArithmeticOperator
helpers/array/countBy.ts:38:19
   for (const item of array) {
     const key = keyFn(item);
     if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    result[key] = (result[key] ?? 0) + 1;
+    result[key] = (result[key] ?? 0) - 1;
   }
   return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;

[Survived] LogicalOperator
helpers/array/countBy.ts:38:20
   for (const item of array) {
     const key = keyFn(item);
     if (typeof key === 'string' && UNSAFE_KEYS.has(key)) continue;
-    result[key] = (result[key] ?? 0) + 1;
+    result[key] = (result[key] && 0) + 1;
   }
   return result as Partial<Record<Exclude<K, UnsafeKey>, number>>;
