[Survived] BlockStatement
helpers/array/findMap.ts:27:18
 export function findMap<T, R>(
   array: readonly T[] | null | undefined,
   fn: (item: T, index: number) => R | undefined,
-): R | undefined {
-  if (array == null) return undefined;
-  for (let i = 0; i < array.length; i++) {
-    const result = fn(array[i], i);
-    if (result !== undefined) return result;
-  }
-  return undefined;
-}
+): R | undefined {}
 

[Survived] ConditionalExpression
helpers/array/findMap.ts:28:7
   array: readonly T[] | null | undefined,
   fn: (item: T, index: number) => R | undefined,
 ): R | undefined {
-  if (array == null) return undefined;
+  if (true) return undefined;
   for (let i = 0; i < array.length; i++) {
     const result = fn(array[i], i);

[Survived] EqualityOperator
helpers/array/findMap.ts:28:7
   array: readonly T[] | null | undefined,
   fn: (item: T, index: number) => R | undefined,
 ): R | undefined {
-  if (array == null) return undefined;
+  if (array != null) return undefined;
   for (let i = 0; i < array.length; i++) {
     const result = fn(array[i], i);

[Survived] EqualityOperator
helpers/array/findMap.ts:29:19
   fn: (item: T, index: number) => R | undefined,
 ): R | undefined {
   if (array == null) return undefined;
-  for (let i = 0; i < array.length; i++) {
+  for (let i = 0; i >= array.length; i++) {
     const result = fn(array[i], i);
     if (result !== undefined) return result;

[Survived] BlockStatement
helpers/array/findMap.ts:29:42
   fn: (item: T, index: number) => R | undefined,
 ): R | undefined {
   if (array == null) return undefined;
-  for (let i = 0; i < array.length; i++) {
-    const result = fn(array[i], i);
-    if (result !== undefined) return result;
-  }
+  for (let i = 0; i < array.length; i++) {}
   return undefined;
 }

[Survived] EqualityOperator
helpers/array/findMap.ts:31:9
   if (array == null) return undefined;
   for (let i = 0; i < array.length; i++) {
     const result = fn(array[i], i);
-    if (result !== undefined) return result;
+    if (result === undefined) return result;
   }
   return undefined;

[Survived] ConditionalExpression
helpers/array/findMap.ts:31:9
   if (array == null) return undefined;
   for (let i = 0; i < array.length; i++) {
     const result = fn(array[i], i);
-    if (result !== undefined) return result;
+    if (true) return result;
   }
   return undefined;
