[Survived] BlockStatement
helpers/array/isEmpty.ts:19:117
  * isEmpty([1, 2, 3])   // => false
  * @since 2.0.3
  */
-export function isEmpty(value: readonly unknown[] | null | undefined): value is readonly never[] | null | undefined {
-  return value == null || value.length === 0;
-}
+export function isEmpty(value: readonly unknown[] | null | undefined): value is readonly never[] | null | undefined {}
 

[Survived] ConditionalExpression
helpers/array/isEmpty.ts:20:27
  * @since 2.0.3
  */
 export function isEmpty(value: readonly unknown[] | null | undefined): value is readonly never[] | null | undefined {
-  return value == null || value.length === 0;
+  return value == null || false;
 }
 

[Survived] LogicalOperator
helpers/array/isEmpty.ts:20:10
  * @since 2.0.3
  */
 export function isEmpty(value: readonly unknown[] | null | undefined): value is readonly never[] | null | undefined {
-  return value == null || value.length === 0;
+  return value == null && value.length === 0;
 }
 
