[Survived] BlockStatement
helpers/array/maxBy.ts:21:109
  * maxBy([], (item: { v: number }) => item.v) // => undefined
  * @since 3.0.8
  */
-export function maxBy<T>(array: readonly T[] | null | undefined, keyFn: (item: T) => number): T | undefined {
-  if (array == null || array.length === 0) return undefined;
-  let bestItem = array[0]!;
-  let bestKey = keyFn(bestItem);
-  for (let i = 1; i < array.length; i++) {
-    const item = array[i]!;
-    const key = keyFn(item);
-    if (key > bestKey) {
-      bestItem = item;
-      bestKey = key;
-    }
-  }
-  return bestItem;
-}
+export function maxBy<T>(array: readonly T[] | null | undefined, keyFn: (item: T) => number): T | undefined {}
 

[Survived] ConditionalExpression
helpers/array/maxBy.ts:22:24
  * @since 3.0.8
  */
 export function maxBy<T>(array: readonly T[] | null | undefined, keyFn: (item: T) => number): T | undefined {
-  if (array == null || array.length === 0) return undefined;
+  if (array == null || false) return undefined;
   let bestItem = array[0]!;
   let bestKey = keyFn(bestItem);

[Survived] EqualityOperator
helpers/array/maxBy.ts:22:7
  * @since 3.0.8
  */
 export function maxBy<T>(array: readonly T[] | null | undefined, keyFn: (item: T) => number): T | undefined {
-  if (array == null || array.length === 0) return undefined;
+  if (array != null || array.length === 0) return undefined;
   let bestItem = array[0]!;
   let bestKey = keyFn(bestItem);

[Survived] ConditionalExpression
helpers/array/maxBy.ts:25:19
   if (array == null || array.length === 0) return undefined;
   let bestItem = array[0]!;
   let bestKey = keyFn(bestItem);
-  for (let i = 1; i < array.length; i++) {
+  for (let i = 1; false; i++) {
     const item = array[i]!;
     const key = keyFn(item);

[Survived] EqualityOperator
helpers/array/maxBy.ts:28:9
   for (let i = 1; i < array.length; i++) {
     const item = array[i]!;
     const key = keyFn(item);
-    if (key > bestKey) {
+    if (key <= bestKey) {
       bestItem = item;
       bestKey = key;

[Survived] EqualityOperator
helpers/array/maxBy.ts:28:9
   for (let i = 1; i < array.length; i++) {
     const item = array[i]!;
     const key = keyFn(item);
-    if (key > bestKey) {
+    if (key >= bestKey) {
       bestItem = item;
       bestKey = key;
