[Survived] BlockStatement
helpers/array/min.ts:20:86
  * min(null)                // => undefined
  * @since 2.0.2
  */
-export function min(array: readonly number[] | null | undefined): number | undefined {
-  if (array == null || array.length === 0) return undefined;
-  let result = Infinity;
-  for (const val of array) {
-    if (Number.isNaN(val)) return NaN;
-    if (val < result || (Object.is(val, -0) && Object.is(result, 0))) result = val;
-  }
-  return result;
-}
+export function min(array: readonly number[] | null | undefined): number | undefined {}
 

[Survived] ConditionalExpression
helpers/array/min.ts:21:7
  * @since 2.0.2
  */
 export function min(array: readonly number[] | null | undefined): number | undefined {
-  if (array == null || array.length === 0) return undefined;
+  if (false) return undefined;
   let result = Infinity;
   for (const val of array) {

[Survived] ConditionalExpression
helpers/array/min.ts:21:7
  * @since 2.0.2
  */
 export function min(array: readonly number[] | null | undefined): number | undefined {
-  if (array == null || array.length === 0) return undefined;
+  if (false || array.length === 0) return undefined;
   let result = Infinity;
   for (const val of array) {

[Survived] BlockStatement
helpers/array/min.ts:23:28
 export function min(array: readonly number[] | null | undefined): number | undefined {
   if (array == null || array.length === 0) return undefined;
   let result = Infinity;
-  for (const val of array) {
-    if (Number.isNaN(val)) return NaN;
-    if (val < result || (Object.is(val, -0) && Object.is(result, 0))) result = val;
-  }
+  for (const val of array) {}
   return result;
 }

[Survived] UnaryOperator
helpers/array/min.ts:25:41
   let result = Infinity;
   for (const val of array) {
     if (Number.isNaN(val)) return NaN;
-    if (val < result || (Object.is(val, -0) && Object.is(result, 0))) result = val;
+    if (val < result || (Object.is(val, +0) && Object.is(result, 0))) result = val;
   }
   return result;

[Survived] EqualityOperator
helpers/array/min.ts:25:9
   let result = Infinity;
   for (const val of array) {
     if (Number.isNaN(val)) return NaN;
-    if (val < result || (Object.is(val, -0) && Object.is(result, 0))) result = val;
+    if (val >= result || (Object.is(val, -0) && Object.is(result, 0))) result = val;
   }
   return result;
