[Survived] CallExpression
helpers/array/range.ts:54:7
   const result: number[] = [];
   if (increment > 0) {
     for (let i = start; i < stop; i += increment) {
-      result.push(i);
+      ;
     }
   } else {

[Survived] CallExpression
helpers/array/range.ts:58:7
     }
   } else {
     for (let i = start; i > stop; i += increment) {
-      result.push(i);
+      ;
     }
   }
