[Survived] BlockStatement
helpers/array/shuffle.ts:18:73
  * // => [3, 1, 5, 2, 4] (random order)
  * @since 2.0.0
  */
-export function shuffle<T>(array: readonly T[] | null | undefined): T[] {
-  if (array == null) return [];
-  const result = [...array];
-  for (let i = result.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
-    [result[i], result[j]] = [result[j], result[i]];
-  }
-  return result;
-}
+export function shuffle<T>(array: readonly T[] | null | undefined): T[] {}
 

[Survived] ConditionalExpression
helpers/array/shuffle.ts:19:7
  * @since 2.0.0
  */
 export function shuffle<T>(array: readonly T[] | null | undefined): T[] {
-  if (array == null) return [];
+  if (false) return [];
   const result = [...array];
   for (let i = result.length - 1; i > 0; i--) {

[Survived] EqualityOperator
helpers/array/shuffle.ts:19:7
  * @since 2.0.0
  */
 export function shuffle<T>(array: readonly T[] | null | undefined): T[] {
-  if (array == null) return [];
+  if (array != null) return [];
   const result = [...array];
   for (let i = result.length - 1; i > 0; i--) {

[Killed] ArithmeticOperator
helpers/array/shuffle.ts:21:16
 export function shuffle<T>(array: readonly T[] | null | undefined): T[] {
   if (array == null) return [];
   const result = [...array];
-  for (let i = result.length - 1; i > 0; i--) {
+  for (let i = result.length + 1; i > 0; i--) {
     const j = Math.floor(Math.random() * (i + 1));
     [result[i], result[j]] = [result[j], result[i]];
killedBy: sample — property-based all sampled items are from original array
statusReason: Property failed after 2 tests
{ seed: 828206177, path: "1:1:1:0:1:0:0:0:0:0:1:0", endOnFailure: true }
Counterexample: [[0],1]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
