[Survived] BlockStatement
helpers/array/sum.ts:17:74
  * sum(null)         // => 0
  * @since 2.0.0
  */
-export function sum(array: readonly number[] | null | undefined): number {
-  if (array == null) return 0;
-  return array.reduce((acc, n) => acc + n, 0);
-}
+export function sum(array: readonly number[] | null | undefined): number {}
 

[Survived] ConditionalExpression
helpers/array/sum.ts:18:7
  * @since 2.0.0
  */
 export function sum(array: readonly number[] | null | undefined): number {
-  if (array == null) return 0;
+  if (true) return 0;
   return array.reduce((acc, n) => acc + n, 0);
 }

[Survived] EqualityOperator
helpers/array/sum.ts:18:7
  * @since 2.0.0
  */
 export function sum(array: readonly number[] | null | undefined): number {
-  if (array == null) return 0;
+  if (array != null) return 0;
   return array.reduce((acc, n) => acc + n, 0);
 }

[Survived] ArrowFunction
helpers/array/sum.ts:19:23
  */
 export function sum(array: readonly number[] | null | undefined): number {
   if (array == null) return 0;
-  return array.reduce((acc, n) => acc + n, 0);
+  return array.reduce(() => undefined, 0);
 }
 

[Survived] ArithmeticOperator
helpers/array/sum.ts:19:35
  */
 export function sum(array: readonly number[] | null | undefined): number {
   if (array == null) return 0;
-  return array.reduce((acc, n) => acc + n, 0);
+  return array.reduce((acc, n) => acc - n, 0);
 }
 
