[Survived] BlockStatement
helpers/array/unique.ts:14:72
  * @returns New array with unique values only
  * @since 1.9.0
  */
-export function unique<T>(array: readonly T[] | null | undefined): T[] {
-  if (array == null) return [];
-  return Array.from(new Set(array));
-}
+export function unique<T>(array: readonly T[] | null | undefined): T[] {}
 

[Survived] ConditionalExpression
helpers/array/unique.ts:15:7
  * @since 1.9.0
  */
 export function unique<T>(array: readonly T[] | null | undefined): T[] {
-  if (array == null) return [];
+  if (false) return [];
   return Array.from(new Set(array));
 }

[Survived] ConditionalExpression
helpers/array/unique.ts:15:7
  * @since 1.9.0
  */
 export function unique<T>(array: readonly T[] | null | undefined): T[] {
-  if (array == null) return [];
+  if (true) return [];
   return Array.from(new Set(array));
 }
