[Survived] BlockStatement
helpers/color/hslToRgb.ts:22:66
  * // => { r: 255, g: 0, b: 0, a: 1 }
  * @since 3.0.0
  */
-export function hslToRgb({ h, s, l, a = 1 }: HslColor): RgbColor {
-  const sN = s / 100;
-  const lN = l / 100;
-  const c = (1 - Math.abs(2 * lN - 1)) * sN;
-  const hPrime = (((h % 360) + 360) % 360) / 60;
-  const x = c * (1 - Math.abs((hPrime % 2) - 1));
-  const m = lN - c / 2;
-
-  let rN: number;
-  let gN: number;
-  let bN: number;
-  if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
-  else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
-  else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
-  else if (hPrime < 4) [rN, gN, bN] = [0, x, c];
-  else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];
-  else [rN, gN, bN] = [c, 0, x];
-
-  return {
-    r: Math.round((rN + m) * 255),
-    g: Math.round((gN + m) * 255),
-    b: Math.round((bN + m) * 255),
-    a,
-  };
-}
+export function hslToRgb({ h, s, l, a = 1 }: HslColor): RgbColor {}
 

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:23:14
  * @since 3.0.0
  */
 export function hslToRgb({ h, s, l, a = 1 }: HslColor): RgbColor {
-  const sN = s / 100;
+  const sN = s * 100;
   const lN = l / 100;
   const c = (1 - Math.abs(2 * lN - 1)) * sN;

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:24:14
  */
 export function hslToRgb({ h, s, l, a = 1 }: HslColor): RgbColor {
   const sN = s / 100;
-  const lN = l / 100;
+  const lN = l * 100;
   const c = (1 - Math.abs(2 * lN - 1)) * sN;
   const hPrime = (((h % 360) + 360) % 360) / 60;

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:25:14
 export function hslToRgb({ h, s, l, a = 1 }: HslColor): RgbColor {
   const sN = s / 100;
   const lN = l / 100;
-  const c = (1 - Math.abs(2 * lN - 1)) * sN;
+  const c = (1 + Math.abs(2 * lN - 1)) * sN;
   const hPrime = (((h % 360) + 360) % 360) / 60;
   const x = c * (1 - Math.abs((hPrime % 2) - 1));

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:25:27
 export function hslToRgb({ h, s, l, a = 1 }: HslColor): RgbColor {
   const sN = s / 100;
   const lN = l / 100;
-  const c = (1 - Math.abs(2 * lN - 1)) * sN;
+  const c = (1 - Math.abs(2 * lN + 1)) * sN;
   const hPrime = (((h % 360) + 360) % 360) / 60;
   const x = c * (1 - Math.abs((hPrime % 2) - 1));

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:26:19
   const sN = s / 100;
   const lN = l / 100;
   const c = (1 - Math.abs(2 * lN - 1)) * sN;
-  const hPrime = (((h % 360) + 360) % 360) / 60;
+  const hPrime = ((h % 360 + 360) * 360) / 60;
   const x = c * (1 - Math.abs((hPrime % 2) - 1));
   const m = lN - c / 2;

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:26:20
   const sN = s / 100;
   const lN = l / 100;
   const c = (1 - Math.abs(2 * lN - 1)) * sN;
-  const hPrime = (((h % 360) + 360) % 360) / 60;
+  const hPrime = ((h % 360 - 360) % 360) / 60;
   const x = c * (1 - Math.abs((hPrime % 2) - 1));
   const m = lN - c / 2;

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:27:18
   const lN = l / 100;
   const c = (1 - Math.abs(2 * lN - 1)) * sN;
   const hPrime = (((h % 360) + 360) % 360) / 60;
-  const x = c * (1 - Math.abs((hPrime % 2) - 1));
+  const x = c * (1 + Math.abs(hPrime % 2 - 1));
   const m = lN - c / 2;
 

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:27:13
   const lN = l / 100;
   const c = (1 - Math.abs(2 * lN - 1)) * sN;
   const hPrime = (((h % 360) + 360) % 360) / 60;
-  const x = c * (1 - Math.abs((hPrime % 2) - 1));
+  const x = c / (1 - Math.abs(hPrime % 2 - 1));
   const m = lN - c / 2;
 

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:28:13
   const c = (1 - Math.abs(2 * lN - 1)) * sN;
   const hPrime = (((h % 360) + 360) % 360) / 60;
   const x = c * (1 - Math.abs((hPrime % 2) - 1));
-  const m = lN - c / 2;
+  const m = lN + c / 2;
 
   let rN: number;

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:28:18
   const c = (1 - Math.abs(2 * lN - 1)) * sN;
   const hPrime = (((h % 360) + 360) % 360) / 60;
   const x = c * (1 - Math.abs((hPrime % 2) - 1));
-  const m = lN - c / 2;
+  const m = lN - c * 2;
 
   let rN: number;

[Survived] ConditionalExpression
helpers/color/hslToRgb.ts:33:7
   let rN: number;
   let gN: number;
   let bN: number;
-  if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
+  if (false) [rN, gN, bN] = [c, x, 0];
   else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];

[Survived] ConditionalExpression
helpers/color/hslToRgb.ts:33:7
   let rN: number;
   let gN: number;
   let bN: number;
-  if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
+  if (true) [rN, gN, bN] = [c, x, 0];
   else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];

[Survived] ConditionalExpression
helpers/color/hslToRgb.ts:34:12
   let gN: number;
   let bN: number;
   if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
-  else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
+  else if (true) [rN, gN, bN] = [x, c, 0];
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
   else if (hPrime < 4) [rN, gN, bN] = [0, x, c];

[Survived] EqualityOperator
helpers/color/hslToRgb.ts:34:12
   let gN: number;
   let bN: number;
   if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
-  else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
+  else if (hPrime >= 2) [rN, gN, bN] = [x, c, 0];
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
   else if (hPrime < 4) [rN, gN, bN] = [0, x, c];

[Survived] ConditionalExpression
helpers/color/hslToRgb.ts:35:12
   let bN: number;
   if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
   else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
-  else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
+  else if (false) [rN, gN, bN] = [0, c, x];
   else if (hPrime < 4) [rN, gN, bN] = [0, x, c];
   else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];

[Survived] ConditionalExpression
helpers/color/hslToRgb.ts:35:12
   let bN: number;
   if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
   else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
-  else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
+  else if (true) [rN, gN, bN] = [0, c, x];
   else if (hPrime < 4) [rN, gN, bN] = [0, x, c];
   else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];

[Survived] ConditionalExpression
helpers/color/hslToRgb.ts:36:12
   if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
   else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
-  else if (hPrime < 4) [rN, gN, bN] = [0, x, c];
+  else if (false) [rN, gN, bN] = [0, x, c];
   else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];
   else [rN, gN, bN] = [c, 0, x];

[Survived] EqualityOperator
helpers/color/hslToRgb.ts:36:12
   if (hPrime < 1) [rN, gN, bN] = [c, x, 0];
   else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
-  else if (hPrime < 4) [rN, gN, bN] = [0, x, c];
+  else if (hPrime <= 4) [rN, gN, bN] = [0, x, c];
   else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];
   else [rN, gN, bN] = [c, 0, x];

[Survived] ConditionalExpression
helpers/color/hslToRgb.ts:37:12
   else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
   else if (hPrime < 4) [rN, gN, bN] = [0, x, c];
-  else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];
+  else if (false) [rN, gN, bN] = [x, 0, c];
   else [rN, gN, bN] = [c, 0, x];
 

[Survived] ConditionalExpression
helpers/color/hslToRgb.ts:37:12
   else if (hPrime < 2) [rN, gN, bN] = [x, c, 0];
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
   else if (hPrime < 4) [rN, gN, bN] = [0, x, c];
-  else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];
+  else if (true) [rN, gN, bN] = [x, 0, c];
   else [rN, gN, bN] = [c, 0, x];
 

[Survived] ArrayDeclaration
helpers/color/hslToRgb.ts:38:23
   else if (hPrime < 3) [rN, gN, bN] = [0, c, x];
   else if (hPrime < 4) [rN, gN, bN] = [0, x, c];
   else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];
-  else [rN, gN, bN] = [c, 0, x];
+  else [rN, gN, bN] = [];
 
   return {

[Survived] ObjectLiteral
helpers/color/hslToRgb.ts:40:10
   else if (hPrime < 5) [rN, gN, bN] = [x, 0, c];
   else [rN, gN, bN] = [c, 0, x];
 
-  return {
-    r: Math.round((rN + m) * 255),
-    g: Math.round((gN + m) * 255),
-    b: Math.round((bN + m) * 255),
-    a,
-  };
+  return {};
 }
 

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:41:19
   else [rN, gN, bN] = [c, 0, x];
 
   return {
-    r: Math.round((rN + m) * 255),
+    r: Math.round((rN + m) / 255),
     g: Math.round((gN + m) * 255),
     b: Math.round((bN + m) * 255),

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:41:20
   else [rN, gN, bN] = [c, 0, x];
 
   return {
-    r: Math.round((rN + m) * 255),
+    r: Math.round((rN - m) * 255),
     g: Math.round((gN + m) * 255),
     b: Math.round((bN + m) * 255),

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:42:20
 
   return {
     r: Math.round((rN + m) * 255),
-    g: Math.round((gN + m) * 255),
+    g: Math.round((gN - m) * 255),
     b: Math.round((bN + m) * 255),
     a,

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:42:19
 
   return {
     r: Math.round((rN + m) * 255),
-    g: Math.round((gN + m) * 255),
+    g: Math.round((gN + m) / 255),
     b: Math.round((bN + m) * 255),
     a,

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:43:20
   return {
     r: Math.round((rN + m) * 255),
     g: Math.round((gN + m) * 255),
-    b: Math.round((bN + m) * 255),
+    b: Math.round((bN - m) * 255),
     a,
   };

[Survived] ArithmeticOperator
helpers/color/hslToRgb.ts:43:19
   return {
     r: Math.round((rN + m) * 255),
     g: Math.round((gN + m) * 255),
-    b: Math.round((bN + m) * 255),
+    b: Math.round((bN + m) / 255),
     a,
   };
