[Survived] BlockStatement
helpers/date/ensureDate.ts:18:102
  * so values crossing a realm boundary (vm context, worker, iframe) are still
  * recognized correctly.
  */
-function isEpochMillisecondsLike(value: unknown): value is Temporal.Instant | Temporal.ZonedDateTime {
-  return (
-    typeof value === 'object' &&
-    value !== null &&
-    'epochMilliseconds' in value &&
-    typeof value.epochMilliseconds === 'number'
-  );
-}
+function isEpochMillisecondsLike(value: unknown): value is Temporal.Instant | Temporal.ZonedDateTime {}
 
 /**

[Killed] LogicalOperator
helpers/date/ensureDate.ts:20:5
  */
 function isEpochMillisecondsLike(value: unknown): value is Temporal.Instant | Temporal.ZonedDateTime {
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    'epochMilliseconds' in value &&
+    typeof value === 'object' && value !== null || 'epochMilliseconds' in value &&
     typeof value.epochMilliseconds === 'number'
   );
killedBy: compare DateLike inputs should accept timestamp inputs
statusReason: Cannot use 'in' operator to search for 'epochMilliseconds' in 1672574400000

[Killed] ConditionalExpression
helpers/date/ensureDate.ts:20:5
  */
 function isEpochMillisecondsLike(value: unknown): value is Temporal.Instant | Temporal.ZonedDateTime {
   return (
-    typeof value === 'object' &&
+    true &&
     value !== null &&
     'epochMilliseconds' in value &&
killedBy: isWithinRange returns true when date is within range
statusReason: Cannot use 'in' operator to search for 'epochMilliseconds' in 2025-06-15

[Survived] ConditionalExpression
helpers/date/ensureDate.ts:23:5
     typeof value === 'object' &&
     value !== null &&
     'epochMilliseconds' in value &&
-    typeof value.epochMilliseconds === 'number'
+    true
   );
 }

[Survived] EqualityOperator
helpers/date/ensureDate.ts:23:5
     typeof value === 'object' &&
     value !== null &&
     'epochMilliseconds' in value &&
-    typeof value.epochMilliseconds === 'number'
+    typeof value.epochMilliseconds !== 'number'
   );
 }

[Killed] LogicalOperator
helpers/date/ensureDate.ts:53:7
  * @since 2.0.0
  */
 export function ensureDate(input: DateLike | null | undefined): Date | null {
-  if (input === null || input === undefined || input === '' || input === 0) {
+  if ((input === null || input === undefined || input === '') && input === 0) {
     return null;
   }
killedBy: startOf should return null for invalid input
statusReason: expected 1970-01-01T00:00:00.000Z to be null

[Killed] BlockStatement
helpers/date/ensureDate.ts:53:77
  * @since 2.0.0
  */
 export function ensureDate(input: DateLike | null | undefined): Date | null {
-  if (input === null || input === undefined || input === '' || input === 0) {
-    return null;
-  }
+  if (input === null || input === undefined || input === '' || input === 0) {}
 
   if (input instanceof Date) {
killedBy: startOf / endOf — contract invalid input → null
statusReason: expected 1970-01-31T23:59:59.999Z to be null

[Survived] ConditionalExpression
helpers/date/ensureDate.ts:61:7
     return isNaN(input.getTime()) ? null : input;
   }
 
-  if (isEpochMillisecondsLike(input)) {
+  if (false) {
     const date = new Date(input.epochMilliseconds);
     return isNaN(date.getTime()) ? null : date;

[Survived] BlockStatement
helpers/date/ensureDate.ts:61:39
     return isNaN(input.getTime()) ? null : input;
   }
 
-  if (isEpochMillisecondsLike(input)) {
-    const date = new Date(input.epochMilliseconds);
-    return isNaN(date.getTime()) ? null : date;
-  }
+  if (isEpochMillisecondsLike(input)) {}
 
   if (typeof input === 'number') {

[Killed] BlockStatement
helpers/date/ensureDate.ts:66:34
     return isNaN(date.getTime()) ? null : date;
   }
 
-  if (typeof input === 'number') {
-    const normalized = normalizeTimestamp(input);
-    const date = new Date(normalized);
-    return isNaN(date.getTime()) ? null : date;
-  }
+  if (typeof input === 'number') {}
 
   if (typeof input === 'string') {
killedBy: sequence — contract eachMonth with timestamp DateLike
statusReason: expected [] to have a length of 3 but got +0
