[Survived] BlockStatement
helpers/date/isValid.ts:24:56
  * @see `type/isTimestamp` for checking if a number is a valid timestamp
  * @since 2.0.0
  */
-export function isValid(value: unknown): value is Date {
-  return value instanceof Date && !Number.isNaN(value.getTime());
-}
+export function isValid(value: unknown): value is Date {}
 

[Survived] ConditionalExpression
helpers/date/isValid.ts:25:10
  * @since 2.0.0
  */
 export function isValid(value: unknown): value is Date {
-  return value instanceof Date && !Number.isNaN(value.getTime());
+  return false;
 }
 

[Survived] LogicalOperator
helpers/date/isValid.ts:25:10
  * @since 2.0.0
  */
 export function isValid(value: unknown): value is Date {
-  return value instanceof Date && !Number.isNaN(value.getTime());
+  return value instanceof Date || !Number.isNaN(value.getTime());
 }
 
