[Survived] BlockStatement
helpers/function/createCachedResolver.ts:52:52
 const claimedCaches = new WeakSet<object>();
 
 /** @ignore */
-function claimCache<C extends object>(cache: C): C {
-  if (claimedCaches.has(cache)) {
-    throw new Error(
-      'createCachedResolver: createCache() returned a cache instance already used by another createCachedResolver() call — each call must return an independent cache.',
-    );
-  }
-  claimedCaches.add(cache);
-  return cache;
-}
+function claimCache<C extends object>(cache: C): C {}
 
 /**

[Survived] BlockStatement
helpers/function/createCachedResolver.ts:53:33
 
 /** @ignore */
 function claimCache<C extends object>(cache: C): C {
-  if (claimedCaches.has(cache)) {
-    throw new Error(
-      'createCachedResolver: createCache() returned a cache instance already used by another createCachedResolver() call — each call must return an independent cache.',
-    );
-  }
+  if (claimedCaches.has(cache)) {}
   claimedCaches.add(cache);
   return cache;

[Survived] ConditionalExpression
helpers/function/createCachedResolver.ts:53:7
 
 /** @ignore */
 function claimCache<C extends object>(cache: C): C {
-  if (claimedCaches.has(cache)) {
+  if (true) {
     throw new Error(
       'createCachedResolver: createCache() returned a cache instance already used by another createCachedResolver() call — each call must return an independent cache.',

[Survived] CallExpression
helpers/function/createCachedResolver.ts:58:3
       'createCachedResolver: createCache() returned a cache instance already used by another createCachedResolver() call — each call must return an independent cache.',
     );
   }
-  claimedCaches.add(cache);
+  ;
   return cache;
 }

[Survived] ArrowFunction
helpers/function/createCachedResolver.ts:110:41
 ): CachedResolver<K, V>;
 export function createCachedResolver<K, V>(
   compute: (key: K) => V,
-  createCache: () => KeyedCache<K, V> = () => new Map<K, V>(),
+  createCache: () => KeyedCache<K, V> = () => undefined,
 ): CachedResolver<K, V> {
   let cache = claimCache(createCache());

[Survived] BooleanLiteral
helpers/function/createCachedResolver.ts:124:31
       // WeakMap.has()/.get() silently treat an unsupported key as "absent" (per
       // spec), so without this check a bad key would run compute() only to
       // lose the result when .set() throws below. Checked eagerly instead.
-      if (isWeakMap(cache) && !isWeakMapKey(key)) {
+      if (isWeakMap(cache) && isWeakMapKey(key)) {
         throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${key === null ? 'null' : typeof key}`);
       }

[Survived] ConditionalExpression
helpers/function/createCachedResolver.ts:124:11
       // WeakMap.has()/.get() silently treat an unsupported key as "absent" (per
       // spec), so without this check a bad key would run compute() only to
       // lose the result when .set() throws below. Checked eagerly instead.
-      if (isWeakMap(cache) && !isWeakMapKey(key)) {
+      if (true) {
         throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${key === null ? 'null' : typeof key}`);
       }

[Survived] ConditionalExpression
helpers/function/createCachedResolver.ts:125:159
       // spec), so without this check a bad key would run compute() only to
       // lose the result when .set() throws below. Checked eagerly instead.
       if (isWeakMap(cache) && !isWeakMapKey(key)) {
-        throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${key === null ? 'null' : typeof key}`);
+        throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${true ? 'null' : typeof key}`);
       }
       if (cache.has(key)) return cache.get(key) as V;

[Survived] ConditionalExpression
helpers/function/createCachedResolver.ts:125:159
       // spec), so without this check a bad key would run compute() only to
       // lose the result when .set() throws below. Checked eagerly instead.
       if (isWeakMap(cache) && !isWeakMapKey(key)) {
-        throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${key === null ? 'null' : typeof key}`);
+        throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${false ? 'null' : typeof key}`);
       }
       if (cache.has(key)) return cache.get(key) as V;

[Survived] ConditionalExpression
helpers/function/createCachedResolver.ts:127:11
       if (isWeakMap(cache) && !isWeakMapKey(key)) {
         throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${key === null ? 'null' : typeof key}`);
       }
-      if (cache.has(key)) return cache.get(key) as V;
+      if (false) return cache.get(key) as V;
       if (inProgress.has(key)) {
         throw new Error('createCachedResolver: resolve() was called again for a key that is still being computed (circular dependency)');

[Survived] ConditionalExpression
helpers/function/createCachedResolver.ts:127:11
       if (isWeakMap(cache) && !isWeakMapKey(key)) {
         throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${key === null ? 'null' : typeof key}`);
       }
-      if (cache.has(key)) return cache.get(key) as V;
+      if (true) return cache.get(key) as V;
       if (inProgress.has(key)) {
         throw new Error('createCachedResolver: resolve() was called again for a key that is still being computed (circular dependency)');

[Survived] ConditionalExpression
helpers/function/createCachedResolver.ts:128:11
         throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${key === null ? 'null' : typeof key}`);
       }
       if (cache.has(key)) return cache.get(key) as V;
-      if (inProgress.has(key)) {
+      if (false) {
         throw new Error('createCachedResolver: resolve() was called again for a key that is still being computed (circular dependency)');
       }

[Survived] BlockStatement
helpers/function/createCachedResolver.ts:128:32
         throw new TypeError(`createCachedResolver: this resolver's cache is a WeakMap, which requires object, function, or (unregistered) symbol keys — got ${key === null ? 'null' : typeof key}`);
       }
       if (cache.has(key)) return cache.get(key) as V;
-      if (inProgress.has(key)) {
-        throw new Error('createCachedResolver: resolve() was called again for a key that is still being computed (circular dependency)');
-      }
+      if (inProgress.has(key)) {}
 
       // Snapshot the cache in use for this call: if compute() reentrantly

[Survived] CallExpression
helpers/function/createCachedResolver.ts:137:7
       // this call returns, and writing the result into that fresh instance
       // would silently undo the clear() the caller just asked for.
       const activeCache = cache;
-      inProgress.add(key);
+      ;
       try {
         const value = compute(key);

[Survived] BlockStatement
helpers/function/createCachedResolver.ts:138:11
       // would silently undo the clear() the caller just asked for.
       const activeCache = cache;
       inProgress.add(key);
-      try {
-        const value = compute(key);
-        if (cache === activeCache) activeCache.set(key, value);
-        return value;
-      } finally {
+      try {} finally {
         inProgress.delete(key);
       }

[Survived] CallExpression
helpers/function/createCachedResolver.ts:140:36
       inProgress.add(key);
       try {
         const value = compute(key);
-        if (cache === activeCache) activeCache.set(key, value);
+        if (cache === activeCache) ;
         return value;
       } finally {

[Survived] ConditionalExpression
helpers/function/createCachedResolver.ts:140:13
       inProgress.add(key);
       try {
         const value = compute(key);
-        if (cache === activeCache) activeCache.set(key, value);
+        if (true) activeCache.set(key, value);
         return value;
       } finally {

[Survived] BlockStatement
helpers/function/createCachedResolver.ts:142:17
         const value = compute(key);
         if (cache === activeCache) activeCache.set(key, value);
         return value;
-      } finally {
-        inProgress.delete(key);
-      }
+      } finally {}
     },
     clear(): void {

[Survived] CallExpression
helpers/function/createCachedResolver.ts:143:9
         if (cache === activeCache) activeCache.set(key, value);
         return value;
       } finally {
-        inProgress.delete(key);
+        ;
       }
     },

[Survived] BlockStatement
helpers/function/createCachedResolver.ts:146:19
         inProgress.delete(key);
       }
     },
-    clear(): void {
-      // Map exposes clear(); WeakMap deliberately doesn't (no way to enumerate
-      // its entries). Call it when available to free memory proactively
-      // instead of only dropping the reference and waiting for the next GC —
-      // matters most when cached values themselves are large.
-      cache.clear?.();
-      cache = createCache();
-    },
+    clear(): void {},
   };
 }

[Survived] OptionalChaining
helpers/function/createCachedResolver.ts:151:7
       // its entries). Call it when available to free memory proactively
       // instead of only dropping the reference and waiting for the next GC —
       // matters most when cached values themselves are large.
-      cache.clear?.();
+      cache.clear();
       cache = createCache();
     },
