[Survived] BlockStatement
helpers/function/once.ts:35:83
  * init(); // runs expensiveSetup again
  * @since 2.0.0
  */
-export function once<A extends unknown[], R>(fn: (...args: A) => R): OnceFn<A, R> {
-  let called = false;
-  let result: R;
-
-  const wrapped = (...args: A): R => {
-    if (!called) {
-      result = fn(...args);
-      called = true;
-    }
-    return result;
-  };
-
-  wrapped.reset = (): void => {
-    called = false;
-  };
-
-  return wrapped;
-}
+export function once<A extends unknown[], R>(fn: (...args: A) => R): OnceFn<A, R> {}
 

[Survived] BlockStatement
helpers/function/once.ts:39:38
   let called = false;
   let result: R;
 
-  const wrapped = (...args: A): R => {
-    if (!called) {
-      result = fn(...args);
-      called = true;
-    }
-    return result;
-  };
+  const wrapped = (...args: A): R => {};
 
   wrapped.reset = (): void => {

[Survived] BooleanLiteral
helpers/function/once.ts:42:16
   const wrapped = (...args: A): R => {
     if (!called) {
       result = fn(...args);
-      called = true;
+      called = false;
     }
     return result;
