[Survived] CallExpression
helpers/function/throttle.ts:26:7
 
     if (now - lastCallTime >= wait) {
       lastCallTime = now;
-      func(...args);
+      ;
     } else if (!timeoutId) {
       timeoutId = setTimeout(() => {

[Survived] CallExpression
helpers/function/throttle.ts:31:9
       timeoutId = setTimeout(() => {
         lastCallTime = Date.now();
         timeoutId = null;
-        func(...args);
+        ;
       }, wait - (now - lastCallTime));
     }
