[Survived] BlockStatement
helpers/guard/isArrayLike.ts:26:74
  * isArrayLike(null)            // => false
  * @since 2.0.3
  */
-export function isArrayLike(value: unknown): value is ArrayLike<unknown> {
-  if (value == null) return false;
-  const t = typeof value;
-  if (t !== 'object' && t !== 'string') return false;
-  const len = (value as ArrayLike<unknown>).length;
-  return typeof len === 'number' && Number.isInteger(len) && len >= 0;
-}
+export function isArrayLike(value: unknown): value is ArrayLike<unknown> {}
 

[Survived] ConditionalExpression
helpers/guard/isArrayLike.ts:27:7
  * @since 2.0.3
  */
 export function isArrayLike(value: unknown): value is ArrayLike<unknown> {
-  if (value == null) return false;
+  if (false) return false;
   const t = typeof value;
   if (t !== 'object' && t !== 'string') return false;

[Survived] ConditionalExpression
helpers/guard/isArrayLike.ts:27:7
  * @since 2.0.3
  */
 export function isArrayLike(value: unknown): value is ArrayLike<unknown> {
-  if (value == null) return false;
+  if (true) return false;
   const t = typeof value;
   if (t !== 'object' && t !== 'string') return false;

[Survived] ConditionalExpression
helpers/guard/isArrayLike.ts:29:25
 export function isArrayLike(value: unknown): value is ArrayLike<unknown> {
   if (value == null) return false;
   const t = typeof value;
-  if (t !== 'object' && t !== 'string') return false;
+  if (t !== 'object' && true) return false;
   const len = (value as ArrayLike<unknown>).length;
   return typeof len === 'number' && Number.isInteger(len) && len >= 0;

[Survived] EqualityOperator
helpers/guard/isArrayLike.ts:29:7
 export function isArrayLike(value: unknown): value is ArrayLike<unknown> {
   if (value == null) return false;
   const t = typeof value;
-  if (t !== 'object' && t !== 'string') return false;
+  if (t === 'object' && t !== 'string') return false;
   const len = (value as ArrayLike<unknown>).length;
   return typeof len === 'number' && Number.isInteger(len) && len >= 0;

[Survived] EqualityOperator
helpers/guard/isArrayLike.ts:31:62
   const t = typeof value;
   if (t !== 'object' && t !== 'string') return false;
   const len = (value as ArrayLike<unknown>).length;
-  return typeof len === 'number' && Number.isInteger(len) && len >= 0;
+  return typeof len === 'number' && Number.isInteger(len) && len < 0;
 }
 

[Survived] LogicalOperator
helpers/guard/isArrayLike.ts:31:10
   const t = typeof value;
   if (t !== 'object' && t !== 'string') return false;
   const len = (value as ArrayLike<unknown>).length;
-  return typeof len === 'number' && Number.isInteger(len) && len >= 0;
+  return typeof len === 'number' || Number.isInteger(len) && len >= 0;
 }
 
