[Survived] BlockStatement
helpers/guard/isAsyncIterable.ts:24:82
  * isAsyncIterable(null)         // => false
  * @since 2.0.3
  */
-export function isAsyncIterable(value: unknown): value is AsyncIterable<unknown> {
-  if (value === null || value === undefined) return false;
-  return typeof (value as AsyncIterable<unknown>)[Symbol.asyncIterator] === 'function';
-}
+export function isAsyncIterable(value: unknown): value is AsyncIterable<unknown> {}
 

[Survived] ConditionalExpression
helpers/guard/isAsyncIterable.ts:25:7
  * @since 2.0.3
  */
 export function isAsyncIterable(value: unknown): value is AsyncIterable<unknown> {
-  if (value === null || value === undefined) return false;
+  if (true) return false;
   return typeof (value as AsyncIterable<unknown>)[Symbol.asyncIterator] === 'function';
 }

[Survived] ConditionalExpression
helpers/guard/isAsyncIterable.ts:25:25
  * @since 2.0.3
  */
 export function isAsyncIterable(value: unknown): value is AsyncIterable<unknown> {
-  if (value === null || value === undefined) return false;
+  if (value === null || false) return false;
   return typeof (value as AsyncIterable<unknown>)[Symbol.asyncIterator] === 'function';
 }

[Survived] ConditionalExpression
helpers/guard/isAsyncIterable.ts:26:10
  */
 export function isAsyncIterable(value: unknown): value is AsyncIterable<unknown> {
   if (value === null || value === undefined) return false;
-  return typeof (value as AsyncIterable<unknown>)[Symbol.asyncIterator] === 'function';
+  return false;
 }
 

[Survived] EqualityOperator
helpers/guard/isAsyncIterable.ts:26:10
  */
 export function isAsyncIterable(value: unknown): value is AsyncIterable<unknown> {
   if (value === null || value === undefined) return false;
-  return typeof (value as AsyncIterable<unknown>)[Symbol.asyncIterator] === 'function';
+  return typeof (value as AsyncIterable<unknown>)[Symbol.asyncIterator] !== 'function';
 }
 
