[Survived] BlockStatement
helpers/guard/isBrowser.ts:20:38
  * isBrowser() // => true in a real browser, false in plain Node.js
  * @since 3.0.3
  */
-export function isBrowser(): boolean {
-  return typeof window !== 'undefined' && typeof window.document !== 'undefined';
-}
+export function isBrowser(): boolean {}
 

[Survived] ConditionalExpression
helpers/guard/isBrowser.ts:21:10
  * @since 3.0.3
  */
 export function isBrowser(): boolean {
-  return typeof window !== 'undefined' && typeof window.document !== 'undefined';
+  return false;
 }
 

[Survived] ConditionalExpression
helpers/guard/isBrowser.ts:21:43
  * @since 3.0.3
  */
 export function isBrowser(): boolean {
-  return typeof window !== 'undefined' && typeof window.document !== 'undefined';
+  return typeof window !== 'undefined' && true;
 }
 
