[Survived] BlockStatement
helpers/guard/isGenerator.ts:23:92
  * @see {@link isGeneratorFunction}
  * @since 2.0.3
  */
-export function isGenerator(value: unknown): value is Generator<unknown, unknown, unknown> {
-  return Object.prototype.toString.call(value) === '[object Generator]';
-}
+export function isGenerator(value: unknown): value is Generator<unknown, unknown, unknown> {}
 

[Survived] ConditionalExpression
helpers/guard/isGenerator.ts:24:10
  * @since 2.0.3
  */
 export function isGenerator(value: unknown): value is Generator<unknown, unknown, unknown> {
-  return Object.prototype.toString.call(value) === '[object Generator]';
+  return false;
 }
 

[Survived] EqualityOperator
helpers/guard/isGenerator.ts:24:10
  * @since 2.0.3
  */
 export function isGenerator(value: unknown): value is Generator<unknown, unknown, unknown> {
-  return Object.prototype.toString.call(value) === '[object Generator]';
+  return Object.prototype.toString.call(value) !== '[object Generator]';
 }
 
