[Survived] BlockStatement
helpers/guard/isJSONArray.ts:20:65
  * isJSONArray({})                // => false
  * @since 3.0.3
  */
-export function isJSONArray(value: unknown): value is unknown[] {
-  return Array.isArray(value) && value.every(isJSONValue);
-}
+export function isJSONArray(value: unknown): value is unknown[] {}
 

[Survived] MethodExpression
helpers/guard/isJSONArray.ts:21:34
  * @since 3.0.3
  */
 export function isJSONArray(value: unknown): value is unknown[] {
-  return Array.isArray(value) && value.every(isJSONValue);
+  return Array.isArray(value) && value.some(isJSONValue);
 }
 

[Survived] ConditionalExpression
helpers/guard/isJSONArray.ts:21:10
  * @since 3.0.3
  */
 export function isJSONArray(value: unknown): value is unknown[] {
-  return Array.isArray(value) && value.every(isJSONValue);
+  return false;
 }
 
