[Survived] EqualityOperator
helpers/guard/isNumber.ts:23:10
  * @since 1.9.0
  */
 export function isNumber(value: unknown): value is number {
-  return typeof value === 'number' && !Number.isNaN(value);
+  return typeof value !== 'number' && !Number.isNaN(value);
 }
 
