[Survived] BlockStatement
helpers/guard/isPromiseLike.ts:25:78
  * @see {@link isPromise} for a stricter check that also requires `.catch()`
  * @since 2.0.3
  */
-export function isPromiseLike(value: unknown): value is PromiseLike<unknown> {
-  return (
-    // Unlike isNodeStream/isObservable, also accepts `function`: a callable
-    // exposing `.then()` (e.g. an async function with a `then` property attached)
-    // is a realistic thenable shape per the Promise/A+ spec.
-    value !== null &&
-    (typeof value === 'object' || typeof value === 'function') &&
-    typeof (value as PromiseLike<unknown>).then === 'function'
-  );
-}
+export function isPromiseLike(value: unknown): value is PromiseLike<unknown> {}
 

[Survived] LogicalOperator
helpers/guard/isPromiseLike.ts:30:5
     // Unlike isNodeStream/isObservable, also accepts `function`: a callable
     // exposing `.then()` (e.g. an async function with a `then` property attached)
     // is a realistic thenable shape per the Promise/A+ spec.
-    value !== null &&
-    (typeof value === 'object' || typeof value === 'function') &&
+    value !== null || typeof value === 'object' || typeof value === 'function' &&
     typeof (value as PromiseLike<unknown>).then === 'function'
   );

[Survived] ConditionalExpression
helpers/guard/isPromiseLike.ts:30:5
     // Unlike isNodeStream/isObservable, also accepts `function`: a callable
     // exposing `.then()` (e.g. an async function with a `then` property attached)
     // is a realistic thenable shape per the Promise/A+ spec.
-    value !== null &&
-    (typeof value === 'object' || typeof value === 'function') &&
-    typeof (value as PromiseLike<unknown>).then === 'function'
+    false
   );
 }

[Survived] ConditionalExpression
helpers/guard/isPromiseLike.ts:31:6
     // exposing `.then()` (e.g. an async function with a `then` property attached)
     // is a realistic thenable shape per the Promise/A+ spec.
     value !== null &&
-    (typeof value === 'object' || typeof value === 'function') &&
+    (true) &&
     typeof (value as PromiseLike<unknown>).then === 'function'
   );

[Survived] ConditionalExpression
helpers/guard/isPromiseLike.ts:31:35
     // exposing `.then()` (e.g. an async function with a `then` property attached)
     // is a realistic thenable shape per the Promise/A+ spec.
     value !== null &&
-    (typeof value === 'object' || typeof value === 'function') &&
+    (typeof value === 'object' || false) &&
     typeof (value as PromiseLike<unknown>).then === 'function'
   );

[Survived] ConditionalExpression
helpers/guard/isPromiseLike.ts:32:5
     // is a realistic thenable shape per the Promise/A+ spec.
     value !== null &&
     (typeof value === 'object' || typeof value === 'function') &&
-    typeof (value as PromiseLike<unknown>).then === 'function'
+    true
   );
 }

[Survived] EqualityOperator
helpers/guard/isPromiseLike.ts:32:5
     // is a realistic thenable shape per the Promise/A+ spec.
     value !== null &&
     (typeof value === 'object' || typeof value === 'function') &&
-    typeof (value as PromiseLike<unknown>).then === 'function'
+    typeof (value as PromiseLike<unknown>).then !== 'function'
   );
 }
