[Survived] EqualityOperator
helpers/guard/isSpecialObject.ts:16:25
  * @since 2.0.0
  */
 export function isSpecialObject(value: unknown): boolean {
-  if (value === null || value === undefined) {
+  if (value === null || value !== undefined) {
     return false;
   }

[Survived] BlockStatement
helpers/guard/isSpecialObject.ts:16:46
  * @since 2.0.0
  */
 export function isSpecialObject(value: unknown): boolean {
-  if (value === null || value === undefined) {
-    return false;
-  }
+  if (value === null || value === undefined) {}
 
   // Functions are special objects

[Survived] EqualityOperator
helpers/guard/isSpecialObject.ts:21:7
   }
 
   // Functions are special objects
-  if (typeof value === 'function') {
+  if (typeof value !== 'function') {
     return true;
   }

[Survived] ConditionalExpression
helpers/guard/isSpecialObject.ts:21:7
   }
 
   // Functions are special objects
-  if (typeof value === 'function') {
+  if (false) {
     return true;
   }

[Survived] EqualityOperator
helpers/guard/isSpecialObject.ts:26:7
   }
 
   // Non-objects are not special
-  if (typeof value !== 'object') {
+  if (typeof value === 'object') {
     return false;
   }

[Survived] LogicalOperator
helpers/guard/isSpecialObject.ts:37:5
 
   // Check for built-in special objects
   if (
-    value instanceof Date ||
-    value instanceof Promise ||
-    value instanceof RegExp ||
-    value instanceof Error ||
-    value instanceof Map ||
-    value instanceof Set ||
-    value instanceof WeakMap ||
+    (value instanceof Date || value instanceof Promise || value instanceof RegExp || value instanceof Error || value instanceof Map || value instanceof Set) && value instanceof WeakMap ||
     value instanceof WeakSet ||
     value instanceof ArrayBuffer ||

[Survived] ConditionalExpression
helpers/guard/isSpecialObject.ts:52:7
   }
 
   // Check for Observable (RxJS or similar)
-  if (value.constructor?.name === 'Observable') {
+  if (true) {
     return true;
   }

[Survived] ConditionalExpression
helpers/guard/isSpecialObject.ts:52:7
   }
 
   // Check for Observable (RxJS or similar)
-  if (value.constructor?.name === 'Observable') {
+  if (false) {
     return true;
   }

[Survived] ConditionalExpression
helpers/guard/isSpecialObject.ts:57:7
   }
 
   // Check for DOM elements (if in browser environment)
-  if (typeof HTMLElement !== 'undefined' && value instanceof HTMLElement) {
+  if (false) {
     return true;
   }

[Survived] BlockStatement
helpers/guard/isSpecialObject.ts:57:75
   }
 
   // Check for DOM elements (if in browser environment)
-  if (typeof HTMLElement !== 'undefined' && value instanceof HTMLElement) {
-    return true;
-  }
+  if (typeof HTMLElement !== 'undefined' && value instanceof HTMLElement) {}
 
   // Check for other built-in types by constructor name

[Survived] StringLiteral
helpers/guard/isSpecialObject.ts:64:5
   // Check for other built-in types by constructor name
   const constructorName = value.constructor?.name;
   if (constructorName && [
-    'Buffer',       // Node.js Buffer
+    "",       // Node.js Buffer
     'URL',          // Web URL API
     'URLSearchParams',

[Survived] StringLiteral
helpers/guard/isSpecialObject.ts:65:5
   const constructorName = value.constructor?.name;
   if (constructorName && [
     'Buffer',       // Node.js Buffer
-    'URL',          // Web URL API
+    "",          // Web URL API
     'URLSearchParams',
     'File',         // Web File API

[Survived] StringLiteral
helpers/guard/isSpecialObject.ts:66:5
   if (constructorName && [
     'Buffer',       // Node.js Buffer
     'URL',          // Web URL API
-    'URLSearchParams',
+    "",
     'File',         // Web File API
     'Blob',         // Web Blob API

[Survived] StringLiteral
helpers/guard/isSpecialObject.ts:67:5
     'Buffer',       // Node.js Buffer
     'URL',          // Web URL API
     'URLSearchParams',
-    'File',         // Web File API
+    "",         // Web File API
     'Blob',         // Web Blob API
     'FormData',     // Web FormData API

[Survived] StringLiteral
helpers/guard/isSpecialObject.ts:71:5
     'Blob',         // Web Blob API
     'FormData',     // Web FormData API
     'Headers',      // Web Headers API
-    'Request',      // Web Request API
+    "",      // Web Request API
     'Response',     // Web Response API
     'EventTarget',  // Web EventTarget API
