[Survived] BlockStatement
helpers/guard/isTemporalInstant.ts:22:40
  * @since 2.0.0
  */
 export function isTemporalInstant(value: unknown): value is Temporal.Instant {
-  if (typeof Temporal !== 'undefined') {
-    return value instanceof Temporal.Instant;
-  }
+  if (typeof Temporal !== 'undefined') {}
   return (
     typeof value === 'object' &&
