[Survived] BlockStatement
helpers/license/isKnown.ts:24:47
  * // => false
  * @since 3.1.2
  */
-export function isKnown(raw: string): boolean {
-  for (const family of families(raw)) {
-    if (family !== UNKNOWN_FAMILY) return true;
-  }
-  return false;
-}
+export function isKnown(raw: string): boolean {}
 

[Survived] BlockStatement
helpers/license/isKnown.ts:25:39
  * @since 3.1.2
  */
 export function isKnown(raw: string): boolean {
-  for (const family of families(raw)) {
-    if (family !== UNKNOWN_FAMILY) return true;
-  }
+  for (const family of families(raw)) {}
   return false;
 }

[Survived] BooleanLiteral
helpers/license/isKnown.ts:26:43
  */
 export function isKnown(raw: string): boolean {
   for (const family of families(raw)) {
-    if (family !== UNKNOWN_FAMILY) return true;
+    if (family !== UNKNOWN_FAMILY) return false;
   }
   return false;

[Survived] EqualityOperator
helpers/license/isKnown.ts:26:9
  */
 export function isKnown(raw: string): boolean {
   for (const family of families(raw)) {
-    if (family !== UNKNOWN_FAMILY) return true;
+    if (family === UNKNOWN_FAMILY) return true;
   }
   return false;
