[Survived] BlockStatement
helpers/map/findKey.ts:20:18
 export function findKey<K, V>(
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
-): K | undefined {
-  for (const [key, value] of map) {
-    if (predicate(value, key)) return key;
-  }
-  return undefined;
-}
+): K | undefined {}
 

[Survived] BlockStatement
helpers/map/findKey.ts:21:35
   map: ReadonlyMap<K, V>,
   predicate: (value: V, key: K) => boolean,
 ): K | undefined {
-  for (const [key, value] of map) {
-    if (predicate(value, key)) return key;
-  }
+  for (const [key, value] of map) {}
   return undefined;
 }

[Survived] ConditionalExpression
helpers/map/findKey.ts:22:9
   predicate: (value: V, key: K) => boolean,
 ): K | undefined {
   for (const [key, value] of map) {
-    if (predicate(value, key)) return key;
+    if (false) return key;
   }
   return undefined;

[Survived] ConditionalExpression
helpers/map/findKey.ts:22:9
   predicate: (value: V, key: K) => boolean,
 ): K | undefined {
   for (const [key, value] of map) {
-    if (predicate(value, key)) return key;
+    if (true) return key;
   }
   return undefined;
