[Survived] BlockStatement
helpers/map/mapValues.ts:20:14
 export function mapValues<K, V, R>(
   map: ReadonlyMap<K, V>,
   fn: (value: V, key: K) => R,
-): Map<K, R> {
-  const result = new Map<K, R>();
-  for (const [key, value] of map) {
-    result.set(key, fn(value, key));
-  }
-  return result;
-}
+): Map<K, R> {}
 

[Survived] BlockStatement
helpers/map/mapValues.ts:22:35
   fn: (value: V, key: K) => R,
 ): Map<K, R> {
   const result = new Map<K, R>();
-  for (const [key, value] of map) {
-    result.set(key, fn(value, key));
-  }
+  for (const [key, value] of map) {}
   return result;
 }

[Survived] CallExpression
helpers/map/mapValues.ts:23:5
 ): Map<K, R> {
   const result = new Map<K, R>();
   for (const [key, value] of map) {
-    result.set(key, fn(value, key));
+    ;
   }
   return result;
