[Survived] BlockStatement
helpers/node/isSharedArrayBuffer.ts:22:81
  * isSharedArrayBuffer(null)                     // => false
  * @since 2.0.3
  */
-export function isSharedArrayBuffer(value: unknown): value is SharedArrayBuffer {
-  return typeof SharedArrayBuffer !== 'undefined' && value instanceof SharedArrayBuffer;
-}
+export function isSharedArrayBuffer(value: unknown): value is SharedArrayBuffer {}
 

[Survived] EqualityOperator
helpers/node/isSharedArrayBuffer.ts:23:10
  * @since 2.0.3
  */
 export function isSharedArrayBuffer(value: unknown): value is SharedArrayBuffer {
-  return typeof SharedArrayBuffer !== 'undefined' && value instanceof SharedArrayBuffer;
+  return typeof SharedArrayBuffer === 'undefined' && value instanceof SharedArrayBuffer;
 }
 

[Survived] ConditionalExpression
helpers/node/isSharedArrayBuffer.ts:23:10
  * @since 2.0.3
  */
 export function isSharedArrayBuffer(value: unknown): value is SharedArrayBuffer {
-  return typeof SharedArrayBuffer !== 'undefined' && value instanceof SharedArrayBuffer;
+  return true;
 }
 
