[Survived] BlockStatement
helpers/number/isPositive.ts:23:61
  * isPositive(NaN)      // => false
  * @since 2.0.0
  */
-export function isPositive(value: unknown): value is number {
-  return typeof value === 'number' && value > 0;
-}
+export function isPositive(value: unknown): value is number {}
 

[Survived] LogicalOperator
helpers/number/isPositive.ts:24:10
  * @since 2.0.0
  */
 export function isPositive(value: unknown): value is number {
-  return typeof value === 'number' && value > 0;
+  return typeof value === 'number' || value > 0;
 }
 

[Survived] ConditionalExpression
helpers/number/isPositive.ts:24:10
  * @since 2.0.0
  */
 export function isPositive(value: unknown): value is number {
-  return typeof value === 'number' && value > 0;
+  return true;
 }
 
