[Survived] BlockStatement
helpers/object/compact.ts:23:118
 export function compact<T extends Record<string, unknown>>(obj: T): Partial<T>;
 export function compact(obj: undefined): undefined;
 export function compact(obj: null): null;
-export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
-  const result: Partial<T> = {};
-  for (const key of Object.keys(obj) as (keyof T)[]) {
-    if (UNSAFE_KEYS.has(key as string)) continue;
-    if (obj[key]) {
-      result[key] = obj[key];
-    }
-  }
-  return result;
-}
+export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {}
 

[Killed] EqualityOperator
helpers/object/compact.ts:24:28
 export function compact(obj: undefined): undefined;
 export function compact(obj: null): null;
 export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (obj === undefined || obj !== null) return obj;
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
killedBy: compact — property-based all values in result are truthy
statusReason: Property failed after 1 tests
{ seed: 1257497618, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":false,"b":"","c":""}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BlockStatement
helpers/object/compact.ts:26:54
 export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {
   if (obj === undefined || obj === null) return obj;
   const result: Partial<T> = {};
-  for (const key of Object.keys(obj) as (keyof T)[]) {
-    if (UNSAFE_KEYS.has(key as string)) continue;
-    if (obj[key]) {
-      result[key] = obj[key];
-    }
-  }
+  for (const key of Object.keys(obj) as (keyof T)[]) {}
   return result;
 }

[Survived] ConditionalExpression
helpers/object/compact.ts:27:9
   if (obj === undefined || obj === null) return obj;
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
-    if (UNSAFE_KEYS.has(key as string)) continue;
+    if (true) continue;
     if (obj[key]) {
       result[key] = obj[key];

[Survived] ConditionalExpression
helpers/object/compact.ts:27:9
   if (obj === undefined || obj === null) return obj;
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
-    if (UNSAFE_KEYS.has(key as string)) continue;
+    if (false) continue;
     if (obj[key]) {
       result[key] = obj[key];

[Killed] ConditionalExpression
helpers/object/compact.ts:28:9
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
     if (UNSAFE_KEYS.has(key as string)) continue;
-    if (obj[key]) {
+    if (false) {
       result[key] = obj[key];
     }
killedBy: compact — contract removes all falsy values
statusReason: expected {} to deeply equal { b: 1, f: 'hello' }

[Killed] BlockStatement
helpers/object/compact.ts:28:19
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
     if (UNSAFE_KEYS.has(key as string)) continue;
-    if (obj[key]) {
-      result[key] = obj[key];
-    }
+    if (obj[key]) {}
   }
   return result;
killedBy: compact — contract removes all falsy values
statusReason: expected {} to deeply equal { b: 1, f: 'hello' }
