[Survived] BlockStatement
helpers/object/flatten.ts:9:107
 
 import { isPlainObject } from '../guard/isPlainObject.js';
 
-function flattenInto(obj: Record<string, unknown>, prefix: string, result: Record<string, unknown>): void {
-  for (const [key, value] of Object.entries(obj)) {
-    const path = prefix ? `${prefix}.${key}` : key;
-    if (isPlainObject(value) && Object.keys(value).length > 0) {
-      flattenInto(value, path, result);
-    } else {
-      result[path] = value;
-    }
-  }
-}
+function flattenInto(obj: Record<string, unknown>, prefix: string, result: Record<string, unknown>): void {}
 
 /**

[Survived] BlockStatement
helpers/object/flatten.ts:10:51
 import { isPlainObject } from '../guard/isPlainObject.js';
 
 function flattenInto(obj: Record<string, unknown>, prefix: string, result: Record<string, unknown>): void {
-  for (const [key, value] of Object.entries(obj)) {
-    const path = prefix ? `${prefix}.${key}` : key;
-    if (isPlainObject(value) && Object.keys(value).length > 0) {
-      flattenInto(value, path, result);
-    } else {
-      result[path] = value;
-    }
-  }
+  for (const [key, value] of Object.entries(obj)) {}
 }
 

[Survived] ConditionalExpression
helpers/object/flatten.ts:12:33
 function flattenInto(obj: Record<string, unknown>, prefix: string, result: Record<string, unknown>): void {
   for (const [key, value] of Object.entries(obj)) {
     const path = prefix ? `${prefix}.${key}` : key;
-    if (isPlainObject(value) && Object.keys(value).length > 0) {
+    if (isPlainObject(value) && true) {
       flattenInto(value, path, result);
     } else {

[Survived] BlockStatement
helpers/object/flatten.ts:12:64
 function flattenInto(obj: Record<string, unknown>, prefix: string, result: Record<string, unknown>): void {
   for (const [key, value] of Object.entries(obj)) {
     const path = prefix ? `${prefix}.${key}` : key;
-    if (isPlainObject(value) && Object.keys(value).length > 0) {
-      flattenInto(value, path, result);
-    } else {
+    if (isPlainObject(value) && Object.keys(value).length > 0) {} else {
       result[path] = value;
     }

[Survived] CallExpression
helpers/object/flatten.ts:13:7
   for (const [key, value] of Object.entries(obj)) {
     const path = prefix ? `${prefix}.${key}` : key;
     if (isPlainObject(value) && Object.keys(value).length > 0) {
-      flattenInto(value, path, result);
+      ;
     } else {
       result[path] = value;

[Survived] BlockStatement
helpers/object/flatten.ts:14:12
     const path = prefix ? `${prefix}.${key}` : key;
     if (isPlainObject(value) && Object.keys(value).length > 0) {
       flattenInto(value, path, result);
-    } else {
-      result[path] = value;
-    }
+    } else {}
   }
 }

[Survived] BlockStatement
helpers/object/flatten.ts:44:80
  * // => { a: [1, 2], b: Date }  (arrays and special objects stay as leaves)
  * @since 3.0.0
  */
-export function flatten(obj: Record<string, unknown>): Record<string, unknown> {
-  const result: Record<string, unknown> = {};
-  flattenInto(obj, '', result);
-  return result;
-}
+export function flatten(obj: Record<string, unknown>): Record<string, unknown> {}
 
