[Survived] BlockStatement
helpers/object/isEmpty.ts:24:90
  * isEmpty({ a: undefined }) // => false  (key exists)
  * @since 2.0.3
  */
-export function isEmpty(value: Record<PropertyKey, unknown> | null | undefined): boolean {
-  return value == null || Object.keys(value).length === 0;
-}
+export function isEmpty(value: Record<PropertyKey, unknown> | null | undefined): boolean {}
 

[Survived] ConditionalExpression
helpers/object/isEmpty.ts:25:10
  * @since 2.0.3
  */
 export function isEmpty(value: Record<PropertyKey, unknown> | null | undefined): boolean {
-  return value == null || Object.keys(value).length === 0;
+  return true;
 }
 

[Survived] EqualityOperator
helpers/object/isEmpty.ts:25:10
  * @since 2.0.3
  */
 export function isEmpty(value: Record<PropertyKey, unknown> | null | undefined): boolean {
-  return value == null || Object.keys(value).length === 0;
+  return value != null || Object.keys(value).length === 0;
 }
 
