[Survived] BlockStatement
helpers/object/mapDeep.ts:14:12
   value: unknown,
   mapValue?: (value: unknown, key: string) => unknown,
   mapKey?: (key: string, value: unknown) => PropertyKey,
-): unknown {
-  if (Array.isArray(value))
-    return value.map((item, index) => {
-      const recursed = transform(item, mapValue, mapKey);
-      return mapValue ? mapValue(recursed, String(index)) : recursed;
-    });
-  if (isPlainObject(value)) {
-    const result: Record<PropertyKey, unknown> = {};
-    for (const [key, val] of Object.entries(value)) {
-      const newKey = mapKey ? mapKey(key, val) : key;
-      if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
-      const recursed = transform(val, mapValue, mapKey);
-      result[newKey] = mapValue ? mapValue(recursed, key) : recursed;
-    }
-    return result;
-  }
-  return value;
-}
+): unknown {}
 
 /**

[Survived] ConditionalExpression
helpers/object/mapDeep.ts:15:7
   mapValue?: (value: unknown, key: string) => unknown,
   mapKey?: (key: string, value: unknown) => PropertyKey,
 ): unknown {
-  if (Array.isArray(value))
+  if (true)
     return value.map((item, index) => {
       const recursed = transform(item, mapValue, mapKey);

[Survived] ConditionalExpression
helpers/object/mapDeep.ts:15:7
   mapValue?: (value: unknown, key: string) => unknown,
   mapKey?: (key: string, value: unknown) => PropertyKey,
 ): unknown {
-  if (Array.isArray(value))
+  if (false)
     return value.map((item, index) => {
       const recursed = transform(item, mapValue, mapKey);

[Survived] BlockStatement
helpers/object/mapDeep.ts:16:39
   mapKey?: (key: string, value: unknown) => PropertyKey,
 ): unknown {
   if (Array.isArray(value))
-    return value.map((item, index) => {
-      const recursed = transform(item, mapValue, mapKey);
-      return mapValue ? mapValue(recursed, String(index)) : recursed;
-    });
+    return value.map((item, index) => {});
   if (isPlainObject(value)) {
     const result: Record<PropertyKey, unknown> = {};

[Survived] BlockStatement
helpers/object/mapDeep.ts:20:29
       const recursed = transform(item, mapValue, mapKey);
       return mapValue ? mapValue(recursed, String(index)) : recursed;
     });
-  if (isPlainObject(value)) {
-    const result: Record<PropertyKey, unknown> = {};
-    for (const [key, val] of Object.entries(value)) {
-      const newKey = mapKey ? mapKey(key, val) : key;
-      if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
-      const recursed = transform(val, mapValue, mapKey);
-      result[newKey] = mapValue ? mapValue(recursed, key) : recursed;
-    }
-    return result;
-  }
+  if (isPlainObject(value)) {}
   return value;
 }

[Survived] ConditionalExpression
helpers/object/mapDeep.ts:20:7
       const recursed = transform(item, mapValue, mapKey);
       return mapValue ? mapValue(recursed, String(index)) : recursed;
     });
-  if (isPlainObject(value)) {
+  if (true) {
     const result: Record<PropertyKey, unknown> = {};
     for (const [key, val] of Object.entries(value)) {

[Survived] BlockStatement
helpers/object/mapDeep.ts:22:53
     });
   if (isPlainObject(value)) {
     const result: Record<PropertyKey, unknown> = {};
-    for (const [key, val] of Object.entries(value)) {
-      const newKey = mapKey ? mapKey(key, val) : key;
-      if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
-      const recursed = transform(val, mapValue, mapKey);
-      result[newKey] = mapValue ? mapValue(recursed, key) : recursed;
-    }
+    for (const [key, val] of Object.entries(value)) {}
     return result;
   }

[Survived] EqualityOperator
helpers/object/mapDeep.ts:24:11
     const result: Record<PropertyKey, unknown> = {};
     for (const [key, val] of Object.entries(value)) {
       const newKey = mapKey ? mapKey(key, val) : key;
-      if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
+      if (typeof newKey !== 'string' && UNSAFE_KEYS.has(newKey)) continue;
       const recursed = transform(val, mapValue, mapKey);
       result[newKey] = mapValue ? mapValue(recursed, key) : recursed;

[Survived] LogicalOperator
helpers/object/mapDeep.ts:24:11
     const result: Record<PropertyKey, unknown> = {};
     for (const [key, val] of Object.entries(value)) {
       const newKey = mapKey ? mapKey(key, val) : key;
-      if (typeof newKey === 'string' && UNSAFE_KEYS.has(newKey)) continue;
+      if (typeof newKey === 'string' || UNSAFE_KEYS.has(newKey)) continue;
       const recursed = transform(val, mapValue, mapKey);
       result[newKey] = mapValue ? mapValue(recursed, key) : recursed;

[Survived] BlockStatement
helpers/object/mapDeep.ts:70:6
   obj: T,
   mapValue?: (value: unknown, key: string) => unknown,
   mapKey?: (key: string, value: unknown) => PropertyKey,
-): T {
-  return transform(obj, mapValue, mapKey) as T;
-}
+): T {}
 
