[Survived] BlockStatement
helpers/object/parsePropertyPath.ts:42:79
  * parsePropertyPath('a..b')        // => ['a', '', 'b']   (empty segment preserved)
  * @since 3.0.0
  */
-export function parsePropertyPath(path: string): readonly (string | number)[] {
-  const cached = pathCache.get(path);
-  if (cached !== undefined) return cached;
-
-  const result = Object.freeze(parseUncached(path));
-
-  // MAX_CACHE_SIZE is a fixed positive constant, so size >= MAX_CACHE_SIZE always
-  // implies the cache is non-empty — the iterator's first key is never undefined here.
-  if (pathCache.size >= MAX_CACHE_SIZE) {
-    pathCache.delete(pathCache.keys().next().value!);
-  }
-  pathCache.set(path, result);
-
-  return result;
-}
+export function parsePropertyPath(path: string): readonly (string | number)[] {}
 
 function parseUncached(path: string): (string | number)[] {

[Survived] ConditionalExpression
helpers/object/parsePropertyPath.ts:44:7
  */
 export function parsePropertyPath(path: string): readonly (string | number)[] {
   const cached = pathCache.get(path);
-  if (cached !== undefined) return cached;
+  if (false) return cached;
 
   const result = Object.freeze(parseUncached(path));

[Survived] EqualityOperator
helpers/object/parsePropertyPath.ts:44:7
  */
 export function parsePropertyPath(path: string): readonly (string | number)[] {
   const cached = pathCache.get(path);
-  if (cached !== undefined) return cached;
+  if (cached === undefined) return cached;
 
   const result = Object.freeze(parseUncached(path));

[Survived] ConditionalExpression
helpers/object/parsePropertyPath.ts:50:7
 
   // MAX_CACHE_SIZE is a fixed positive constant, so size >= MAX_CACHE_SIZE always
   // implies the cache is non-empty — the iterator's first key is never undefined here.
-  if (pathCache.size >= MAX_CACHE_SIZE) {
+  if (true) {
     pathCache.delete(pathCache.keys().next().value!);
   }

[Survived] EqualityOperator
helpers/object/parsePropertyPath.ts:50:7
 
   // MAX_CACHE_SIZE is a fixed positive constant, so size >= MAX_CACHE_SIZE always
   // implies the cache is non-empty — the iterator's first key is never undefined here.
-  if (pathCache.size >= MAX_CACHE_SIZE) {
+  if (pathCache.size < MAX_CACHE_SIZE) {
     pathCache.delete(pathCache.keys().next().value!);
   }

[Survived] CallExpression
helpers/object/parsePropertyPath.ts:51:5
   // MAX_CACHE_SIZE is a fixed positive constant, so size >= MAX_CACHE_SIZE always
   // implies the cache is non-empty — the iterator's first key is never undefined here.
   if (pathCache.size >= MAX_CACHE_SIZE) {
-    pathCache.delete(pathCache.keys().next().value!);
+    ;
   }
   pathCache.set(path, result);

[Survived] CallExpression
helpers/object/parsePropertyPath.ts:53:3
   if (pathCache.size >= MAX_CACHE_SIZE) {
     pathCache.delete(pathCache.keys().next().value!);
   }
-  pathCache.set(path, result);
+  ;
 
   return result;

[Survived] ConditionalExpression
helpers/object/parsePropertyPath.ts:59:7
 }
 
 function parseUncached(path: string): (string | number)[] {
-  if (path === '') return [''];
+  if (false) return [''];
   if (path[0] === '.') path = path.slice(1);
   if (path === '') return [''];

[Survived] EqualityOperator
helpers/object/parsePropertyPath.ts:59:7
 }
 
 function parseUncached(path: string): (string | number)[] {
-  if (path === '') return [''];
+  if (path !== '') return [''];
   if (path[0] === '.') path = path.slice(1);
   if (path === '') return [''];

[Survived] MethodExpression
helpers/object/parsePropertyPath.ts:60:31
 
 function parseUncached(path: string): (string | number)[] {
   if (path === '') return [''];
-  if (path[0] === '.') path = path.slice(1);
+  if (path[0] === '.') path = path;
   if (path === '') return [''];
   const result: (string | number)[] = [];

[Survived] EqualityOperator
helpers/object/parsePropertyPath.ts:60:7
 
 function parseUncached(path: string): (string | number)[] {
   if (path === '') return [''];
-  if (path[0] === '.') path = path.slice(1);
+  if (path[0] !== '.') path = path.slice(1);
   if (path === '') return [''];
   const result: (string | number)[] = [];

[Survived] EqualityOperator
helpers/object/parsePropertyPath.ts:61:7
 function parseUncached(path: string): (string | number)[] {
   if (path === '') return [''];
   if (path[0] === '.') path = path.slice(1);
-  if (path === '') return [''];
+  if (path !== '') return [''];
   const result: (string | number)[] = [];
   // Split on `.` first so consecutive dots produce empty segments, then parse `[n]` within each.

[Survived] ConditionalExpression
helpers/object/parsePropertyPath.ts:61:7
 function parseUncached(path: string): (string | number)[] {
   if (path === '') return [''];
   if (path[0] === '.') path = path.slice(1);
-  if (path === '') return [''];
+  if (false) return [''];
   const result: (string | number)[] = [];
   // Split on `.` first so consecutive dots produce empty segments, then parse `[n]` within each.

[Survived] BlockStatement
helpers/object/parsePropertyPath.ts:64:45
   if (path === '') return [''];
   const result: (string | number)[] = [];
   // Split on `.` first so consecutive dots produce empty segments, then parse `[n]` within each.
-  for (const dotSegment of path.split('.')) {
-    BRACKET.lastIndex = 0;
-    let last = 0;
-    let match: RegExpExecArray | null;
-    while ((match = BRACKET.exec(dotSegment)) !== null) {
-      // String prefix before this [n] — omit only when the segment starts with '['.
-      if (match.index > last) result.push(dotSegment.slice(last, match.index));
-      result.push(parseInt(match[1], 10));
-      last = BRACKET.lastIndex;
-    }
-    if (last === 0) {
-      // No brackets found — push the whole dot-segment as a string key.
-      result.push(dotSegment);
-    } else if (last < dotSegment.length) {
-      // Trailing non-bracket text after the last ']' (e.g. 'a[0]b') — ambiguous and
-      // almost always a mistake. Throw rather than silently drop 'b'.
-      throw new RangeError(
-        `parsePropertyPath: non-bracket text '${dotSegment.slice(last)}' after ']' in segment '${dotSegment}' — use 'a[0].b' instead of 'a[0]b'`,
-      );
-    }
-    // last === dotSegment.length: segment ended right after the last ']', nothing to push.
-  }
+  for (const dotSegment of path.split('.')) {}
   return result;
 }

[Survived] BlockStatement
helpers/object/parsePropertyPath.ts:68:57
     BRACKET.lastIndex = 0;
     let last = 0;
     let match: RegExpExecArray | null;
-    while ((match = BRACKET.exec(dotSegment)) !== null) {
-      // String prefix before this [n] — omit only when the segment starts with '['.
-      if (match.index > last) result.push(dotSegment.slice(last, match.index));
-      result.push(parseInt(match[1], 10));
-      last = BRACKET.lastIndex;
-    }
+    while ((match = BRACKET.exec(dotSegment)) !== null) {}
     if (last === 0) {
       // No brackets found — push the whole dot-segment as a string key.

[Survived] EqualityOperator
helpers/object/parsePropertyPath.ts:68:12
     BRACKET.lastIndex = 0;
     let last = 0;
     let match: RegExpExecArray | null;
-    while ((match = BRACKET.exec(dotSegment)) !== null) {
+    while ((match = BRACKET.exec(dotSegment)) === null) {
       // String prefix before this [n] — omit only when the segment starts with '['.
       if (match.index > last) result.push(dotSegment.slice(last, match.index));

[Survived] ConditionalExpression
helpers/object/parsePropertyPath.ts:70:11
     let match: RegExpExecArray | null;
     while ((match = BRACKET.exec(dotSegment)) !== null) {
       // String prefix before this [n] — omit only when the segment starts with '['.
-      if (match.index > last) result.push(dotSegment.slice(last, match.index));
+      if (true) result.push(dotSegment.slice(last, match.index));
       result.push(parseInt(match[1], 10));
       last = BRACKET.lastIndex;

[Survived] EqualityOperator
helpers/object/parsePropertyPath.ts:70:11
     let match: RegExpExecArray | null;
     while ((match = BRACKET.exec(dotSegment)) !== null) {
       // String prefix before this [n] — omit only when the segment starts with '['.
-      if (match.index > last) result.push(dotSegment.slice(last, match.index));
+      if (match.index <= last) result.push(dotSegment.slice(last, match.index));
       result.push(parseInt(match[1], 10));
       last = BRACKET.lastIndex;

[Survived] CallExpression
helpers/object/parsePropertyPath.ts:71:7
     while ((match = BRACKET.exec(dotSegment)) !== null) {
       // String prefix before this [n] — omit only when the segment starts with '['.
       if (match.index > last) result.push(dotSegment.slice(last, match.index));
-      result.push(parseInt(match[1], 10));
+      ;
       last = BRACKET.lastIndex;
     }

[Survived] EqualityOperator
helpers/object/parsePropertyPath.ts:74:9
       result.push(parseInt(match[1], 10));
       last = BRACKET.lastIndex;
     }
-    if (last === 0) {
+    if (last !== 0) {
       // No brackets found — push the whole dot-segment as a string key.
       result.push(dotSegment);

[Survived] ConditionalExpression
helpers/object/parsePropertyPath.ts:74:9
       result.push(parseInt(match[1], 10));
       last = BRACKET.lastIndex;
     }
-    if (last === 0) {
+    if (false) {
       // No brackets found — push the whole dot-segment as a string key.
       result.push(dotSegment);

[Survived] CallExpression
helpers/object/parsePropertyPath.ts:76:7
     }
     if (last === 0) {
       // No brackets found — push the whole dot-segment as a string key.
-      result.push(dotSegment);
+      ;
     } else if (last < dotSegment.length) {
       // Trailing non-bracket text after the last ']' (e.g. 'a[0]b') — ambiguous and

[Survived] ConditionalExpression
helpers/object/parsePropertyPath.ts:77:16
     if (last === 0) {
       // No brackets found — push the whole dot-segment as a string key.
       result.push(dotSegment);
-    } else if (last < dotSegment.length) {
+    } else if (false) {
       // Trailing non-bracket text after the last ']' (e.g. 'a[0]b') — ambiguous and
       // almost always a mistake. Throw rather than silently drop 'b'.

[Survived] BlockStatement
helpers/object/parsePropertyPath.ts:77:42
     if (last === 0) {
       // No brackets found — push the whole dot-segment as a string key.
       result.push(dotSegment);
-    } else if (last < dotSegment.length) {
-      // Trailing non-bracket text after the last ']' (e.g. 'a[0]b') — ambiguous and
-      // almost always a mistake. Throw rather than silently drop 'b'.
-      throw new RangeError(
-        `parsePropertyPath: non-bracket text '${dotSegment.slice(last)}' after ']' in segment '${dotSegment}' — use 'a[0].b' instead of 'a[0]b'`,
-      );
-    }
+    } else if (last < dotSegment.length) {}
     // last === dotSegment.length: segment ended right after the last ']', nothing to push.
   }

[Survived] MethodExpression
helpers/object/parsePropertyPath.ts:81:49
       // Trailing non-bracket text after the last ']' (e.g. 'a[0]b') — ambiguous and
       // almost always a mistake. Throw rather than silently drop 'b'.
       throw new RangeError(
-        `parsePropertyPath: non-bracket text '${dotSegment.slice(last)}' after ']' in segment '${dotSegment}' — use 'a[0].b' instead of 'a[0]b'`,
+        `parsePropertyPath: non-bracket text '${dotSegment}' after ']' in segment '${dotSegment}' — use 'a[0].b' instead of 'a[0]b'`,
       );
     }
