[Survived] BlockStatement
helpers/object/sortKeys.ts:29:6
 export function sortKeys<T extends Record<string, unknown>>(
   obj: T,
   compareFn?: (a: string, b: string) => number,
-): T {
-  const sortedKeys = Object.keys(obj).toSorted(compareFn);
-  const result = {} as T;
-  for (const key of sortedKeys) {
-    if (UNSAFE_KEYS.has(key)) continue;
-    result[key as keyof T] = obj[key as keyof T];
-  }
-  return result;
-}
+): T {}
 

[Survived] BlockStatement
helpers/object/sortKeys.ts:32:33
 ): T {
   const sortedKeys = Object.keys(obj).toSorted(compareFn);
   const result = {} as T;
-  for (const key of sortedKeys) {
-    if (UNSAFE_KEYS.has(key)) continue;
-    result[key as keyof T] = obj[key as keyof T];
-  }
+  for (const key of sortedKeys) {}
   return result;
 }

[Survived] ConditionalExpression
helpers/object/sortKeys.ts:33:9
   const sortedKeys = Object.keys(obj).toSorted(compareFn);
   const result = {} as T;
   for (const key of sortedKeys) {
-    if (UNSAFE_KEYS.has(key)) continue;
+    if (false) continue;
     result[key as keyof T] = obj[key as keyof T];
   }

[Survived] ConditionalExpression
helpers/object/sortKeys.ts:33:9
   const sortedKeys = Object.keys(obj).toSorted(compareFn);
   const result = {} as T;
   for (const key of sortedKeys) {
-    if (UNSAFE_KEYS.has(key)) continue;
+    if (true) continue;
     result[key as keyof T] = obj[key as keyof T];
   }
