[Survived] BlockStatement
helpers/object/update.ts:47:11
   obj: object,
   path: string | PropertyKey[],
   updater: (current: unknown) => unknown,
-): object {
-  const current = get(obj, path);
-  return set(obj, path, updater(current));
-}
+): object {}
 
