[Killed] CallExpression
helpers/promise/consoleLogPromise.ts:15:9
  */
 export function consoleLogPromise<T>(prefix?: string): (data: T) => T {
     return (data: T) => {
-        console.log(prefix, data);
+        ;
         return data;
     };
killedBy: consoleLogPromise logs undefined
statusReason: expected "log" to be called with arguments: [ Array(2) ]

Number of calls: 0
