[Survived] CallExpression
helpers/promise/delay.ts:16:5
  */
 export function delay<T = void>(ms: number, value?: T): Promise<T> {
   return new Promise(resolve => {
-    setTimeout(() => resolve(value as T), ms);
+    ;
   });
 }
