[Survived] BlockStatement
helpers/promise/parallel.ts:27:17
 export async function parallel<T>(
   functions: readonly (() => Promise<T>)[],
   limit: number,
-): Promise<T[]> {
-  const results: T[] = [];
-  const clampedLimit =
-    limit === Number.POSITIVE_INFINITY
-      ? functions.length
-      : Number.isFinite(limit)
-        ? Math.max(1, Math.floor(limit))
-        : 1;
-  let nextIndex = 0;
-
-  async function runNext(): Promise<void> {
-    if (nextIndex >= functions.length) return;
-    const currentIndex = nextIndex++;
-    results[currentIndex] = await functions[currentIndex]();
-    return runNext();
-  }
-
-  const workers = Array.from(
-    { length: Math.min(clampedLimit, functions.length) },
-    () => runNext(),
-  );
-
-  await Promise.all(workers);
-  return results;
-}
+): Promise<T[]> {}
 

[Survived] ConditionalExpression
helpers/promise/parallel.ts:30:5
 ): Promise<T[]> {
   const results: T[] = [];
   const clampedLimit =
-    limit === Number.POSITIVE_INFINITY
+    true
       ? functions.length
       : Number.isFinite(limit)

[Survived] EqualityOperator
helpers/promise/parallel.ts:30:5
 ): Promise<T[]> {
   const results: T[] = [];
   const clampedLimit =
-    limit === Number.POSITIVE_INFINITY
+    limit !== Number.POSITIVE_INFINITY
       ? functions.length
       : Number.isFinite(limit)

[Survived] MethodExpression
helpers/promise/parallel.ts:33:11
     limit === Number.POSITIVE_INFINITY
       ? functions.length
       : Number.isFinite(limit)
-        ? Math.max(1, Math.floor(limit))
+        ? Math.min(1, Math.floor(limit))
         : 1;
   let nextIndex = 0;

[Survived] ObjectLiteral
helpers/promise/parallel.ts:45:5
   }
 
   const workers = Array.from(
-    { length: Math.min(clampedLimit, functions.length) },
+    {},
     () => runNext(),
   );
