[Survived] BlockStatement
helpers/set/toMapByKey.ts:22:87
  * // => Map(2) { 'a' => { id: 'a' }, 'b' => { id: 'b' } }
  * @since 3.0.3
  */
-export function toMapByKey<T, K>(set: ReadonlySet<T>, fn: (value: T) => K): Map<K, T> {
-  const result = new Map<K, T>();
-  for (const value of set) {
-    result.set(fn(value), value);
-  }
-  return result;
-}
+export function toMapByKey<T, K>(set: ReadonlySet<T>, fn: (value: T) => K): Map<K, T> {}
 

[Survived] BlockStatement
helpers/set/toMapByKey.ts:24:28
  */
 export function toMapByKey<T, K>(set: ReadonlySet<T>, fn: (value: T) => K): Map<K, T> {
   const result = new Map<K, T>();
-  for (const value of set) {
-    result.set(fn(value), value);
-  }
+  for (const value of set) {}
   return result;
 }

[Survived] CallExpression
helpers/set/toMapByKey.ts:25:5
 export function toMapByKey<T, K>(set: ReadonlySet<T>, fn: (value: T) => K): Map<K, T> {
   const result = new Map<K, T>();
   for (const value of set) {
-    result.set(fn(value), value);
+    ;
   }
   return result;
