[Survived] BlockStatement
helpers/string/dedent.ts:27:45
  * dedent('  a\n  b') // => 'a\nb'
  * @since 3.0.0
  */
-export function dedent(str: string): string {
-  const lines = str.split('\n');
-
-  // Drop a single leading/trailing blank line — the ones that immediately
-  // follow/precede the opening/closing backtick of a template literal.
-  if (lines.length > 1 && lines[0]!.trim() === '') lines.shift();
-  if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') lines.pop();
-
-  const indents = lines
-    .filter((line) => line.trim() !== '')
-    .map((line) => line.length - line.trimStart().length);
-  const minIndent = indents.length > 0 ? Math.min(...indents) : 0;
-
-  return lines.map((line) => line.slice(minIndent)).join('\n');
-}
+export function dedent(str: string): string {}
 

[Survived] StringLiteral
helpers/string/dedent.ts:28:27
  * @since 3.0.0
  */
 export function dedent(str: string): string {
-  const lines = str.split('\n');
+  const lines = str.split("");
 
   // Drop a single leading/trailing blank line — the ones that immediately

[Survived] CallExpression
helpers/string/dedent.ts:32:52
 
   // Drop a single leading/trailing blank line — the ones that immediately
   // follow/precede the opening/closing backtick of a template literal.
-  if (lines.length > 1 && lines[0]!.trim() === '') lines.shift();
+  if (lines.length > 1 && lines[0]!.trim() === '') ;
   if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') lines.pop();
 

[Survived] MethodExpression
helpers/string/dedent.ts:32:27
 
   // Drop a single leading/trailing blank line — the ones that immediately
   // follow/precede the opening/closing backtick of a template literal.
-  if (lines.length > 1 && lines[0]!.trim() === '') lines.shift();
+  if (lines.length > 1 && lines[0]! === '') lines.shift();
   if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') lines.pop();
 

[Survived] CallExpression
helpers/string/dedent.ts:33:67
   // Drop a single leading/trailing blank line — the ones that immediately
   // follow/precede the opening/closing backtick of a template literal.
   if (lines.length > 1 && lines[0]!.trim() === '') lines.shift();
-  if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') lines.pop();
+  if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') ;
 
   const indents = lines

[Survived] ConditionalExpression
helpers/string/dedent.ts:33:7
   // Drop a single leading/trailing blank line — the ones that immediately
   // follow/precede the opening/closing backtick of a template literal.
   if (lines.length > 1 && lines[0]!.trim() === '') lines.shift();
-  if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') lines.pop();
+  if (true) lines.pop();
 
   const indents = lines

[Survived] MethodExpression
helpers/string/dedent.ts:35:19
   if (lines.length > 1 && lines[0]!.trim() === '') lines.shift();
   if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') lines.pop();
 
-  const indents = lines
-    .filter((line) => line.trim() !== '')
+  const indents = lines
     .map((line) => line.length - line.trimStart().length);
   const minIndent = indents.length > 0 ? Math.min(...indents) : 0;

[Survived] ArrowFunction
helpers/string/dedent.ts:36:13
   if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') lines.pop();
 
   const indents = lines
-    .filter((line) => line.trim() !== '')
+    .filter(() => undefined)
     .map((line) => line.length - line.trimStart().length);
   const minIndent = indents.length > 0 ? Math.min(...indents) : 0;

[Survived] MethodExpression
helpers/string/dedent.ts:36:23
   if (lines.length > 1 && lines[lines.length - 1]!.trim() === '') lines.pop();
 
   const indents = lines
-    .filter((line) => line.trim() !== '')
+    .filter((line) => line !== '')
     .map((line) => line.length - line.trimStart().length);
   const minIndent = indents.length > 0 ? Math.min(...indents) : 0;

[Survived] ArithmeticOperator
helpers/string/dedent.ts:37:20
 
   const indents = lines
     .filter((line) => line.trim() !== '')
-    .map((line) => line.length - line.trimStart().length);
+    .map((line) => line.length + line.trimStart().length);
   const minIndent = indents.length > 0 ? Math.min(...indents) : 0;
 

[Survived] MethodExpression
helpers/string/dedent.ts:37:34
 
   const indents = lines
     .filter((line) => line.trim() !== '')
-    .map((line) => line.length - line.trimStart().length);
+    .map((line) => line.length - line.trimEnd().length);
   const minIndent = indents.length > 0 ? Math.min(...indents) : 0;
 

[Survived] ConditionalExpression
helpers/string/dedent.ts:38:21
   const indents = lines
     .filter((line) => line.trim() !== '')
     .map((line) => line.length - line.trimStart().length);
-  const minIndent = indents.length > 0 ? Math.min(...indents) : 0;
+  const minIndent = false ? Math.min(...indents) : 0;
 
   return lines.map((line) => line.slice(minIndent)).join('\n');

[Survived] EqualityOperator
helpers/string/dedent.ts:38:21
   const indents = lines
     .filter((line) => line.trim() !== '')
     .map((line) => line.length - line.trimStart().length);
-  const minIndent = indents.length > 0 ? Math.min(...indents) : 0;
+  const minIndent = indents.length <= 0 ? Math.min(...indents) : 0;
 
   return lines.map((line) => line.slice(minIndent)).join('\n');

[Survived] ArrowFunction
helpers/string/dedent.ts:40:20
     .map((line) => line.length - line.trimStart().length);
   const minIndent = indents.length > 0 ? Math.min(...indents) : 0;
 
-  return lines.map((line) => line.slice(minIndent)).join('\n');
+  return lines.map(() => undefined).join('\n');
 }
 

[Survived] MethodExpression
helpers/string/dedent.ts:40:30
     .map((line) => line.length - line.trimStart().length);
   const minIndent = indents.length > 0 ? Math.min(...indents) : 0;
 
-  return lines.map((line) => line.slice(minIndent)).join('\n');
+  return lines.map((line) => line).join('\n');
 }
 
