[Survived] BlockStatement
helpers/string/isBlank.ts:34:68
  * isBlank(' x ')     // => false
  * @since 2.0.3
  */
-export function isBlank(value: string | null | undefined): boolean {
-  return value == null || value.trim() === '';
-}
+export function isBlank(value: string | null | undefined): boolean {}
 

[Survived] MethodExpression
helpers/string/isBlank.ts:35:27
  * @since 2.0.3
  */
 export function isBlank(value: string | null | undefined): boolean {
-  return value == null || value.trim() === '';
+  return value == null || value === '';
 }
 

[Survived] ConditionalExpression
helpers/string/isBlank.ts:35:10
  * @since 2.0.3
  */
 export function isBlank(value: string | null | undefined): boolean {
-  return value == null || value.trim() === '';
+  return true;
 }
 
