[Survived] BlockStatement
helpers/string/kebabCase.ts:22:86
 export function kebabCase(str: string): string;
 export function kebabCase(str: undefined): undefined;
 export function kebabCase(str: null): null;
-export function kebabCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
-  const words = str
-    .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
-    .split(/[\s_-]+/)
-    .filter(Boolean);
-  return words.join('-').toLowerCase();
-}
+export function kebabCase(str: string | undefined | null): string | undefined | null {}
 

[Survived] ConditionalExpression
helpers/string/kebabCase.ts:23:28
 export function kebabCase(str: undefined): undefined;
 export function kebabCase(str: null): null;
 export function kebabCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (str === undefined || false) return str;
   const words = str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')

[Survived] ConditionalExpression
helpers/string/kebabCase.ts:23:7
 export function kebabCase(str: undefined): undefined;
 export function kebabCase(str: null): null;
 export function kebabCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (true) return str;
   const words = str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')

[Survived] Regex
helpers/string/kebabCase.ts:25:14
 export function kebabCase(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
   const words = str
-    .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
+    .replace(/([a-z0-9])([^A-Z])/g, '$1 $2')
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
     .split(/[\s_-]+/)

[Survived] Regex
helpers/string/kebabCase.ts:26:14
   if (str === undefined || str === null) return str;
   const words = str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
+    .replace(/([A-Z])([A-Z][^a-z])/g, '$1 $2')
     .split(/[\s_-]+/)
     .filter(Boolean);

[Survived] MethodExpression
helpers/string/kebabCase.ts:29:10
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
     .split(/[\s_-]+/)
     .filter(Boolean);
-  return words.join('-').toLowerCase();
+  return words.join('-').toUpperCase();
 }
 
