[Survived] BlockStatement
helpers/string/trimStart.ts:44:30
 export function trimStart(
   input: string | null | undefined,
   mode: TrimMode = 'whitespace',
-): string | null | undefined {
-  if (input == null) return input;
-  if (mode === 'whitespace') return input.trimStart();
-  assertValidTrimMode(mode, 'trimStart');
-  return input.replace(TRIM_START_REGEX[mode], '');
-}
+): string | null | undefined {}
 

[Survived] ConditionalExpression
helpers/string/trimStart.ts:45:7
   input: string | null | undefined,
   mode: TrimMode = 'whitespace',
 ): string | null | undefined {
-  if (input == null) return input;
+  if (true) return input;
   if (mode === 'whitespace') return input.trimStart();
   assertValidTrimMode(mode, 'trimStart');

[Survived] EqualityOperator
helpers/string/trimStart.ts:46:7
   mode: TrimMode = 'whitespace',
 ): string | null | undefined {
   if (input == null) return input;
-  if (mode === 'whitespace') return input.trimStart();
+  if (mode !== 'whitespace') return input.trimStart();
   assertValidTrimMode(mode, 'trimStart');
   return input.replace(TRIM_START_REGEX[mode], '');

[Survived] ConditionalExpression
helpers/string/trimStart.ts:46:7
   mode: TrimMode = 'whitespace',
 ): string | null | undefined {
   if (input == null) return input;
-  if (mode === 'whitespace') return input.trimStart();
+  if (true) return input.trimStart();
   assertValidTrimMode(mode, 'trimStart');
   return input.replace(TRIM_START_REGEX[mode], '');

[Survived] StringLiteral
helpers/string/trimStart.ts:47:29
 ): string | null | undefined {
   if (input == null) return input;
   if (mode === 'whitespace') return input.trimStart();
-  assertValidTrimMode(mode, 'trimStart');
+  assertValidTrimMode(mode, "");
   return input.replace(TRIM_START_REGEX[mode], '');
 }
