[Survived] BlockStatement
helpers/string/words.ts:28:65
  * words(null);                 // []
  * @since 2.0.0
  */
-export function words(str: string | null | undefined): string[] {
-  if (str == null) return [];
-  return (
-    str
-      // Insert boundary before uppercase following lowercase or digit: camelCase → camel Case
-      .replace(/([a-z\d])([A-Z])/g, '$1 $2')
-      // Insert boundary between consecutive uppercase and following title-case: XMLParser → XML Parser
-      .replace(/([A-Z]+)([A-Z][a-z])/g, '$1 $2')
-      // Insert boundary between letters and digits
-      .replace(/([a-zA-Z])(\d)/g, '$1 $2')
-      .replace(/(\d)([a-zA-Z])/g, '$1 $2')
-      // Extract word tokens (alphanumeric sequences)
-      .match(/[a-zA-Z\d]+/g) ?? []
-  );
-}
+export function words(str: string | null | undefined): string[] {}
 

[Survived] ConditionalExpression
helpers/string/words.ts:29:7
  * @since 2.0.0
  */
 export function words(str: string | null | undefined): string[] {
-  if (str == null) return [];
+  if (true) return [];
   return (
     str

[Survived] EqualityOperator
helpers/string/words.ts:29:7
  * @since 2.0.0
  */
 export function words(str: string | null | undefined): string[] {
-  if (str == null) return [];
+  if (str != null) return [];
   return (
     str

[Survived] Regex
helpers/string/words.ts:33:16
   return (
     str
       // Insert boundary before uppercase following lowercase or digit: camelCase → camel Case
-      .replace(/([a-z\d])([A-Z])/g, '$1 $2')
+      .replace(/([a-z\D])([A-Z])/g, '$1 $2')
       // Insert boundary between consecutive uppercase and following title-case: XMLParser → XML Parser
       .replace(/([A-Z]+)([A-Z][a-z])/g, '$1 $2')

[Survived] Regex
helpers/string/words.ts:35:16
       // Insert boundary before uppercase following lowercase or digit: camelCase → camel Case
       .replace(/([a-z\d])([A-Z])/g, '$1 $2')
       // Insert boundary between consecutive uppercase and following title-case: XMLParser → XML Parser
-      .replace(/([A-Z]+)([A-Z][a-z])/g, '$1 $2')
+      .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
       // Insert boundary between letters and digits
       .replace(/([a-zA-Z])(\d)/g, '$1 $2')

[Survived] StringLiteral
helpers/string/words.ts:35:41
       // Insert boundary before uppercase following lowercase or digit: camelCase → camel Case
       .replace(/([a-z\d])([A-Z])/g, '$1 $2')
       // Insert boundary between consecutive uppercase and following title-case: XMLParser → XML Parser
-      .replace(/([A-Z]+)([A-Z][a-z])/g, '$1 $2')
+      .replace(/([A-Z]+)([A-Z][a-z])/g, "")
       // Insert boundary between letters and digits
       .replace(/([a-zA-Z])(\d)/g, '$1 $2')

[Survived] Regex
helpers/string/words.ts:37:16
       // Insert boundary between consecutive uppercase and following title-case: XMLParser → XML Parser
       .replace(/([A-Z]+)([A-Z][a-z])/g, '$1 $2')
       // Insert boundary between letters and digits
-      .replace(/([a-zA-Z])(\d)/g, '$1 $2')
+      .replace(/([^a-zA-Z])(\d)/g, '$1 $2')
       .replace(/(\d)([a-zA-Z])/g, '$1 $2')
       // Extract word tokens (alphanumeric sequences)

[Survived] StringLiteral
helpers/string/words.ts:38:35
       .replace(/([A-Z]+)([A-Z][a-z])/g, '$1 $2')
       // Insert boundary between letters and digits
       .replace(/([a-zA-Z])(\d)/g, '$1 $2')
-      .replace(/(\d)([a-zA-Z])/g, '$1 $2')
+      .replace(/(\d)([a-zA-Z])/g, "")
       // Extract word tokens (alphanumeric sequences)
       .match(/[a-zA-Z\d]+/g) ?? []

[Survived] Regex
helpers/string/words.ts:38:16
       .replace(/([A-Z]+)([A-Z][a-z])/g, '$1 $2')
       // Insert boundary between letters and digits
       .replace(/([a-zA-Z])(\d)/g, '$1 $2')
-      .replace(/(\d)([a-zA-Z])/g, '$1 $2')
+      .replace(/(\d)([^a-zA-Z])/g, '$1 $2')
       // Extract word tokens (alphanumeric sequences)
       .match(/[a-zA-Z\d]+/g) ?? []

[Survived] Regex
helpers/string/words.ts:40:14
       .replace(/([a-zA-Z])(\d)/g, '$1 $2')
       .replace(/(\d)([a-zA-Z])/g, '$1 $2')
       // Extract word tokens (alphanumeric sequences)
-      .match(/[a-zA-Z\d]+/g) ?? []
+      .match(/[^a-zA-Z\d]+/g) ?? []
   );
 }

[Survived] Regex
helpers/string/words.ts:40:14
       .replace(/([a-zA-Z])(\d)/g, '$1 $2')
       .replace(/(\d)([a-zA-Z])/g, '$1 $2')
       // Extract word tokens (alphanumeric sequences)
-      .match(/[a-zA-Z\d]+/g) ?? []
+      .match(/[a-zA-Z\D]+/g) ?? []
   );
 }
