[Survived] BlockStatement
helpers/version/compare.ts:41:103
  * compare('1.2.3_p1', '1.2.3', 'gentoo') // 1 (p sorts above release)
  * @since 1.9.0
  */
-export function compare(version1: string, version2: string, scheme: VersionScheme = 'semver'): number {
-  switch (scheme) {
-    case 'semver':
-      return compareSemVer(version1, version2);
-    case 'gentoo':
-      return compareGentoo(version1, version2);
-    default:
-      return assertNeverScheme(scheme);
-  }
-}
+export function compare(version1: string, version2: string, scheme: VersionScheme = 'semver'): number {}
 

[Survived] ConditionalExpression
helpers/version/compare.ts:43:5
  */
 export function compare(version1: string, version2: string, scheme: VersionScheme = 'semver'): number {
   switch (scheme) {
-    case 'semver':
-      return compareSemVer(version1, version2);
+    case 'semver':
     case 'gentoo':
       return compareGentoo(version1, version2);

[Survived] ConditionalExpression
helpers/version/compare.ts:45:5
   switch (scheme) {
     case 'semver':
       return compareSemVer(version1, version2);
-    case 'gentoo':
-      return compareGentoo(version1, version2);
+    case 'gentoo':
     default:
       return assertNeverScheme(scheme);

[Survived] ConditionalExpression
helpers/version/compare.ts:47:5
       return compareSemVer(version1, version2);
     case 'gentoo':
       return compareGentoo(version1, version2);
-    default:
-      return assertNeverScheme(scheme);
+    default:
   }
 }
