[Survived] BlockStatement
helpers/version/parse.ts:42:130
 export function parse(version: string, scheme: VersionScheme): AnyParsedVersion;
 export function parse(version: undefined, scheme?: VersionScheme): undefined;
 export function parse(version: null, scheme?: VersionScheme): null;
-export function parse(version: string | undefined | null, scheme: VersionScheme = 'semver'): AnyParsedVersion | undefined | null {
-  if (version === undefined || version === null) return version;
-  switch (scheme) {
-    case 'semver':
-      return parseSemVer(version);
-    case 'gentoo':
-      return parseGentoo(version);
-    default:
-      return assertNeverScheme(scheme);
-  }
-}
+export function parse(version: string | undefined | null, scheme: VersionScheme = 'semver'): AnyParsedVersion | undefined | null {}
 

[Survived] ConditionalExpression
helpers/version/parse.ts:43:7
 export function parse(version: undefined, scheme?: VersionScheme): undefined;
 export function parse(version: null, scheme?: VersionScheme): null;
 export function parse(version: string | undefined | null, scheme: VersionScheme = 'semver'): AnyParsedVersion | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (false) return version;
   switch (scheme) {
     case 'semver':

[Survived] ConditionalExpression
helpers/version/parse.ts:43:7
 export function parse(version: undefined, scheme?: VersionScheme): undefined;
 export function parse(version: null, scheme?: VersionScheme): null;
 export function parse(version: string | undefined | null, scheme: VersionScheme = 'semver'): AnyParsedVersion | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (false || version === null) return version;
   switch (scheme) {
     case 'semver':

[Survived] ConditionalExpression
helpers/version/parse.ts:45:5
 export function parse(version: string | undefined | null, scheme: VersionScheme = 'semver'): AnyParsedVersion | undefined | null {
   if (version === undefined || version === null) return version;
   switch (scheme) {
-    case 'semver':
-      return parseSemVer(version);
+    case 'semver':
     case 'gentoo':
       return parseGentoo(version);

[Survived] ConditionalExpression
helpers/version/parse.ts:47:5
   switch (scheme) {
     case 'semver':
       return parseSemVer(version);
-    case 'gentoo':
-      return parseGentoo(version);
+    case 'gentoo':
     default:
       return assertNeverScheme(scheme);

[Survived] StringLiteral
helpers/version/parse.ts:47:10
   switch (scheme) {
     case 'semver':
       return parseSemVer(version);
-    case 'gentoo':
+    case "":
       return parseGentoo(version);
     default:

[Survived] ConditionalExpression
helpers/version/parse.ts:49:5
       return parseSemVer(version);
     case 'gentoo':
       return parseGentoo(version);
-    default:
-      return assertNeverScheme(scheme);
+    default:
   }
 }
